{"main_page": "https://arxiv.org/abs/2404.00102", "pdf": "https://arxiv.org/pdf/2404.00102", "title": "Deeper, Sharper, Faster: Application of Efficient Transformer to Galaxy  Image Restoration", "authors": "Hyosun Park, Yongsik Jo, Seokun Kang, Taehwan Kim, M. James Jee", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "The Transformer architecture has revolutionized the field of deep learning over the past several years in diverse areas, including natural language processing, code generation, image recognition, time series forecasting, etc. We propose to apply Zamir et al.'s efficient transformer to perform deconvolution and denoising to enhance astronomical images. We conducted experiments using pairs of high-quality images and their degraded versions, and our deep learning model demonstrates exceptional restoration of photometric, structural, and morphological information. When compared with the ground-truth JWST images, the enhanced versions of our HST-quality images reduce the scatter of isophotal photometry, Sersic index, and half-light radius by factors of 4.4, 3.6, and 4.7, respectively, with Pearson correlation coefficients approaching unity. The performance is observed to degrade when input images exhibit correlated noise, point-like sources, and artifacts. We anticipate that this deep learning model will prove valuable for a number of scientific applications, including precision photometry, morphological analysis, and shear calibration."}
{"main_page": "https://arxiv.org/abs/2404.00250", "pdf": "https://arxiv.org/pdf/2404.00250", "title": "Cross-Correlated Force Measurement for Thermal Noise Reduction in  Torsion Pendulum", "authors": "Yusuke Okuma, Kiwamu Izumi, Kentaro Komori, Masaki Ando", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det)", "abstract": "The torsion pendulum is a prevailing instrument for measuring small forces acting on a solid body or those between solid bodies. While it offers powerful advantages, the measurement precision suffers from thermal noises of the suspending wires giving rise to stochastic torque noises. This letter proposes a new scheme to reduce the effect of such noise by employing a double torsion pendulum and cross-correlation technique based on the theoretical analysis that the thermal torque noise appears at each end of the suspending wire differentially. Cross-correlating two synthesized data streams which are composed of the rotation angles of two torsion stages, it yields the power spectral density estimate of external forces acting on the lower stage with the reduced effect from the thermal torque noises. As an example use case, we discuss the application to the study on the coupling strength of ultra light dark matter to standard model particles. Our evaluation indicates that the upper limit may be improved by an order of magnitude than the previous experiments at 2 mHz, which corresponds to about $8\\times10^{-18}$ eV."}
{"main_page": "https://arxiv.org/abs/2404.00277", "pdf": "https://arxiv.org/pdf/2404.00277", "title": "Radio Frequency Interference Detection Using Efficient Multi-Scale  Convolutional Attention UNet", "authors": "Fei Gu, Longfei Hao, Bo Liang, Song Feng, Shoulin Wei, Wei Dai, Yonghua Xu, Zhixuan Li, Yihang Dao", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "Studying the universe through radio telescope observation is crucial. However, radio telescopes capture not only signals from the universe but also various interfering signals, known as Radio Frequency Interference (RFI). The presence of RFI can significantly impact data analysis. Ensuring the accuracy, reliability, and scientific integrity of research findings by detecting and mitigating or eliminating RFI in observational data, presents a persistent challenge in radio astronomy. In this study, we proposed a novel deep learning model called EMSCA-UNet for RFI detection. The model employs multi-scale convolutional operations to extract RFI features of various scale sizes. Additionally, an attention mechanism is utilized to assign different weights to the extracted RFI feature maps, enabling the model to focus on vital features for RFI detection. We evaluated the performance of the model using real data observed from the 40-meter radio telescope at Yunnan Observatory. Furthermore, we compared our results to other models, including U-Net, RFI-Net, and R-Net, using four commonly employed evaluation metrics: precision, recall, F1 score, and IoU. The results demonstrate that our model outperforms the other models on all evaluation metrics, achieving an average improvement of approximately 5\\% compared to U-Net. Our model not only enhances the accuracy and comprehensiveness of RFI detection but also provides more detailed edge detection while minimizing the loss of useful signals."}
{"main_page": "https://arxiv.org/abs/2404.00840", "pdf": "https://arxiv.org/pdf/2404.00840", "title": "A proposal for enhancing technosignature search toward the Galactic  center", "authors": "Naoki Seto", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); Popular Physics (physics.pop-ph)", "abstract": "We discuss the possibility of enhancing intelligent life searches toward the Galactic center. From the clockwork orbital motions of stars around the Sgr A${}^*$ black hole, we can determine the distance to the Galactic center at an exceptional accuracy, despite its remoteness $\\sim 8.3$kpc. In addition, we can define precise reference epochs by selecting a prominent object such as the bright B-type star S2. These properties have a particular affinity for the coordinated signaling scheme which was hypothesized by Seto (2019) for systematically connecting intentional senders to searchers without a prior communication. If S2 is actually being used as a common reference clock, we can compress the search directions around the Galactic center by more than two orders of magnitude, with the scanning interval of $\\sim16$yr."}
{"main_page": "https://arxiv.org/abs/2404.01049", "pdf": "https://arxiv.org/pdf/2404.01049", "title": "A Novel Sector-Based Algorithm for an Optimized Star-Galaxy  Classification", "authors": "Anumanchi Agastya Sai Ram Likhit, Divyansh Tripathi, Akshay Agarwal", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG)", "abstract": "This paper introduces a novel sector-based methodology for star-galaxy classification, leveraging the latest Sloan Digital Sky Survey data (SDSS-DR18). By strategically segmenting the sky into sectors aligned with SDSS observational patterns and employing a dedicated convolutional neural network (CNN), we achieve state-of-the-art performance for star galaxy classification. Our preliminary results demonstrate a promising pathway for efficient and precise astronomical analysis, especially in real-time observational settings."}
{"main_page": "https://arxiv.org/abs/2404.01246", "pdf": "https://arxiv.org/pdf/2404.01246", "title": "New infrared camera of the Caucasian Mountain Observatory of the SAI  MSU: design, main parameters, and first light", "authors": "S.G. Zheltoukhov, A.M. Tatarnikov, A.A. Belyakova, E.A. Koksharova", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "This paper presents a prototype of an infrared photometer, created at SAI of MSU based on the commercial infrared module Gavin-615A. The operating spectral range of the photometer is 3-5 mkm. Investigations of the photometer's detector have shown that its parameters coincide with those stated by the manufacturer. The nonlinearity of the detector does not exceed approx 5% across the entire signal range, and coefficients for correction functions were determined. Additionally, we determined the readout noise RN=1200+-210 e-, the conversion coefficient GAIN=520+-9 e-/ADU, the signal magnitude of the bias frame BIAS = 960.5+-2.2 ADU, and the dark current 9.3e6 +-1.1e6 e-/s, which is the sum of the detector's dark current and the radiation from the entrance window of the detector module. The value of dark current was measured at a window temperature of 6C. Observations commenced with the photometer at the 2.5-m telescope of the Caucasian Mountain Observatory of MSU, with the first results presented in this paper. The unvignetted field of view was 30\". In the M band under good atmospheric conditions, an image quality close to the diffraction limit was achieved. Images of a star with brightness L=7.96 and M=6.78 were obtained over the 20-second exposure time and a SNR=10. It is shown that at high image quality with SNR=3 and exposure of 20 seconds it is possible to observe stars up to L=9 mag and M=8 mag. The main module of the photometer was also used in measurements of the sky background brightness."}
