{"main_page": "https://arxiv.org/abs/2404.00088", "pdf": "https://arxiv.org/pdf/2404.00088", "title": "Discovery of optically emitting circumgalactic nebulae around the  majority of UV-luminous quasars at intermediate redshift", "authors": "Sean D. Johnson, Zhuoqi Will Liu, Jennifer I. Li, Joop Schaye, Jenny E. Greene, Sebastiano Cantalupo, Gwen C. Rudie, Zhijie Qu, Hsiao-Wen Chen, Marc Rafelski, Sowgat Muzahid, Mandy C. Chen, Wolfram Kollatschny, Nishant Mishra, Michael Rauch, Fakhri S. Zahedy", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We report the discovery of large ionized, [O II] emitting circumgalactic nebulae around the majority of thirty UV luminous quasars at $z=0.4-1.4$ observed with deep, wide-field integral field spectroscopy (IFS) with the Multi-Unit Spectroscopy Explorer (MUSE) by the Cosmic Ultraviolet Baryon Survey (CUBS) and MUSE Quasar Blind Emitters Survey (MUSEQuBES). Among the 30 quasars, seven (23%) exhibit [O II] emitting nebulae with major axis sizes greater than 100 kpc, twenty greater than 50 kpc (67%), and 27 (90%) greater than 20 kpc. Such large, optically emitting nebulae indicate that cool, dense, and metal-enriched circumgalactic gas is common in the halos of luminous quasars at intermediate redshift. Several of the largest nebulae exhibit morphologies that suggest interaction-related origins. We detect no correlation between the sizes and cosmological dimming corrected surface brightnesses of the nebulae and quasar redshift, luminosity, black hole mass, or radio-loudness, but find a tentative correlation between the nebulae and rest-frame [O II] equivalent width in the quasar spectra. This potential trend suggests a relationship between ISM content and gas reservoirs on CGM scales. The [O II]-emitting nebulae around the $z\\approx1$ quasars are smaller and less common than Ly$\\alpha$ nebulae around $z\\approx3$ quasars. These smaller sizes can be explained if the outer regions of the Ly$\\alpha$ halos arise from scattering in more neutral gas, by evolution in the cool CGM content of quasar host halos, by lower-than-expected metallicities on $\\gtrsim50$ kpc scales around $z\\approx1$ quasars, or by changes in quasar episodic lifetimes between $z=3$ and $1$."}
{"main_page": "https://arxiv.org/abs/2404.00092", "pdf": "https://arxiv.org/pdf/2404.00092", "title": "Simulating emission line galaxies for the next generation of large-scale  structure surveys", "authors": "Wenxiang Pei, Qi Guo, Ming Li, Qiao Wang, Jiaxin Han, Jia Hu, Tong Su, Liang Gao, Jie Wang, Yu Luo, Chengliang Wei", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We investigate emission line galaxies across cosmic time by combining the modified L-Galaxies semi-analytical galaxy formation model with the JiuTian cosmological simulation. We improve the tidal disruption model of satellite galaxies in L-Galaxies to address the time dependence problem. We utilise the public code CLOUDY to compute emission line ratios for a grid of HII region models. The emission line models assume the same initial mass function as that used to generate the spectral energy distribution of semi-analytical galaxies, ensuring a coherent treatment for modelling the full galaxy spectrum. By incorporating these emission line ratios with galaxy properties, we reproduce observed luminosity functions for H$\\alpha$, H$\\beta$, [OII], and [OIII] in the local Universe and at high redshifts. We also find good agreement between model predictions and observations for auto-correlation and cross-correlation functions of [OII]-selected galaxies, as well as their luminosity dependence. The bias of emission line galaxies depends on both luminosity and redshift. At lower redshifts, it remains constant with increasing luminosity up to around $\\sim 10^{42.5}\\rm \\, erg\\,s^{-1}$ and then rises steeply for higher luminosities. The transition luminosity increases with redshift and becomes insignificant above $z$=1.5. Generally, galaxy bias shows an increasing trend with redshift. However, for luminous galaxies, the bias is higher at low redshifts, as the strong luminosity dependence observed at low redshifts diminishes at higher redshifts. We provide a fitting formula for the bias of emission line galaxies as a function of luminosity and redshift, which can be utilised for large-scale structure studies with future galaxy surveys."}
{"main_page": "https://arxiv.org/abs/2404.00097", "pdf": "https://arxiv.org/pdf/2404.00097", "title": "Mapping the Growth of Supermassive Black Holes as a Function of Galaxy  Stellar Mass and Redshift", "authors": "Fan Zou, Zhibo Yu, W. N. Brandt, Hyungsuk Tak, Guang Yang, Qingling Ni", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The growth of supermassive black holes is strongly linked to their galaxies. It has been shown that the population mean black-hole accretion rate ($\\overline{\\mathrm{BHAR}}$) primarily correlates with the galaxy stellar mass ($M_\\star$) and redshift for the general galaxy population. This work aims to provide the best measurements of $\\overline{\\mathrm{BHAR}}$ as a function of $M_\\star$ and redshift over ranges of $10^{9.5}<M_\\star<10^{12}~M_\\odot$ and $z<4$. We compile an unprecedentedly large sample with eight thousand active galactic nuclei (AGNs) and 1.3 million normal galaxies from nine high-quality survey fields following a wedding-cake design. We further develop a semiparametric Bayesian method that can reasonably estimate $\\overline{\\mathrm{BHAR}}$ and the corresponding uncertainties, even for sparsely populated regions in the parameter space. $\\overline{\\mathrm{BHAR}}$ is constrained by X-ray surveys sampling the AGN accretion power and UV-to-infrared multi-wavelength surveys sampling the galaxy population. Our results can independently predict the X-ray luminosity function (XLF) from the galaxy stellar mass function (SMF), and the prediction is consistent with the observed XLF. We also try adding external constraints from the observed SMF and XLF. We further measure $\\overline{\\mathrm{BHAR}}$ for star-forming and quiescent galaxies and show that star-forming $\\overline{\\mathrm{BHAR}}$ is generally larger than or at least comparable to the quiescent $\\overline{\\mathrm{BHAR}}$."}
{"main_page": "https://arxiv.org/abs/2404.00129", "pdf": "https://arxiv.org/pdf/2404.00129", "title": "It's a Breeze: The Circumgalactic Medium of a Dwarf Galaxy is Easy to  Strip", "authors": "Jingyao Zhu, Stephanie Tonnesen, Greg L. Bryan, Mary E. Putman", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The circumgalactic medium (CGM) of star-forming dwarf galaxies plays a key role in regulating the galactic baryonic cycle. We investigate how susceptible the CGM of dwarf satellite galaxies is to ram pressure stripping (RPS) in Milky Way-like environments. In a suite of hydrodynamical wind tunnel simulations, we model an intermediate-mass dwarf satellite galaxy ($M_{*} = 10^{7.2}~M_{\\odot}$) with a multiphase interstellar medium (ISM; $M_{\\rm ISM} = 10^{7.9}~M_{\\odot}$) and CGM ($M_{\\rm CGM,vir} = 10^{8.5}~M_{\\odot}$) along two first-infall orbits to more than 500 Myr past pericenter of a Milky Way-like host. The spatial resolution is $\\sim$79 pc in the star-forming ISM and $316-632$ pc in the CGM. Our simulations show that the dwarf satellite CGM removal is fast and effective: more than $95\\%$ of the CGM mass is ram-pressure-stripped within a few hundred Myrs, even under a weak ram pressure orbit where the ISM stripping is negligible. The conditions for CGM survival are consistent with the analytical halo gas stripping predictions in McCarthy et al. (2008). We also find that including the satellite CGM does not effectively shield its galaxy, and therefore the ISM stripping rate is unaffected. Our results imply that a dwarf galaxy CGM is unlikely to be detected in satellite galaxies; and that the star formation of gaseous dwarf satellites is likely devoid of replenishment from a CGM."}
{"main_page": "https://arxiv.org/abs/2404.00169", "pdf": "https://arxiv.org/pdf/2404.00169", "title": "Gravitational lensing by an ellipsoidal Navarro--Frenk--White  dark-matter halo: an analytic solution and its properties", "authors": "David Heyrovský, Michal Karamazov", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The analysis of gravitational lensing by galaxies and galaxy clusters typically relies on ellipsoidal lens models to describe the deflection of light by the involved dark-matter halos. These models are most often based on the isothermal density profile -- not an optimal description of the halo, but easy to use because it leads to an analytic deflection-angle formula. Dark-matter halos are better described by the Navarro--Frenk--White (NFW) density profile. We set out to study lensing by a general triaxial ellipsoidal NFW halo, with the aim of providing an analytic model that would be more consistent with the current understanding of dark-matter halos. We computed the conversion between the properties of a triaxial ellipsoidal lens model and its elliptical surface-density profile. In the case of the NFW lens model, its angular scale is defined by the projected scale semi-major axis of the halo, while its lensing regime depends on two parameters: the projected eccentricity $e$ and the convergence parameter $\\kappa_\\text{s}$. We employed the Bourassa \\& Kantowski formalism to compute the complex scattering function of the model, which yields the deflection-angle components when separated into its real and imaginary parts. We present the obtained closed-form expressions for the deflection-angle components, valid for an arbitrary eccentricity of the surface-density profile. We use them to compute and describe the lensing properties of the model, including: the shear, its components, and the phase; critical curves, caustics, and the parameter-space mapping of their geometries; the deformations and orientations of images. The analytically solved ellipsoidal NFW lens model is available for implementation in gravitational lensing software. The techniques introduced here such as the image-plane analysis can prove to be useful for understanding the properties of other lens models as well."}
{"main_page": "https://arxiv.org/abs/2404.00378", "pdf": "https://arxiv.org/pdf/2404.00378", "title": "Velocity Dispersion and H$α$ emission of Ionized Gas in  Star-forming Regions", "authors": "Evgemii O. Vasiliev, Yuri A. Shchekinov", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "For understanding the nature of gaseous flows in star-forming regions of nearby galaxies it is usually utilized the relation between surface brightness in H$\\alpha$ line and velocity dispersion of ionized gas known as ''surface brightness -- velocity dispersion diagram''. Using the three-dimensional gasdynamic simulations we consider the evolution of the synthetic diagrams for supershells driven by multiple supernova explosions in stellar cluster located in the galactic disk. We investigate the shape and structure of the diagrams depending on gaseous density and metallicity, disk scale height values. We show that there are several loci of values typical for young bubbles evolved in dense or rarefied gas at large heights above the disk midplane. We find that the structure of the diagram is depended on age of a supershell and physical conditions of a gas in the disk. We argue that the diagrams obtained for the nearby dwarf galaxies can be interpreted by only using the dynamics of bubbles driven by multiple supernova explosions in low-mass stellar clusters of different age."}
{"main_page": "https://arxiv.org/abs/2404.00381", "pdf": "https://arxiv.org/pdf/2404.00381", "title": "Tracking Dusty Cloud Crushed by a Hot Flow", "authors": "Svyatoslav Dedikov, Evgenii Vasiliev", "subjects": "Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "The destruction of clouds by strong shocks and hot winds is the key process responsible for the transp orting of metals and dust from the ISM to the ICM/IGM, and establishing the multiphase structure in and around galaxies. In this work, we perform a detailed analysis of this process using two different approaches for tracking the cloud material (gas and dust): the so-called 'colored' fluid, and the Lagrangian (trace) particles. We find that for the clouds in the hot phase ($T>10^5$ K), the two methods produce significantly different mass fractions and velocities of the cloud material. In contrast, the two methods produce similar results for the clouds that are in the warm/cold phases ($T < 10^5$ K). We find that the Kelvin--Helmholtz instability is suppressed in the warm clouds of size $\\sim$100 pc and metallicity $Z\\gt 0.1 Z_\\odot$ due to effective gas cooling. This causes a delay in the destruction of such clouds that are interacting with the hot ICM flow. We demonstrate that the dust particles that are evacuated from their 'parent' clouds to the hot medium show different dynamics when compared to that of the Lagrangian (trace) particles. Our results indicate that the dust grains swept out to the hot gas are destroyed."}
{"main_page": "https://arxiv.org/abs/2404.00537", "pdf": "https://arxiv.org/pdf/2404.00537", "title": "A Comparative Study of Star Forming Dwarf Galaxies using the UVIT", "authors": "S Amrutha, Mousumi Das, Jyoti Yadav", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We present a Far-Ultraviolet (FUV) study of sixteen star-forming dwarf galaxies (SFDGs) using the Ultraviolet Imaging Telescope (UVIT). Morphologically, SFDGs are classified as dwarf spirals, dwarf irregulars, and blue compact dwarfs (BCDs). We extracted the star-forming complexes (SFCs) from the sample galaxies, derived their sizes, and estimated the FUV+24$\\mu m$ star formation rates (SFRs). We also determined the approximate stellar disk mass associated with the SFCs using IRAC 3.6-micron images. We derived the specific SFRs (sSFRs), as well as the SFR densities ($\\Sigma(SFR)$) for the SFCs. We find that the lower $\\Sigma(SFR)$ for each type is different, with the dwarf irregulars having the lowest $\\Sigma(SFR)$ compared to others. However, the median size of the SFCs in the dwarf irregulars is the largest compared to the other two types when compared at roughly the same distance. We have derived the star-forming main sequence (SFMS) on the scale of SFCs for all three classes of SFDGs. We find that although all SFDGs approximately follow the global SFMS relation, i.e. $SFR\\propto {M_{*}}^{\\alpha}$ (where globally $\\alpha\\approx1$ for low surface brightness galaxies and $0.9$ for SFDGs), on the scale of SFCs the $\\alpha$ value for each type is different. The $\\alpha$ values for dwarf spirals, dwarf irregulars, and BCDs are found to be 0.74$\\pm$0.13, 0.8$\\pm$0.16, and 0.8$\\pm$0.19, respectively. However, the age of all SFCs approximately corresponds to 1 Gyr. Finally, we find that the outer SFCs in most galaxies except BCDs have a high sSFR, supporting the inside-out model of galaxy growth."}
{"main_page": "https://arxiv.org/abs/2404.00555", "pdf": "https://arxiv.org/pdf/2404.00555", "title": "Gas-rich Ultra-diffuse Galaxies Are Originated from High Specific  Angular Momentum", "authors": "Yu Rong, Huijie Hu, Min He, Wei Du, Qi Guo, Hui-Yuan Wang, Hong-Xin Zhang, Houjun Mo", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Ultra-diffuse galaxies, characterized by comparable effective radii to the Milky Way but possessing 100-1,000 times fewer stars, offer a unique opportunity to garner novel insights into the mechanisms governing galaxy formation. Nevertheless, the existing corpus of observational and simulation studies has not yet yielded a definitive constraint or comprehensive consensus on the formation mechanisms underlying ultra-diffuse galaxies. In this study, we delve into the properties of ultra-diffuse galaxies enriched with neutral hydrogen using a semi-analytic method, with the explicit aim of constraining existing ultra-diffuse galaxy formation models. We find that the gas-rich ultra-diffuse galaxies are statistically not failed $L^{\\star}$ galaxies nor dark matter deficient galaxies. In statistical terms, these ultra-diffuse galaxies exhibit comparable halo concentration, but higher baryonic mass fraction, as well as higher stellar and gas specific angular momentum, in comparison to typical dwarf galaxy counterparts. Our analysis unveils that higher gas specific angular momentum serves as the underlying factor elucidating the observed heightened baryonic mass fractions, diminished star formation efficiency, expanded stellar disk sizes, and reduced stellar densities in ultra-diffuse galaxies. Our findings make significant contributions to advancing our knowledge of ultra-diffuse galaxy formation and shed light on the intricate interplay between gas dynamics and the evolution of galaxies."}
{"main_page": "https://arxiv.org/abs/2404.00647", "pdf": "https://arxiv.org/pdf/2404.00647", "title": "ALMA Confirmation of Millimeter Time Variability in the Gamma-Ray  Detected Seyfert Galaxy GRS 1734-292", "authors": "Tomonari Michiyama, Yoshiyuki Inoue, Akihiro Doi, Tomoya Yamada, Yasushi Fukazawa, Hidetoshi Kubo, Samuel Barnie", "subjects": "Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "GRS 1734-292 is a radio-quiet galaxy, exhibiting neither intense starburst nor jet activities. However, Fermi-LAT detected this object in the GeV band. The origin of non-thermal activity in this Seyfert galaxy is an intriguing question. We report Atacama Large Millimeter/submillimeter Array (ALMA) observations of GRS 1734-292 at frequencies of 97.5, 145, and 225 GHz. These observations confirmed the millimeter excess within the central <100 pc region and its time variability based on two separate observations conducted four days apart. The timescale of variability aligns with the light crossing time for a compact source smaller than <100 Schwarzschild radius. If we take into account the power-law synchrotron emission originating from the corona (i.e., the hot plasma located above the accretion disk), the millimeter spectrum indicates the coronal magnetic field of ~10 G and the size of ~10 Schwarzschild radius. An alternative explanation for this millimeter emission could be synchrotron and free-free emission from disk winds (i.e., fast wide-opening angle outflows from the disk) with the size of ~10 pc, although it may be difficult to explain the fast variability. Future millimeter observations with higher resolution (~0.01\") will enable the differentiation between these two scenarios. Such observations will provide insights into the acceleration sites of high-energy particles at the core of active galactic nuclei."}
{"main_page": "https://arxiv.org/abs/2404.00669", "pdf": "https://arxiv.org/pdf/2404.00669", "title": "How common can the origin of clusters Cha I, Cha II, epsilon Cha and eta  Cha be?", "authors": "Vadim V. Bobylev, Anisa T. Bajkova", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The trajectories of the clusters $\\eta$ Cha, $\\epsilon$ Cha and Cha I, Cha II, constructed backward in time, have been studied. We concluded that the hypothesis about the joint formation of all four of these clusters from one molecular cloud cannot be completely excluded. However, 10-15 Myr ago, all these four clusters were located at approximately the same height above the plane of the Galaxy. Thus, the gas-dust clouds from which all these four clusters were formed were located on one broad front. It is possible that the appearance of the Cha I, Cha II, $\\epsilon$ Cha and $\\eta$ Cha clusters may be associated with the impact on such a front of shock waves formed after supernova explosions in the Scorpius-Centauri association. New estimates of the kinematic ages of the clusters Cha I and Cha II are obtained as $0.12\\pm0.19$ and $0.05\\pm0.15$, respectively. It is shown that the minimum size of the Cha I-north and Cha I-south clusters corresponded to the time of $0.55\\pm0.24$ Myr and $0.04\\pm0.18$ Myr ago, respectively, and approximately 1.5 Myr ago the distance between the trajectories of these two groupings was minimal."}
{"main_page": "https://arxiv.org/abs/2404.00937", "pdf": "https://arxiv.org/pdf/2404.00937", "title": "The Interaction Between Stars and Past AGN Disk: Possible Explanation  for the Kinematic Distributions of S-stars in the Galactic Center", "authors": "Xiao Fan, Qingwen Wu, Jiancheng Wu, Xiangli Lei, Mengye Wang, Fulin Li", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The presence of young stars, aged around several million years and situated within the range of $\\sim 0.04-1$ parsec from our Galactic Center raises a question about their origins and dynamical evolutions. Their kinematics provide an opportunity to explore their formation or possible subsequent dynamical evolution. If Sagittarius A* was active in the past as suggested by several observations, the accretion disk may have a significant impact on the dynamics of stars in the Galactic Center. The drag force exerted on stars during star-disk interaction could lead some of them to sink into the accretion disk, and these embedded stars will rapidly migrate inward and eventually be disrupted within $\\sim10^5$ years. This could roughly explain the absence of stars within $2.5 \\times 10^4 R_{\\rm g}$ ($\\sim$ 1000 AU). Additionally, Kozai-Lidov oscillations, induced by the gravitational perturbation of the disk, could contribute to the bimodal distribution of S-star inclinations and drive a majority of stars into high eccentricity orbits."}
{"main_page": "https://arxiv.org/abs/2404.00944", "pdf": "https://arxiv.org/pdf/2404.00944", "title": "Spiral Galaxies' Disk Dominance and Testing MOND", "authors": "Gene Byrd, Sethanne Howard", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Many Hubble type S galaxies have a flat rotation curve, V extending into the outer disk. The surface brightness there is too low to create V from stars of a reasonable mass-to-light ratio. To maintain a stable disk, a massive dark matter halo is usually assumed to dominate in creating V. Gravitational arm amplification is used here to estimate whether V is created by a disk mixture, or by a 100 percent halo. The disk surface density is not estimated from the disk surface brightness and an assumed mass to light ratio. The observed arm pitch angle is presumed to be long term maximally amplified. This permits calculation of the disk surface mass density with radius relative to a 100 percent disk which would fully create V. NGC 7217's tightly wound 4.8 degree arm pitch angle indicates a disk component contributing 43 percent of the observed V for the range over the spiral arms (important but not dominant). It has too low a disk density to create V with the rest presumably arising from a halo. V is proportional to the square root of surface density. By contrast a loose arm galaxy disk can dominate in creating V. For example NGC 3198's arm pitch angle of 30 degrees implies a disk surface density sufficient to account for 88 percent of V which is a dominant fraction. Little dark matter halo is needed for galaxies like this. Observationally, the dark outer disk may be molecular hydrogen. NGC 3198's dominant disk also provides a counter example to the need for any universal (MOND) force law modification over the outer disk spiral arms."}
{"main_page": "https://arxiv.org/abs/2404.01044", "pdf": "https://arxiv.org/pdf/2404.01044", "title": "Discovery of thionylimide, HNSO, in space: the first N-, S- and  O-bearing interstellar molecule", "authors": "Miguel Sanz-Novo, Víctor M. Rivilla, Holger S. P. Müller, Izaskun Jiménez-Serra, Jesús Martín-Pintado, Laura Colzi, Shaoshan Zeng, Andrés Megías, Álvaro López-Gallifa, Antonio Martínez-Henares, Belén Tercero, Pablo de Vicente, David San Andrés, Sergio Martín, Miguel A. Requena-Torres", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We present the first detection in space of thionylimide (HNSO) toward the Galactic Center molecular cloud G+0.693-0.027, thanks to the superb sensitivity of an ultradeep molecular line survey carried out with the Yebes 40$\\,$m and IRAM 30$\\,$m telescopes. This molecule is the first species detected in the interstellar medium containing, simultaneously, N, S and O. We have identified numerous $K$$_a$ = 0, 1 and 2 transitions belonging to HNSO covering from $J$$_{\\rm up}$ = 2 to $J$$_{\\rm up}$ = 10, including several completely unblended features. We derive a molecular column density of $N$ = (8 $\\pm$ 1)$\\times$10$^{13}$ cm$^{-2}$, yielding a fractional abundance relative to H$_2$ of $\\sim$6$\\times$10$^{-10}$, which is about $\\sim$37 and $\\sim$4.8 times less abundant than SO and SO2, respectively. Although there are still many unknowns in the interstellar chemistry of NSO-bearing molecules, we propose that HNSO is likely formed through the reaction of the NSO radical and atomic H on the surface of icy grains, with alternative routes also deserving exploration. Finally, HNSO appears as a promising link between N- , S- and O- interstellar chemistry and its discovery paves the route to the detection of a new family of molecules in space."}
{"main_page": "https://arxiv.org/abs/2404.01169", "pdf": "https://arxiv.org/pdf/2404.01169", "title": "A Comparative Study of Dust Grain Polarisation Efficiencies in the  Interstellar and Intracluster Mediums towards Anti-Center Galaxy", "authors": "N. Bijas, Chakali Eswaraiah, Panigrahy Sandhyarani, Jessy Jose, Maheswar Gopinathan", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Dust polarisation observations at optical wavelengths help understand the dust grain properties and trace the plane-of-the-sky component of the magnetic field. In this study, we make use of published optical polarisation data acquired with AIMPOL along with distances ($d$) and extinction ($A_{\\mathrm{V}}$) data. We study the variation of polarisation efficiency ($P/A_{\\mathrm{V}}$) as a function of $A_{\\mathrm{V}}$ in the diffuse interstellar medium (ISM) and intracluster mediums (ICM) using the already published polarisation data of six clusters. Among these clusters, NGC 2281, NGC 1664, and NGC 1960 are old; while Stock 8, NGC 1931, and NGC 1893 are young. We categorize stars towards each cluster into foreground, background, and cluster members by employing two clustering algorithms GMM and DBSCAN. Thus, classified field stars and cluster members are used to reveal the polarisation properties of ISM and ICM dust, respectively. We find that the dust grains located in the diffuse ISM show higher polarisation efficiencies when compared to those located in the ICM of younger clusters."}
{"main_page": "https://arxiv.org/abs/2404.01175", "pdf": "https://arxiv.org/pdf/2404.01175", "title": "Reconstructing Robust Background IFU spectra using Machine Learning", "authors": "Carter Lee Rhea, Julie Hlavacek-Larrondo, Justine Giroux, Auriane Thilloy, Hyunseop Choi, Laurie Rousseau-Nepton, Marie-Lou Gendron-Marsolais, Mario Pasquato, Simon Prunet", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "In astronomy, spectroscopy consists of observing an astrophysical source and extracting its spectrum of electromagnetic radiation. Once extracted, a model is fit to the spectra to measure the observables, leading to an understanding of the underlying physics of the emission mechanism. One crucial, and often overlooked, aspect of this model is the background emission, which contains foreground and background astrophysical sources, intervening atmospheric emission, and artifacts related to the instrument such as noise. This paper proposes an algorithmic approach to constructing a background model for SITELLE observations using statistical tools and supervised machine learning algorithms. We apply a segmentation algorithm implemented in photutils to divide the data cube into background and source spaxels. After applying a principal component analysis (PCA) on the background spaxels, we train an artificial neural network to interpolate from the background to the source spaxels in the PCA coefficient space, which allows us to generate a local background model over the entire data cube. We highlight the performance of this methodology by applying it to SITELLE observations obtained of a SIGNALS galaxy, \\NGC4449, and the Perseus galaxy cluster of galaxies, NGC 1275. We discuss the physical interpretation of the principal components and noise reduction in the resulting PCA-based reconstructions. Additionally, we compare the fit results using our new background modeling approach to standard methods used in the literature and find that our method better captures the emission from HII regions in NGC 4449 and the faint emission regions in NGC 1275. These methods also demonstrate that the background does change as a function of the position of the datacube."}
{"main_page": "https://arxiv.org/abs/2404.01269", "pdf": "https://arxiv.org/pdf/2404.01269", "title": "Metallicity and $α$-abundance for 48 million stars in  low-extinction regions in the Milky Way", "authors": "Kohei Hattori (NAOJ, The Institute of Statistical Mathematics)", "subjects": "Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "We estimate ([M/H], [$\\alpha$/M]) for 48 million giants and dwarfs in low dust extinction regions from the Gaia DR3 XP spectra by using tree-based machine-learning models trained on APOGEE DR17 and metal-poor star sample of Li et al. The root mean square error of our estimation is 0.0890 dex for [M/H] and 0.0436 dex for [$\\alpha$/M], when we evaluate our models with the test data. Our estimation is most reliable for giants and metal-rich stars, because the training data are dominated by such stars. The high-[$\\alpha$/M] stars and low-[$\\alpha$/M] stars selected by our ([M/H], [$\\alpha$/M]) show different kinematical properties for giants and low-temperature dwarfs. We further investigate how our machine-learning models extract information on ([M/H], [$\\alpha$/M]). Intriguingly, our models seem to extract information on [$\\alpha$/M] from Na D lines (589 nm) and Mg I line (516 nm). This result is understandable given the observed correlation between Na and Mg abundances in the literature. The catalog of ([M/H], [$\\alpha$/M]) as well as their associated uncertainties will be publicly available online."}
{"main_page": "https://arxiv.org/abs/2404.01289", "pdf": "https://arxiv.org/pdf/2404.01289", "title": "The galaxy cluster AC114 III. The role of galaxy clusters in the  mass-metallicity relation", "authors": "A. Andrade (1 and 2), I. Saviane (2), L. Monaco (3), I. Yegorova (2), D. Proust (4)", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We study the role of galaxy clusters in the mass-metallicity relation by using a sample of galaxies belonging to the AC114 (z=0.317) galaxy cluster. The data was taken from archival VIMOS-MOS spectroscopy to estimate gas-phase metallicities by using strong-line methods. On the other hand, the data obtained from DECaLS DR10 and VIKING DR4 ESO surveys were used to estimate photometric masses. We found that passive galaxies dominate the population of AC114 in the cluster center, whereas the star-forming members tend to be located outside this region. The constructed MZR from the latter indicates that AC114 SF galaxies have a lower metallicity content than foreground galaxies (z up to 0.28) and the same or even lower metallicities with respect to background galaxies (spanning redshifts 0.34 to 0.70), producing slightly a shallower slope compared to the field MZR at z~0.3. Additionally, it shows a higher scatter of 0.17 dex, consistent with MZRs of galaxy clusters reported in the literature. The responsible mechanisms behind the scatter are consistent with simulations and observations where dynamic and environmental effects such as galaxy-galaxy interactions and ram-pressure stripping are shaping the chemical evolution of the AC114 SF members. The former mechanism can decrease gas-phase metallicities because of pristine gas infall to the galaxy's outskirts, and the latter increases gas-phase metallicities because of the stripping of the metal-poor gas located at the outskirts of the SF members. The AC114 SF members are metal-poorer than field galaxies at the same redshift, so the cluster dominated by galaxy-galaxy interactions is the best scenario that explains the slightly shallower slope and the higher scatter of the AC114-MZR compared to the field MZR at z~0.3."}
