{"main_page": "https://arxiv.org/abs/2404.00181", "pdf": "https://arxiv.org/pdf/2404.00181", "title": "Oscillations in the Dark?", "authors": "Luis A. Escamilla, Supriya Pan, Eleonora Di Valentino, Andronikos Paliathanasis, J. Alberto Vázquez, Weiqiang Yang", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph)", "abstract": "The main aim of this work is to use a model-independent approach, along with late-time observational probes, to reconstruct the dark energy (DE) equation of state $w_{\\rm DE}(z)$. Our analysis showed that, for a late time universe, $w_{\\rm DE}$ deviates from being a constant but in contrast exhibits an oscillatory behavior, hence both quintessence ($w_{\\rm DE}> -1$) and phantom ($w_{\\rm DE} < -1$) regimes are equally allowed. In order to portray this oscillatory behavior, we explored various parametrizations for the equation of state and identified the closest approximation based on the goodness of fit with the data and the Bayesian evidence analysis. Our findings indicated that while all considered oscillating DE parametrizations provided a better fit to the data, compared to the cosmological constant, they are penalized in the Bayesian evidence analysis due to the additional free parameters. Overall, the present article demonstrates that in the low redshift regime, the equation of state of the DE prefers to be dynamical and oscillating. We anticipate that future cosmological probes will take a stand in this direction."}
{"main_page": "https://arxiv.org/abs/2404.00193", "pdf": "https://arxiv.org/pdf/2404.00193", "title": "Impact of Helium II resonant absorption on the UVB modeled in three  dimensions", "authors": "Ezra Huscher, Kristian Finlator, Samir Kušmić, Maya Steen", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "We implement a treatment of Helium {\\sc ii} absorption and re-emission into the \\TD cosmological simulations to study its impact on the metagalactic ultraviolet background (UVB) in three dimensions. By comparing simulations with and without He {\\sc ii} reprocessing, we show that it weakens the mean UVB by $\\sim$3 dex from $z = 10$ to $z = 5$ between 3.5 and 4 Ryd, where the He {\\sc ii} Lyman-series resonance occurs. In overdense regions, the overall UVB amplitude is higher and the impact of \\HeII reprocessing is weaker, qualitatively indicating an early start to \\HeII reionization near galaxies. Comparing our simulations to two popular one-dimensional UV models, we find good agreement up to 3 Ryd at $z = 5$. At higher energies, our simulation shows significantly greater He {\\sc ii} absorption because it accounts for He {\\sc ii} arising both in diffuse regions and in Lyman limit systems. By contrast, the comparison models account only for He {\\sc ii} in Lyman limit systems, which are subdominant prior to the completion of He {\\sc ii} reionization. The H {\\sc i} and He {\\sc ii} reionization histories are nearly unaffected by He {\\sc ii} reprocessing although the cosmic star formation rate density is altered by up to $4\\%$. The cosmic mass density of C {\\sc iv} is reduced by $\\sim$2 dex when He {\\sc ii} is accounted for while Si {\\sc iv}, C {\\sc ii}, Mg {\\sc ii}, Si {\\sc ii}, and O {\\sc i} are unaffected."}
{"main_page": "https://arxiv.org/abs/2404.00197", "pdf": "https://arxiv.org/pdf/2404.00197", "title": "Astrophysical systematics in Kinematic Lensing: quantifying an Intrinsic  Alignment analog", "authors": "Yu-Hsiu Huang, Elisabeth Krause, Jiachuan Xu, Tim Eifler, Prangal R. S., Eric Huff", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "Kinematic lensing (KL) is a new weak lensing technique that reduces shape noise for disk galaxies by including spectroscopically measured galaxy kinematics in addition to photometrically measured galaxy shapes. Since KL utilizes the Tully-Fisher relation, any correlation of this relation with the local environment may bias the cosmological interpretation. For the first time, we explore such a Tully-Fisher environmental dependence (TED) effect as a potential astrophysical systematic for KL. Our derivation of the TED systematic can be described in a similar analytical form as intrinsic alignment for traditional weak lensing. We demonstrate analytically that TED only impacts KL if intrinsic aligment for disk galaxies is non-zero. We further use IllustrisTNG simulations to quantify the TED effect. Our two-point correlation measurements do not yield any additional coherent signals that would indicate a systematic bias on KL, within the uncertainties set by the simulation volume."}
{"main_page": "https://arxiv.org/abs/2404.00321", "pdf": "https://arxiv.org/pdf/2404.00321", "title": "Intrinsic mass-richness relation of clusters from THE THREE HUNDRED  hydrodynamic simulations", "authors": "Mingjing Chen, Weiguang Cui, Wenjuan Fang, Zhonglue Wen", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The main systematics in cluster cosmology is the uncertainty in the mass-observable relation. In this paper, we focus on the most direct cluster observable in optical surveys, i.e. richness, and constrain the intrinsic mass-richness (MR) relation of clusters in THE THREE HUNDRED hydrodynamic simulations with two runs: GIZMO-SIMBA and GADGET-X. We find that modeling the richness at fixed halo mass with a skewed Gaussian distribution yields a simpler and smaller scatter compared to the commonly used log-normal distribution. Additionally, we observe that baryon models have a significant impact on the scatter, while exhibiting no influence on the mass dependence and a slight effect on the amplitude in the MR relation. We select member galaxies based on both stellar mass $M_\\star$ and absolute magnitude $\\mathscr{M}$. We demonstrate that the MR relation obtained from these two selections can be converted to each other by using the $M_\\star-\\mathscr{M}$ relation. Finally, we provide a 7-parameter fitting result comprehensively capturing the dependence of the MR relation on both stellar mass cutoff and redshift."}
{"main_page": "https://arxiv.org/abs/2404.00449", "pdf": "https://arxiv.org/pdf/2404.00449", "title": "Primordial Black Holes from Spatially Varying Cosmological Constant  Induced by Field Fluctuations in Extra Dimensions", "authors": "Arkady A. Popov, Sergey G. Rubin, Alexander S. Sakharov", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th)", "abstract": "The origin and evolution of supermassive black holes (SMBHs) in our universe have sparked controversy. In this study, we explore the hypothesis that some of these black holes may have seeded from the direct collapse of dark energy domains with density significantly higher than the surrounding regions. The mechanism of the origin of such domains relies on the inflationary evolution of a scalar field acting in D dimensions, which is associated with the cosmological constant in our four-dimensional spacetime manifold. Inner space quantum fluctuations of the field during inflation are responsible for the spatial variations of the dark energy density in our space. This finding holds particular significance, especially considering recent evidence from pulsar timing array observations, which supports the existence of a stochastic gravitational wave background consisting of SMBH mergers."}
{"main_page": "https://arxiv.org/abs/2404.00465", "pdf": "https://arxiv.org/pdf/2404.00465", "title": "A Promising New Dark Matter Candidate, and Implications for the Search  for Extraterrestrial Intelligence (SETI)", "authors": "A. Prillfool, A. A. Stoffers, I. Juodžbalis, M. S. Bothwell, A. J. Wojcik", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "We present a speculative exploration of the properties of a proposed new Dark Matter (DM) candidate in a heretofore under-explored region of parameter space. Our proposed ultra-cold candidatae has been a matter of speculation for some time,and has recently been tentatively identified via direct-detection. While unconventional, demonstrated existence of this DM candidate would have wide-ranging implications for a range of fields, from particle cosmology to exobiology and the Search for Extraterrestrial Life (SETI)."}
{"main_page": "https://arxiv.org/abs/2404.00744", "pdf": "https://arxiv.org/pdf/2404.00744", "title": "The distribution of Bayes' ratio", "authors": "Luca Amendola, Vrund Patel, Ziad Sakr, Elena Sellentin, Kevin Wolz", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Statistics Theory (math.ST)", "abstract": "The ratio of Bayesian evidences is a popular tool in cosmology to compare different models. There are however several issues with this method: Bayes' ratio depends on the prior even in the limit of non-informative priors, and Jeffrey's scale, used to assess the test, is arbitrary. Moreover, the standard use of Bayes' ratio is often criticized for being unable to reject models. In this paper, we address these shortcoming by promoting evidences and evidence ratios to frequentist statistics and deriving their sampling distributions. By comparing the evidence ratios to their sampling distributions, poor fitting models can now be rejected. Our method additionally does not depend on the prior in the limit of very weak priors, thereby safeguarding the experimenter against premature rejection of a theory with a uninformative prior, and replaces the arbitrary Jeffrey's scale by probability thresholds for rejection. We provide analytical solutions for some simplified cases (Gaussian data, linear parameters, and nested models), and we apply the method to cosmological supernovae Ia data. We dub our method the FB method, for Frequentist-Bayesian."}
{"main_page": "https://arxiv.org/abs/2404.00747", "pdf": "https://arxiv.org/pdf/2404.00747", "title": "Baryon acoustic scale at $z_{\\eff} = 0.166$ with the SDSS blue galaxies", "authors": "Felipe Avila, Edilson de Carvalho, Armando Bernui, Hanna Lima, Rafael C. Nunes", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "The Baryon Acoustic Oscillations (BAO) phenomenon provides a unique opportunity to establish a standard ruler at any epoch in the history of the evolving universe. The key lies in identifying a suitable cosmological tracer to conduct the measurement. In this study, we focus on quantifying the sound horizon scale of BAO in the Local Universe. Our chosen cosmological tracer is a sample of blue galaxies from the SDSS survey, positioned at the effective redshift $z_{{\\eff}} = 0.166$. Utilizing Planck-CMB input values for redshift-to-distance conversion, we derive the BAO scale $s_{\\scalebox{0.65}{\\rm BAO}} = 100.28 ^{+10.79} _{-22.96}$ Mpc$/h$ at the 1$\\sigma$ confidence level. Subsequently, we extrapolate the BAO signal scale in redshift space: $\\Delta z_{\\scalebox{0.6}{\\rm BAO}}(z_{\\rm eff}=0.166)=0.0361^{+0.00262}_ {-0.0055}$. This measurement holds the potential to discriminate among dark energy models within the Local Universe. To validate the robustness of our methodology for BAO scale measurement, we conduct three additional BAO analyses using different cosmographic approaches for distance calculation from redshifts. These tests aim to identify possible biases or systematics in our measurements of $s_{\\scalebox{0.65}{\\rm BAO}}$. Encouragingly, our diverse cosmographic approaches yield results in statistical agreement with the primary measurement, indicating no significant deviations. Conclusively, our study contributes with a novel determination of the BAO scale in the Local Universe, at $z_{{\\eff}} = 0.166$, achieved through the analysis of the SDSS blue galaxies cosmic tracer."}
{"main_page": "https://arxiv.org/abs/2404.00933", "pdf": "https://arxiv.org/pdf/2404.00933", "title": "Constraining ultra slow roll inflation using cosmological datasets", "authors": "H. V. Ragavendra, Anjan Kumar Sarkar, Shiv K. Sethi", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "In recent years, the detection of gravitational waves by LIGO and PTA collaborations have raised the intriguing possibility of excess matter power at small scales. Such an increase can be achieved by ultra slow roll (USR) phase during inflationary epoch. We constrain excess power over small scales within the framework of such models using cosmological datasets, particularly of CMB anisotropies and Lyman-$\\alpha$. We parameterize the USR phase in terms of the e-fold at the onset of USR (counted from the end of inflation) $\\bar N_1$ and the duration of USR phase $\\Delta N$. The former dictates the scale of enhancement in the primordial power spectrum, while the latter determines the amplitude of such an enhancement. From a joint dataset of CMB, SNIa and galaxy surveys, we obtain $\\bar N_1 \\lesssim 45$ with no bound on $\\Delta N$. This in turn implies that the scales over which the power spectrum can deviate significantly from the nearly scale invariant behavior of a typical slow-roll model is $k \\gtrsim 1 \\, \\rm Mpc^{-1}$. On the other hand, the Lyman-$\\alpha$ data is sensitive to baryonic power spectrum along the line of sight. We consider a semi-analytic theoretical method and high spectral-resolution Lyman-$\\alpha$ data to constrain the model. The Lyman-$\\alpha$ data limits both the USR parameters: $\\bar N_1 \\lesssim 41$ and $\\Delta N \\lesssim 0.4$. This constrains the amplitude of the power spectrum enhancement to be less than a factor of hundred over scales $1 \\lesssim k/{\\rm Mpc^{-1}} \\lesssim 100$, thereby considerably improving the constraint on power over these scales as compared to the bounds arrived at from CMB spectral distortion."}
{"main_page": "https://arxiv.org/abs/2404.01034", "pdf": "https://arxiv.org/pdf/2404.01034", "title": "Survival of Gas in Subhalos and Its Impact on the 21 cm Forest Signals:  Insights from Hydrodynamic Simulations", "authors": "Genki Naruse, Kenji Hasegawa, Kenji Kadota, Hiroyuki Tashiro, Kiyotomo Ichiki", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "Understanding the survival of gas within subhalos under various astrophysical processes is crucial for elucidating cosmic structure formation and evolution. We study the resilience of gas in subhalos, focusing on the impact of tidal and ram pressure stripping through hydrodynamic simulations. Our results uncover significant gas stripping primarily driven by ram pressure effects, which also profoundly influence the gas distribution within these subhalos. Notably, despite their vulnerability to ram pressure effects, the low-mass subhalos can play a pivotal role in influencing the observable characteristics of cosmic structures due to their large abundance. Specifically, we explore the application of our findings to the 21 cm forest, showing how the survival dynamics of gas in subhalos can modulate the 21 cm optical depth, a key probe for detecting minihalos in the pre-reionization era. (abridged) In this work, we further investigate the contribution of subhalos to the 21 cm optical depth with hydrodynamics simulations, particularly highlighting the trajectories and fates of subhalos within mass ranges of \\(10^{4-6} M_{\\odot}h^{-1}\\) in a host halo of \\(10^7 M_{\\odot}h^{-1}\\). Despite their susceptibility to ram pressure stripping, the contribution of abundant low-mass subhalos to the 21-cm optical depth is more significant than that of their massive counterparts primarily due to their greater abundance. We find that the 21-cm optical depth can be increased by a factor of approximately two due to the abundant low-mass subhalos. (abridged) Our work provides critical insights into the gas dynamics within subhalos in the early Universe, highlighting their resilience against environmental stripping effects, and their impact on observable 21-cm signals."}
{"main_page": "https://arxiv.org/abs/2404.01124", "pdf": "https://arxiv.org/pdf/2404.01124", "title": "Cosmic Web Classification through Stochastic Topological Ranking", "authors": "Alejandro Palomino, Felipe Leonardo Gómez-Cortés, Xiao-Dong Li, Jaime E. Forero-Romero", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "This paper introduces ASTRA (Algorithm for Stochastic Topological RAnking), a novel method designed for the classification of galaxies into principal cosmic web structures -- voids, sheets, filaments, and knots -- especially tailored for large spectroscopic surveys. ASTRA utilizes observed data and a corresponding random catalog, generating probabilities for data and random points to belong to each cosmic web type. Extensive evaluation includes testing on datasets from N-body simulations (dark matter only and hydrodynamical) and observations, incorporating visual inspections and quantitative analyses of mass and volume filling fractions. ASTRA demonstrates proficiency in constructing void size function catalogs and is benchmarked against established cosmic web classification methods. Spatial correlations among cosmic web types are explored using 2-point correlation functions. ASTRA's approach to the cosmic web holds promise for enhancing the retrieval of non-standard clustering statistics, thereby advancing the estimation of cosmological parameters. With simplicity, speed, and applicability across various datasets, ASTRA is a valuable tool in the quantitative study of the large-scale structure of the Universe."}
{"main_page": "https://arxiv.org/abs/2404.01236", "pdf": "https://arxiv.org/pdf/2404.01236", "title": "Cosmic topology. Part IVa. Classification of manifolds using machine  learning: a case study with small toroidal universes", "authors": "Andrius Tamosiunas, Fernando Cornet-Gomez, Yashar Akrami, Stefano Anselmi, Javier Carrón Duque, Craig J. Copi, Johannes R. Eskilt, Özenç Güngör, Andrew H. Jaffe, Arthur Kosowsky, Mikel Martin Barandiaran, James B. Mertens, Deyan P. Mihaylov, Thiago S. Pereira, Samanta Saha, Amirhossein Samandar, Glenn D. Starkman, Quinn Taylor, Valeri Vardanyan", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th)", "abstract": "Non-trivial spatial topology of the Universe may give rise to potentially measurable signatures in the cosmic microwave background. We explore different machine learning approaches to classify harmonic-space realizations of the microwave background in the test case of Euclidean $E_1$ topology (the 3-torus) with a cubic fundamental domain of a size scale significantly smaller than the diameter of the last scattering surface. Different machine learning approaches are capable of classifying the harmonic-space realizations with accuracy greater than 99% if the topology scale is half of the diameter of the last-scattering surface and orientation of the topology is known. For distinguishing random rotations of these sky realizations from realizations of the covering space, the extreme gradient boosting classifier algorithm performs best with an accuracy of 88%. Slightly lower accuracies of 83% to 87% are obtained with the random forest classifier along with one- and two-dimensional convolutional neural networks. The techniques presented here can also accurately classify non-rotated cubic $E_1$ topology realizations with a topology scale slightly larger than the diameter of the last-scattering surface, if provided enough training data. This work identifies the prospects and the main challenges for developing machine learning techniques that are capable of accurately classifying observationally viable topologies."}
