{"main_page": "https://arxiv.org/abs/2404.00088", "pdf": "https://arxiv.org/pdf/2404.00088", "title": "Discovery of optically emitting circumgalactic nebulae around the  majority of UV-luminous quasars at intermediate redshift", "authors": "Sean D. Johnson, Zhuoqi Will Liu, Jennifer I. Li, Joop Schaye, Jenny E. Greene, Sebastiano Cantalupo, Gwen C. Rudie, Zhijie Qu, Hsiao-Wen Chen, Marc Rafelski, Sowgat Muzahid, Mandy C. Chen, Wolfram Kollatschny, Nishant Mishra, Michael Rauch, Fakhri S. Zahedy", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We report the discovery of large ionized, [O II] emitting circumgalactic nebulae around the majority of thirty UV luminous quasars at $z=0.4-1.4$ observed with deep, wide-field integral field spectroscopy (IFS) with the Multi-Unit Spectroscopy Explorer (MUSE) by the Cosmic Ultraviolet Baryon Survey (CUBS) and MUSE Quasar Blind Emitters Survey (MUSEQuBES). Among the 30 quasars, seven (23%) exhibit [O II] emitting nebulae with major axis sizes greater than 100 kpc, twenty greater than 50 kpc (67%), and 27 (90%) greater than 20 kpc. Such large, optically emitting nebulae indicate that cool, dense, and metal-enriched circumgalactic gas is common in the halos of luminous quasars at intermediate redshift. Several of the largest nebulae exhibit morphologies that suggest interaction-related origins. We detect no correlation between the sizes and cosmological dimming corrected surface brightnesses of the nebulae and quasar redshift, luminosity, black hole mass, or radio-loudness, but find a tentative correlation between the nebulae and rest-frame [O II] equivalent width in the quasar spectra. This potential trend suggests a relationship between ISM content and gas reservoirs on CGM scales. The [O II]-emitting nebulae around the $z\\approx1$ quasars are smaller and less common than Ly$\\alpha$ nebulae around $z\\approx3$ quasars. These smaller sizes can be explained if the outer regions of the Ly$\\alpha$ halos arise from scattering in more neutral gas, by evolution in the cool CGM content of quasar host halos, by lower-than-expected metallicities on $\\gtrsim50$ kpc scales around $z\\approx1$ quasars, or by changes in quasar episodic lifetimes between $z=3$ and $1$."}
{"main_page": "https://arxiv.org/abs/2404.00092", "pdf": "https://arxiv.org/pdf/2404.00092", "title": "Simulating emission line galaxies for the next generation of large-scale  structure surveys", "authors": "Wenxiang Pei, Qi Guo, Ming Li, Qiao Wang, Jiaxin Han, Jia Hu, Tong Su, Liang Gao, Jie Wang, Yu Luo, Chengliang Wei", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We investigate emission line galaxies across cosmic time by combining the modified L-Galaxies semi-analytical galaxy formation model with the JiuTian cosmological simulation. We improve the tidal disruption model of satellite galaxies in L-Galaxies to address the time dependence problem. We utilise the public code CLOUDY to compute emission line ratios for a grid of HII region models. The emission line models assume the same initial mass function as that used to generate the spectral energy distribution of semi-analytical galaxies, ensuring a coherent treatment for modelling the full galaxy spectrum. By incorporating these emission line ratios with galaxy properties, we reproduce observed luminosity functions for H$\\alpha$, H$\\beta$, [OII], and [OIII] in the local Universe and at high redshifts. We also find good agreement between model predictions and observations for auto-correlation and cross-correlation functions of [OII]-selected galaxies, as well as their luminosity dependence. The bias of emission line galaxies depends on both luminosity and redshift. At lower redshifts, it remains constant with increasing luminosity up to around $\\sim 10^{42.5}\\rm \\, erg\\,s^{-1}$ and then rises steeply for higher luminosities. The transition luminosity increases with redshift and becomes insignificant above $z$=1.5. Generally, galaxy bias shows an increasing trend with redshift. However, for luminous galaxies, the bias is higher at low redshifts, as the strong luminosity dependence observed at low redshifts diminishes at higher redshifts. We provide a fitting formula for the bias of emission line galaxies as a function of luminosity and redshift, which can be utilised for large-scale structure studies with future galaxy surveys."}
{"main_page": "https://arxiv.org/abs/2404.00093", "pdf": "https://arxiv.org/pdf/2404.00093", "title": "JWST COMPASS: NIRSpec/G395H Transmission Observations of the Super-Earth  TOI-836b", "authors": "Lili Alderson, Natasha E. Batalha, Hannah R. Wakeford, Nicole L. Wallack, Artyom Aguichine, Johanna Teske, Jea Adams Redai, Munazza K. Alam, Natalie M. Batalha, Peter Gao, James Kirk, Mercedes Lopez-Morales, Sarah E. Moran, Nicholas Scarsdale, Nicholas F. Wogan, Angie Wolfgang", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "We present two transit observations of the ~870K, 1.7R$_E$ super-Earth TOI-836b with JWST NIRSpec/G395H, resulting in a 2.8-5.2$\\mu$m transmission spectrum. Using two different reduction pipelines, we obtain a median transit depth precision of 34ppm for Visit 1 and 36ppm for Visit 2, leading to a combined precision of 25ppm in spectroscopic channels 30 pixels wide (~0.02$\\mu$m). We find that the transmission spectrum from both visits is well fit by a zero-sloped line by fitting zero-sloped and sloped lines, as well as step functions to our data. Combining both visits, we are able to rule out atmospheres with metallicities <250xSolar for an opaque pressure level of 0.1 bar, corresponding to mean molecular weights to <6gmol$^{-1}$. We therefore conclude that TOI-836b does not have an H$_2$-dominated atmosphere, in possible contrast with its larger, exterior sibling planet, TOI-836c. We recommend that future proposals to observe small planets exercise caution when requiring specific numbers of transits to rule out physical scenarios, particularly for high metallicities and planets around bright host stars, as PandExo predictions appear to be more optimistic than that suggested by the gains from additional transits implied by our data."}
{"main_page": "https://arxiv.org/abs/2404.00097", "pdf": "https://arxiv.org/pdf/2404.00097", "title": "Mapping the Growth of Supermassive Black Holes as a Function of Galaxy  Stellar Mass and Redshift", "authors": "Fan Zou, Zhibo Yu, W. N. Brandt, Hyungsuk Tak, Guang Yang, Qingling Ni", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The growth of supermassive black holes is strongly linked to their galaxies. It has been shown that the population mean black-hole accretion rate ($\\overline{\\mathrm{BHAR}}$) primarily correlates with the galaxy stellar mass ($M_\\star$) and redshift for the general galaxy population. This work aims to provide the best measurements of $\\overline{\\mathrm{BHAR}}$ as a function of $M_\\star$ and redshift over ranges of $10^{9.5}<M_\\star<10^{12}~M_\\odot$ and $z<4$. We compile an unprecedentedly large sample with eight thousand active galactic nuclei (AGNs) and 1.3 million normal galaxies from nine high-quality survey fields following a wedding-cake design. We further develop a semiparametric Bayesian method that can reasonably estimate $\\overline{\\mathrm{BHAR}}$ and the corresponding uncertainties, even for sparsely populated regions in the parameter space. $\\overline{\\mathrm{BHAR}}$ is constrained by X-ray surveys sampling the AGN accretion power and UV-to-infrared multi-wavelength surveys sampling the galaxy population. Our results can independently predict the X-ray luminosity function (XLF) from the galaxy stellar mass function (SMF), and the prediction is consistent with the observed XLF. We also try adding external constraints from the observed SMF and XLF. We further measure $\\overline{\\mathrm{BHAR}}$ for star-forming and quiescent galaxies and show that star-forming $\\overline{\\mathrm{BHAR}}$ is generally larger than or at least comparable to the quiescent $\\overline{\\mathrm{BHAR}}$."}
{"main_page": "https://arxiv.org/abs/2404.00102", "pdf": "https://arxiv.org/pdf/2404.00102", "title": "Deeper, Sharper, Faster: Application of Efficient Transformer to Galaxy  Image Restoration", "authors": "Hyosun Park, Yongsik Jo, Seokun Kang, Taehwan Kim, M. James Jee", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "The Transformer architecture has revolutionized the field of deep learning over the past several years in diverse areas, including natural language processing, code generation, image recognition, time series forecasting, etc. We propose to apply Zamir et al.'s efficient transformer to perform deconvolution and denoising to enhance astronomical images. We conducted experiments using pairs of high-quality images and their degraded versions, and our deep learning model demonstrates exceptional restoration of photometric, structural, and morphological information. When compared with the ground-truth JWST images, the enhanced versions of our HST-quality images reduce the scatter of isophotal photometry, Sersic index, and half-light radius by factors of 4.4, 3.6, and 4.7, respectively, with Pearson correlation coefficients approaching unity. The performance is observed to degrade when input images exhibit correlated noise, point-like sources, and artifacts. We anticipate that this deep learning model will prove valuable for a number of scientific applications, including precision photometry, morphological analysis, and shear calibration."}
{"main_page": "https://arxiv.org/abs/2404.00104", "pdf": "https://arxiv.org/pdf/2404.00104", "title": "Accurate PRD modeling of the forward-scattering Hanle effect in the  chromospheric CaI 4227 Å line", "authors": "Luca Belluzzi, Simone Riva, Gioele Janett, Nuno Guerreiro, Fabio Riva, Pietro Benedusi, Tanausú del Pino Alemán, Ernest Alsina Ballester, Javier Trujillo Bueno, Jiří Štěpán", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Measurable linear scattering polarization signals have been predicted and detected at the solar disk center in the core of chromospheric lines. These forward-scattering polarization signals, which are of high interest for magnetic field diagnostics, have always been modeled either under the assumption of complete frequency redistribution (CRD), or taking partial frequency redistribution (PRD) effects into account under the angle-averaged (AA) approximation. This work aims at assessing the suitability of the CRD and PRD-AA approximations for modeling the forward-scattering polarization signals produced by the presence of an inclined magnetic field, the so-called forward-scattering Hanle effect, in the chromospheric CaI 4227 A line. Radiative transfer calculations are performed in semi-empirical 1D solar atmospheres, out of local thermodynamic equilibrium (LTE). A two-step solution strategy is applied: the non-LTE RT problem is first solved considering a multilevel atom and neglecting polarization phenomena. The same problem is then solved including polarization, considering a two-level atom and keeping fixed the lower-level population calculated at the previous step. The emergent linear polarization signals calculated under the CRD and PRD-AA approximations are analyzed and compared to those obtained by modeling PRD effects in their general angle-dependent (AD) formulation. With respect to the PRD-AD case, the CRD and PRD-AA calculations significantly underestimate the amplitude of the line-center polarization signals produced by the forward-scattering Hanle effect. The results of this work suggest that a PRD-AD modeling is required in order to develop reliable diagnostic techniques exploiting the forward-scattering polarization signals observed in the CaI 4227 A line. These results need to be confirmed by full 3D calculations including non-magnetic symmetry-breaking effects."}
{"main_page": "https://arxiv.org/abs/2404.00105", "pdf": "https://arxiv.org/pdf/2404.00105", "title": "Diagnostics of the solar coronal plasmas by magnetohydrodynamic waves:  Magnetohydrodynamic seismology", "authors": "Valery M. Nakariakov, Sihui Zhong, Dmitrii Y. Kolotkov, Rebecca L. Meadowcroft, Yu Zhong, Ding Yuan", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph); Space Physics (physics.space-ph)", "abstract": "Macroscopic wave and oscillatory phenomena ubiquitously detected in the plasma of the corona of the Sun are interpreted in terms of magnetohydrodynamic theory. Fast and slow magnetoacoustic waves are clearly distinguished in observations. Properties of coronal magnetohydrodynamic waves are determined by local parameters of the plasma, including the field-aligned filamentation typical for the corona. It makes coronal magnetohydrodynamic waves reliable probes of the coronal plasma structures by the method of magnetohydrodynamic seismology. For example, propagating slow waves indicate the local direction of the guiding magnetic field. Standing, sloshing and propagating slow waves can be used for probing the coronal heating function and the polytropic index. Kink oscillations of coronal plasma loops provide us with the estimations of the absolute value of the magnetic field in oscillating plasma loops. This tutorial introduces several techniques of magnetohydrodynamic seismology of solar coronal plasmas. It includes the description of practical steps in the data acquisition, pre-processing, and processing using the open-access data of the Atmospheric Imaging Assembly on the Solar Dynamics Observatory spacecraft, and elaborated data analysis techniques of motion magnification and Bayesian statistics."}
{"main_page": "https://arxiv.org/abs/2404.00127", "pdf": "https://arxiv.org/pdf/2404.00127", "title": "Non-thermal broadening of coronal lines in a 3D MHD loop model", "authors": "C.A. Breu, H. Peter, S.K. Solanki, R. Cameron, I. De Moortel", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Observed spectral profiles of emission lines from the corona are found to have widths exceeding the thermal line width. To investigate the physical mechanism, we run a 3D MHD model of a single, straightened loop in which we partially resolve turbulent motions that form in response to the driving by self-consistently evolving magneto-convection in the photosphere. The convective motions shear and twist the magnetic field lines, leading to heating. From the model we synthesize spectral profiles of emission lines forming at temperatures around and above 1 MK. The coronal heating process generates a range of velocity amplitudes and directions structured on a scale much smaller than the resolving power of current instruments, leading to a broadening of the spectral lines. Our model includes the mass exchange between corona and chromosphere, thus we also capture flows parallel to the loop axis. We find that the spectral lines show a non-thermal line broadening roughly consistent with observations for a viewing angle perpendicular to the axis. The broadening through field-parallel flows is comparable, although slightly smaller. The line broadening is independent of the instrument resolution for a perpendicular line-of-sight. We can connect the non-thermal line broadening to heating events and flows. While small-scale velocities along the line-of-sight are mainly responsible for the broadening observed perpendicular to the loop, chromospheric evaporation is important for the line broadening observed along the loop. The model reproduces observed values for non-thermal line widths. In the model these result from continuous driving by magnetoconvection, without imposing driving motions or starting from an already braided field."}
{"main_page": "https://arxiv.org/abs/2404.00129", "pdf": "https://arxiv.org/pdf/2404.00129", "title": "It's a Breeze: The Circumgalactic Medium of a Dwarf Galaxy is Easy to  Strip", "authors": "Jingyao Zhu, Stephanie Tonnesen, Greg L. Bryan, Mary E. Putman", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The circumgalactic medium (CGM) of star-forming dwarf galaxies plays a key role in regulating the galactic baryonic cycle. We investigate how susceptible the CGM of dwarf satellite galaxies is to ram pressure stripping (RPS) in Milky Way-like environments. In a suite of hydrodynamical wind tunnel simulations, we model an intermediate-mass dwarf satellite galaxy ($M_{*} = 10^{7.2}~M_{\\odot}$) with a multiphase interstellar medium (ISM; $M_{\\rm ISM} = 10^{7.9}~M_{\\odot}$) and CGM ($M_{\\rm CGM,vir} = 10^{8.5}~M_{\\odot}$) along two first-infall orbits to more than 500 Myr past pericenter of a Milky Way-like host. The spatial resolution is $\\sim$79 pc in the star-forming ISM and $316-632$ pc in the CGM. Our simulations show that the dwarf satellite CGM removal is fast and effective: more than $95\\%$ of the CGM mass is ram-pressure-stripped within a few hundred Myrs, even under a weak ram pressure orbit where the ISM stripping is negligible. The conditions for CGM survival are consistent with the analytical halo gas stripping predictions in McCarthy et al. (2008). We also find that including the satellite CGM does not effectively shield its galaxy, and therefore the ISM stripping rate is unaffected. Our results imply that a dwarf galaxy CGM is unlikely to be detected in satellite galaxies; and that the star formation of gaseous dwarf satellites is likely devoid of replenishment from a CGM."}
{"main_page": "https://arxiv.org/abs/2404.00135", "pdf": "https://arxiv.org/pdf/2404.00135", "title": "Coronal Signatures of Flare Generated Fast Mode Wave at EUV and Radio  wavelengths", "authors": "V. Vasanth", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "This paper presents a detailed study of the type II solar radio burst that occurred on 06 March 2014 using combined data analysis. It is a classical radio event consisting of type III radio burst and a following type II radio burst in the dynamic spectrum. The type II radio burst is observed between 235 - 130 MHz (120 - 60 MHz) in harmonic (fundamental) bands with the life time of 5 minutes between 09:26 UT - 09:31 UT. The estimated speed of type II burst by applying twofold Saito model is 650 km/s. An extreme ultraviolet (EUV) wave is observed with Atmospheric Imaging Assembly (AIA) onboard the Solar Dynamics Observatory (SDO) pass bands. The very close temporal onset association of EUV wave and flare energy release indicates that the EUV wave is likely produced by a flare pressure pulse. The eruption is also accompanied by a weak coronal mass ejection (CME) observed with the coronagraphs onboard Solar and Heliospheric Observatory (SOHO) and the twin Solar Terrestrial Relations Observatory (STEREO). The plane of sky speed of the CME was 252 km/s at SOHO/LASCO-C2 and 280 km/s at STEREO-B/SECCHI-COR1 FOV. The EUV wave has two wave fronts, one expanding radially outward, and the other one moving along the arcade. The source position of the type II burst imaged by the Nancay Radio Heliograph (NRH) shows that it was associated with the outward moving EUV wave. The CME is independent of the shock wave as confirmed by the location of NRH radio sources below the CME's leading edge. Therefore the type II radio burst is probably ignited by the flare. This study shows the possibility of EUV wave and coronal shock triggered by flare pressure pulse, generating the observed type II radio burst."}
{"main_page": "https://arxiv.org/abs/2404.00151", "pdf": "https://arxiv.org/pdf/2404.00151", "title": "Discovery of the Longest-Period Classical Cepheid in the Milky Way", "authors": "I. Soszyński, D. M. Skowron, A. Udalski, P. Pietrukowicz, M. Gromadzki, M. K. Szymański, J. Skowron, P. Mróz, R. Poleski, S. Kozłowski, P. Iwanek, M. Wrona, K. Ulaczyk, K. Rybicki, M. Mróz", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We report the discovery of the classical Cepheid OGLE-GD-CEP-1884 (= GDS_J1535467-555656) with the longest pulsation period known in our Galaxy. The period of 78.14 d is nearly 10 d longer than that of the previous record-holding Cepheid, S Vulpeculae, and thus, OGLE-GD-CEP-1884 can be categorized as the first ultra long period Cepheid in the Milky Way. This star is present in the ASAS-SN and Gaia DR3 catalogs of variable stars, but it has been classified as a long-period variable in those catalogs. Based on more than 10 years of the photometric monitoring of this star carried out by the OGLE project in the I and V bands and a radial velocity curve from the Gaia Focused Product Release, we unequivocally demonstrate that this object is a fundamental-mode classical Cepheid. By employing the mid-infrared period-luminosity relation, we determine the distance to OGLE-GD-CEP-1884 (4.47 +- 0.34 kpc) and place it on the Milky Way map, along with about 2400 other classical Cepheids. We also discuss the potential of finding additional ultra long period Cepheids in our Galaxy."}
{"main_page": "https://arxiv.org/abs/2404.00169", "pdf": "https://arxiv.org/pdf/2404.00169", "title": "Gravitational lensing by an ellipsoidal Navarro--Frenk--White  dark-matter halo: an analytic solution and its properties", "authors": "David Heyrovský, Michal Karamazov", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The analysis of gravitational lensing by galaxies and galaxy clusters typically relies on ellipsoidal lens models to describe the deflection of light by the involved dark-matter halos. These models are most often based on the isothermal density profile -- not an optimal description of the halo, but easy to use because it leads to an analytic deflection-angle formula. Dark-matter halos are better described by the Navarro--Frenk--White (NFW) density profile. We set out to study lensing by a general triaxial ellipsoidal NFW halo, with the aim of providing an analytic model that would be more consistent with the current understanding of dark-matter halos. We computed the conversion between the properties of a triaxial ellipsoidal lens model and its elliptical surface-density profile. In the case of the NFW lens model, its angular scale is defined by the projected scale semi-major axis of the halo, while its lensing regime depends on two parameters: the projected eccentricity $e$ and the convergence parameter $\\kappa_\\text{s}$. We employed the Bourassa \\& Kantowski formalism to compute the complex scattering function of the model, which yields the deflection-angle components when separated into its real and imaginary parts. We present the obtained closed-form expressions for the deflection-angle components, valid for an arbitrary eccentricity of the surface-density profile. We use them to compute and describe the lensing properties of the model, including: the shear, its components, and the phase; critical curves, caustics, and the parameter-space mapping of their geometries; the deformations and orientations of images. The analytically solved ellipsoidal NFW lens model is available for implementation in gravitational lensing software. The techniques introduced here such as the image-plane analysis can prove to be useful for understanding the properties of other lens models as well."}
{"main_page": "https://arxiv.org/abs/2404.00181", "pdf": "https://arxiv.org/pdf/2404.00181", "title": "Oscillations in the Dark?", "authors": "Luis A. Escamilla, Supriya Pan, Eleonora Di Valentino, Andronikos Paliathanasis, J. Alberto Vázquez, Weiqiang Yang", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph)", "abstract": "The main aim of this work is to use a model-independent approach, along with late-time observational probes, to reconstruct the dark energy (DE) equation of state $w_{\\rm DE}(z)$. Our analysis showed that, for a late time universe, $w_{\\rm DE}$ deviates from being a constant but in contrast exhibits an oscillatory behavior, hence both quintessence ($w_{\\rm DE}> -1$) and phantom ($w_{\\rm DE} < -1$) regimes are equally allowed. In order to portray this oscillatory behavior, we explored various parametrizations for the equation of state and identified the closest approximation based on the goodness of fit with the data and the Bayesian evidence analysis. Our findings indicated that while all considered oscillating DE parametrizations provided a better fit to the data, compared to the cosmological constant, they are penalized in the Bayesian evidence analysis due to the additional free parameters. Overall, the present article demonstrates that in the low redshift regime, the equation of state of the DE prefers to be dynamical and oscillating. We anticipate that future cosmological probes will take a stand in this direction."}
{"main_page": "https://arxiv.org/abs/2404.00193", "pdf": "https://arxiv.org/pdf/2404.00193", "title": "Impact of Helium II resonant absorption on the UVB modeled in three  dimensions", "authors": "Ezra Huscher, Kristian Finlator, Samir Kušmić, Maya Steen", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "We implement a treatment of Helium {\\sc ii} absorption and re-emission into the \\TD cosmological simulations to study its impact on the metagalactic ultraviolet background (UVB) in three dimensions. By comparing simulations with and without He {\\sc ii} reprocessing, we show that it weakens the mean UVB by $\\sim$3 dex from $z = 10$ to $z = 5$ between 3.5 and 4 Ryd, where the He {\\sc ii} Lyman-series resonance occurs. In overdense regions, the overall UVB amplitude is higher and the impact of \\HeII reprocessing is weaker, qualitatively indicating an early start to \\HeII reionization near galaxies. Comparing our simulations to two popular one-dimensional UV models, we find good agreement up to 3 Ryd at $z = 5$. At higher energies, our simulation shows significantly greater He {\\sc ii} absorption because it accounts for He {\\sc ii} arising both in diffuse regions and in Lyman limit systems. By contrast, the comparison models account only for He {\\sc ii} in Lyman limit systems, which are subdominant prior to the completion of He {\\sc ii} reionization. The H {\\sc i} and He {\\sc ii} reionization histories are nearly unaffected by He {\\sc ii} reprocessing although the cosmic star formation rate density is altered by up to $4\\%$. The cosmic mass density of C {\\sc iv} is reduced by $\\sim$2 dex when He {\\sc ii} is accounted for while Si {\\sc iv}, C {\\sc ii}, Mg {\\sc ii}, Si {\\sc ii}, and O {\\sc i} are unaffected."}
{"main_page": "https://arxiv.org/abs/2404.00197", "pdf": "https://arxiv.org/pdf/2404.00197", "title": "Astrophysical systematics in Kinematic Lensing: quantifying an Intrinsic  Alignment analog", "authors": "Yu-Hsiu Huang, Elisabeth Krause, Jiachuan Xu, Tim Eifler, Prangal R. S., Eric Huff", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "Kinematic lensing (KL) is a new weak lensing technique that reduces shape noise for disk galaxies by including spectroscopically measured galaxy kinematics in addition to photometrically measured galaxy shapes. Since KL utilizes the Tully-Fisher relation, any correlation of this relation with the local environment may bias the cosmological interpretation. For the first time, we explore such a Tully-Fisher environmental dependence (TED) effect as a potential astrophysical systematic for KL. Our derivation of the TED systematic can be described in a similar analytical form as intrinsic alignment for traditional weak lensing. We demonstrate analytically that TED only impacts KL if intrinsic aligment for disk galaxies is non-zero. We further use IllustrisTNG simulations to quantify the TED effect. Our two-point correlation measurements do not yield any additional coherent signals that would indicate a systematic bias on KL, within the uncertainties set by the simulation volume."}
{"main_page": "https://arxiv.org/abs/2404.00250", "pdf": "https://arxiv.org/pdf/2404.00250", "title": "Cross-Correlated Force Measurement for Thermal Noise Reduction in  Torsion Pendulum", "authors": "Yusuke Okuma, Kiwamu Izumi, Kentaro Komori, Masaki Ando", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det)", "abstract": "The torsion pendulum is a prevailing instrument for measuring small forces acting on a solid body or those between solid bodies. While it offers powerful advantages, the measurement precision suffers from thermal noises of the suspending wires giving rise to stochastic torque noises. This letter proposes a new scheme to reduce the effect of such noise by employing a double torsion pendulum and cross-correlation technique based on the theoretical analysis that the thermal torque noise appears at each end of the suspending wire differentially. Cross-correlating two synthesized data streams which are composed of the rotation angles of two torsion stages, it yields the power spectral density estimate of external forces acting on the lower stage with the reduced effect from the thermal torque noises. As an example use case, we discuss the application to the study on the coupling strength of ultra light dark matter to standard model particles. Our evaluation indicates that the upper limit may be improved by an order of magnitude than the previous experiments at 2 mHz, which corresponds to about $8\\times10^{-18}$ eV."}
{"main_page": "https://arxiv.org/abs/2404.00277", "pdf": "https://arxiv.org/pdf/2404.00277", "title": "Radio Frequency Interference Detection Using Efficient Multi-Scale  Convolutional Attention UNet", "authors": "Fei Gu, Longfei Hao, Bo Liang, Song Feng, Shoulin Wei, Wei Dai, Yonghua Xu, Zhixuan Li, Yihang Dao", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "Studying the universe through radio telescope observation is crucial. However, radio telescopes capture not only signals from the universe but also various interfering signals, known as Radio Frequency Interference (RFI). The presence of RFI can significantly impact data analysis. Ensuring the accuracy, reliability, and scientific integrity of research findings by detecting and mitigating or eliminating RFI in observational data, presents a persistent challenge in radio astronomy. In this study, we proposed a novel deep learning model called EMSCA-UNet for RFI detection. The model employs multi-scale convolutional operations to extract RFI features of various scale sizes. Additionally, an attention mechanism is utilized to assign different weights to the extracted RFI feature maps, enabling the model to focus on vital features for RFI detection. We evaluated the performance of the model using real data observed from the 40-meter radio telescope at Yunnan Observatory. Furthermore, we compared our results to other models, including U-Net, RFI-Net, and R-Net, using four commonly employed evaluation metrics: precision, recall, F1 score, and IoU. The results demonstrate that our model outperforms the other models on all evaluation metrics, achieving an average improvement of approximately 5\\% compared to U-Net. Our model not only enhances the accuracy and comprehensiveness of RFI detection but also provides more detailed edge detection while minimizing the loss of useful signals."}
{"main_page": "https://arxiv.org/abs/2404.00321", "pdf": "https://arxiv.org/pdf/2404.00321", "title": "Intrinsic mass-richness relation of clusters from THE THREE HUNDRED  hydrodynamic simulations", "authors": "Mingjing Chen, Weiguang Cui, Wenjuan Fang, Zhonglue Wen", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The main systematics in cluster cosmology is the uncertainty in the mass-observable relation. In this paper, we focus on the most direct cluster observable in optical surveys, i.e. richness, and constrain the intrinsic mass-richness (MR) relation of clusters in THE THREE HUNDRED hydrodynamic simulations with two runs: GIZMO-SIMBA and GADGET-X. We find that modeling the richness at fixed halo mass with a skewed Gaussian distribution yields a simpler and smaller scatter compared to the commonly used log-normal distribution. Additionally, we observe that baryon models have a significant impact on the scatter, while exhibiting no influence on the mass dependence and a slight effect on the amplitude in the MR relation. We select member galaxies based on both stellar mass $M_\\star$ and absolute magnitude $\\mathscr{M}$. We demonstrate that the MR relation obtained from these two selections can be converted to each other by using the $M_\\star-\\mathscr{M}$ relation. Finally, we provide a 7-parameter fitting result comprehensively capturing the dependence of the MR relation on both stellar mass cutoff and redshift."}
{"main_page": "https://arxiv.org/abs/2404.00339", "pdf": "https://arxiv.org/pdf/2404.00339", "title": "Quadrupole Moment of a Magnetically Confined Mountain on an Accreting  Neutron Star in General Relativity", "authors": "Pedro Henrique Barboza Rossetto, Jörg Frauendiener, Andrew Melatos", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "General relativistic corrections are calculated for the quadrupole moment of a magnetically confined mountain on an accreting neutron star. The hydromagnetic structure of the mountain satisfies the general relativistic Grad-Shafranov equation supplemented by the flux-freezing condition of ideal magnetohydrodynamics, as in previous calculations of the magnetic dipole moment. It is found that the ellipticity and hence the gravitational wave strain is $4\\%$ to $12\\%$ smaller than in the analogous Newtonian system. The direct contribution of the magnetic field to the nonaxisymmetric component of the stress-energy tensor is also considered, and it is shown that it is negligible in systems such as low-mass X-ray binaries."}
{"main_page": "https://arxiv.org/abs/2404.00363", "pdf": "https://arxiv.org/pdf/2404.00363", "title": "Recent progresses in strange quark stars", "authors": "Xiao-Li Zhang, Yong-Feng Huang, Ze-Cheng Zou", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "According to the hypothesis that strange quark matter may be the true ground state of matter at extremely high densities, strange quark stars should be stable and could exist in the Universe. It is possible that pulsars may actually be strange stars, but not neutron stars. Here we present a short review on recent progresses in the field of strange quark stars. Three popular phenomenological models widely used to describe strange quark matter are introduced, with special attention being paid on the corresponding equation of state in each model. Combining the equation of state with the Tolman-Oppenheimer-Volkov equations, the inner structure and mass-radius relation can be obtained for the whole sequence of strange stars. Strong gravitational wave emissions may be generated by strange stars through various mechanisms, which may help identify strange stars via observations. Especially, close-in strange quark planets with respect to their hosts may provide a unique test for the existence of strange quark objects. Fierce electromagnetic bursts could also be generated by strange stars. The energy may come from the phase transition of neutron stars to strange stars, or from the merger of binary strange stars. The collapse of the strange star crust can also release a huge amount of energy. It is shown that strange quark stars may be involved in short gamma-ray bursts and fast radio bursts."}
{"main_page": "https://arxiv.org/abs/2404.00378", "pdf": "https://arxiv.org/pdf/2404.00378", "title": "Velocity Dispersion and H$α$ emission of Ionized Gas in  Star-forming Regions", "authors": "Evgemii O. Vasiliev, Yuri A. Shchekinov", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "For understanding the nature of gaseous flows in star-forming regions of nearby galaxies it is usually utilized the relation between surface brightness in H$\\alpha$ line and velocity dispersion of ionized gas known as ''surface brightness -- velocity dispersion diagram''. Using the three-dimensional gasdynamic simulations we consider the evolution of the synthetic diagrams for supershells driven by multiple supernova explosions in stellar cluster located in the galactic disk. We investigate the shape and structure of the diagrams depending on gaseous density and metallicity, disk scale height values. We show that there are several loci of values typical for young bubbles evolved in dense or rarefied gas at large heights above the disk midplane. We find that the structure of the diagram is depended on age of a supershell and physical conditions of a gas in the disk. We argue that the diagrams obtained for the nearby dwarf galaxies can be interpreted by only using the dynamics of bubbles driven by multiple supernova explosions in low-mass stellar clusters of different age."}
{"main_page": "https://arxiv.org/abs/2404.00381", "pdf": "https://arxiv.org/pdf/2404.00381", "title": "Tracking Dusty Cloud Crushed by a Hot Flow", "authors": "Svyatoslav Dedikov, Evgenii Vasiliev", "subjects": "Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "The destruction of clouds by strong shocks and hot winds is the key process responsible for the transp orting of metals and dust from the ISM to the ICM/IGM, and establishing the multiphase structure in and around galaxies. In this work, we perform a detailed analysis of this process using two different approaches for tracking the cloud material (gas and dust): the so-called 'colored' fluid, and the Lagrangian (trace) particles. We find that for the clouds in the hot phase ($T>10^5$ K), the two methods produce significantly different mass fractions and velocities of the cloud material. In contrast, the two methods produce similar results for the clouds that are in the warm/cold phases ($T < 10^5$ K). We find that the Kelvin--Helmholtz instability is suppressed in the warm clouds of size $\\sim$100 pc and metallicity $Z\\gt 0.1 Z_\\odot$ due to effective gas cooling. This causes a delay in the destruction of such clouds that are interacting with the hot ICM flow. We demonstrate that the dust particles that are evacuated from their 'parent' clouds to the hot medium show different dynamics when compared to that of the Lagrangian (trace) particles. Our results indicate that the dust grains swept out to the hot gas are destroyed."}
{"main_page": "https://arxiv.org/abs/2404.00449", "pdf": "https://arxiv.org/pdf/2404.00449", "title": "Primordial Black Holes from Spatially Varying Cosmological Constant  Induced by Field Fluctuations in Extra Dimensions", "authors": "Arkady A. Popov, Sergey G. Rubin, Alexander S. Sakharov", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th)", "abstract": "The origin and evolution of supermassive black holes (SMBHs) in our universe have sparked controversy. In this study, we explore the hypothesis that some of these black holes may have seeded from the direct collapse of dark energy domains with density significantly higher than the surrounding regions. The mechanism of the origin of such domains relies on the inflationary evolution of a scalar field acting in D dimensions, which is associated with the cosmological constant in our four-dimensional spacetime manifold. Inner space quantum fluctuations of the field during inflation are responsible for the spatial variations of the dark energy density in our space. This finding holds particular significance, especially considering recent evidence from pulsar timing array observations, which supports the existence of a stochastic gravitational wave background consisting of SMBH mergers."}
{"main_page": "https://arxiv.org/abs/2404.00465", "pdf": "https://arxiv.org/pdf/2404.00465", "title": "A Promising New Dark Matter Candidate, and Implications for the Search  for Extraterrestrial Intelligence (SETI)", "authors": "A. Prillfool, A. A. Stoffers, I. Juodžbalis, M. S. Bothwell, A. J. Wojcik", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "We present a speculative exploration of the properties of a proposed new Dark Matter (DM) candidate in a heretofore under-explored region of parameter space. Our proposed ultra-cold candidatae has been a matter of speculation for some time,and has recently been tentatively identified via direct-detection. While unconventional, demonstrated existence of this DM candidate would have wide-ranging implications for a range of fields, from particle cosmology to exobiology and the Search for Extraterrestrial Life (SETI)."}
{"main_page": "https://arxiv.org/abs/2404.00537", "pdf": "https://arxiv.org/pdf/2404.00537", "title": "A Comparative Study of Star Forming Dwarf Galaxies using the UVIT", "authors": "S Amrutha, Mousumi Das, Jyoti Yadav", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We present a Far-Ultraviolet (FUV) study of sixteen star-forming dwarf galaxies (SFDGs) using the Ultraviolet Imaging Telescope (UVIT). Morphologically, SFDGs are classified as dwarf spirals, dwarf irregulars, and blue compact dwarfs (BCDs). We extracted the star-forming complexes (SFCs) from the sample galaxies, derived their sizes, and estimated the FUV+24$\\mu m$ star formation rates (SFRs). We also determined the approximate stellar disk mass associated with the SFCs using IRAC 3.6-micron images. We derived the specific SFRs (sSFRs), as well as the SFR densities ($\\Sigma(SFR)$) for the SFCs. We find that the lower $\\Sigma(SFR)$ for each type is different, with the dwarf irregulars having the lowest $\\Sigma(SFR)$ compared to others. However, the median size of the SFCs in the dwarf irregulars is the largest compared to the other two types when compared at roughly the same distance. We have derived the star-forming main sequence (SFMS) on the scale of SFCs for all three classes of SFDGs. We find that although all SFDGs approximately follow the global SFMS relation, i.e. $SFR\\propto {M_{*}}^{\\alpha}$ (where globally $\\alpha\\approx1$ for low surface brightness galaxies and $0.9$ for SFDGs), on the scale of SFCs the $\\alpha$ value for each type is different. The $\\alpha$ values for dwarf spirals, dwarf irregulars, and BCDs are found to be 0.74$\\pm$0.13, 0.8$\\pm$0.16, and 0.8$\\pm$0.19, respectively. However, the age of all SFCs approximately corresponds to 1 Gyr. Finally, we find that the outer SFCs in most galaxies except BCDs have a high sSFR, supporting the inside-out model of galaxy growth."}
{"main_page": "https://arxiv.org/abs/2404.00555", "pdf": "https://arxiv.org/pdf/2404.00555", "title": "Gas-rich Ultra-diffuse Galaxies Are Originated from High Specific  Angular Momentum", "authors": "Yu Rong, Huijie Hu, Min He, Wei Du, Qi Guo, Hui-Yuan Wang, Hong-Xin Zhang, Houjun Mo", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Ultra-diffuse galaxies, characterized by comparable effective radii to the Milky Way but possessing 100-1,000 times fewer stars, offer a unique opportunity to garner novel insights into the mechanisms governing galaxy formation. Nevertheless, the existing corpus of observational and simulation studies has not yet yielded a definitive constraint or comprehensive consensus on the formation mechanisms underlying ultra-diffuse galaxies. In this study, we delve into the properties of ultra-diffuse galaxies enriched with neutral hydrogen using a semi-analytic method, with the explicit aim of constraining existing ultra-diffuse galaxy formation models. We find that the gas-rich ultra-diffuse galaxies are statistically not failed $L^{\\star}$ galaxies nor dark matter deficient galaxies. In statistical terms, these ultra-diffuse galaxies exhibit comparable halo concentration, but higher baryonic mass fraction, as well as higher stellar and gas specific angular momentum, in comparison to typical dwarf galaxy counterparts. Our analysis unveils that higher gas specific angular momentum serves as the underlying factor elucidating the observed heightened baryonic mass fractions, diminished star formation efficiency, expanded stellar disk sizes, and reduced stellar densities in ultra-diffuse galaxies. Our findings make significant contributions to advancing our knowledge of ultra-diffuse galaxy formation and shed light on the intricate interplay between gas dynamics and the evolution of galaxies."}
{"main_page": "https://arxiv.org/abs/2404.00647", "pdf": "https://arxiv.org/pdf/2404.00647", "title": "ALMA Confirmation of Millimeter Time Variability in the Gamma-Ray  Detected Seyfert Galaxy GRS 1734-292", "authors": "Tomonari Michiyama, Yoshiyuki Inoue, Akihiro Doi, Tomoya Yamada, Yasushi Fukazawa, Hidetoshi Kubo, Samuel Barnie", "subjects": "Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "GRS 1734-292 is a radio-quiet galaxy, exhibiting neither intense starburst nor jet activities. However, Fermi-LAT detected this object in the GeV band. The origin of non-thermal activity in this Seyfert galaxy is an intriguing question. We report Atacama Large Millimeter/submillimeter Array (ALMA) observations of GRS 1734-292 at frequencies of 97.5, 145, and 225 GHz. These observations confirmed the millimeter excess within the central <100 pc region and its time variability based on two separate observations conducted four days apart. The timescale of variability aligns with the light crossing time for a compact source smaller than <100 Schwarzschild radius. If we take into account the power-law synchrotron emission originating from the corona (i.e., the hot plasma located above the accretion disk), the millimeter spectrum indicates the coronal magnetic field of ~10 G and the size of ~10 Schwarzschild radius. An alternative explanation for this millimeter emission could be synchrotron and free-free emission from disk winds (i.e., fast wide-opening angle outflows from the disk) with the size of ~10 pc, although it may be difficult to explain the fast variability. Future millimeter observations with higher resolution (~0.01\") will enable the differentiation between these two scenarios. Such observations will provide insights into the acceleration sites of high-energy particles at the core of active galactic nuclei."}
{"main_page": "https://arxiv.org/abs/2404.00669", "pdf": "https://arxiv.org/pdf/2404.00669", "title": "How common can the origin of clusters Cha I, Cha II, epsilon Cha and eta  Cha be?", "authors": "Vadim V. Bobylev, Anisa T. Bajkova", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The trajectories of the clusters $\\eta$ Cha, $\\epsilon$ Cha and Cha I, Cha II, constructed backward in time, have been studied. We concluded that the hypothesis about the joint formation of all four of these clusters from one molecular cloud cannot be completely excluded. However, 10-15 Myr ago, all these four clusters were located at approximately the same height above the plane of the Galaxy. Thus, the gas-dust clouds from which all these four clusters were formed were located on one broad front. It is possible that the appearance of the Cha I, Cha II, $\\epsilon$ Cha and $\\eta$ Cha clusters may be associated with the impact on such a front of shock waves formed after supernova explosions in the Scorpius-Centauri association. New estimates of the kinematic ages of the clusters Cha I and Cha II are obtained as $0.12\\pm0.19$ and $0.05\\pm0.15$, respectively. It is shown that the minimum size of the Cha I-north and Cha I-south clusters corresponded to the time of $0.55\\pm0.24$ Myr and $0.04\\pm0.18$ Myr ago, respectively, and approximately 1.5 Myr ago the distance between the trajectories of these two groupings was minimal."}
{"main_page": "https://arxiv.org/abs/2404.00716", "pdf": "https://arxiv.org/pdf/2404.00716", "title": "Supernova spotting in Super-Kamiokande Gd", "authors": "L. Kneale", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det)", "abstract": "Since the Super-Kamiokande (SK) neutrino experiment in Japan added gadolinium sulphate octahydrate (Gd) to the pure water in its detector, it has entered a new era in supernova neutrino detection. The addition of Gd makes it possible to tag neutrons from inverse beta decay (IBD) interactions of electron antineutrinos with free protons in the water. This has led to significant improvement in the experiment's sensitivity to low-energy electron antineutrinos, which is key in the observation of supernova neutrinos. Super-Kamiokande Gadolinium (SK-Gd) has the potential to make the first observation of the diffuse supernova neutrino background (DSNB) and pre-supernova (preSN) neutrinos, and can improve the pointing capability of SK in the event of a core-collapse supernova (CCSN) explosion. We present the latest results and prospects for supernova neutrino detection with SK-Gd."}
{"main_page": "https://arxiv.org/abs/2404.00720", "pdf": "https://arxiv.org/pdf/2404.00720", "title": "Kicking time back in black-hole mergers: Ancestral masses, spins, birth  recoils and hierarchical-formation viability of GW190521", "authors": "Carlos Araújo Álvarez, Henry W.Y. Wong, Juan Calderón Bustillo", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "Pair-instability supernova (PISN) is thought to prevent the formation of black holes from stellar collapse within the approximate mass range $M\\in [65,130]M_\\odot$. However, such black holes may form through hierarchical formation channels, as the result of merging \"ancestor\" black holes, whose properties determine those of the ``child'' black hole, namely its mass, spin, and recoil velocity (or kick). Crucially, the child black hole will be expelled from its host environment if its \"birth kick\" exceeds the corresponding escape velocity, preventing it from undergoing further mergers. In this work, we exploit tight relations between the final kick and final spin of quasi-circular black-hole mergers to obtain posterior probability distributions for the hypothetical ancestral masses, spins and birth kicks of the component black holes of GW190521, assuming both quasi-circular (with generic spins) eccentric (aligned-spin) scenarios for the latter. With this, we evaluate the probability $p_{2g}$ that the GW190521 components formed from the merger of stellar-origin black holes, being retained by the host environment. For the primary component BH1, which falls squarely in the PISN mass gap, we find that such scenario is strongly suppressed if GW190521 happened in a Globular Cluster, unless GW190521 was quasi-circular and BH1 had aligned-spin ancestors, characteristic of isolated black-hole binary formation scenarios. Similarly, for denser host environments (excluding AGNs), we only obtain probabilities $p_{2g} > 0.5$ if GW190521 was quasi-circular and BH1 had aligned-spin ancestors. If GW190521 was eccentric, we find maximal values $p_{2g}$ of only $p_{2g} \\simeq 0.1$ which require ancestral mass ratios $q\\geq 2$, untypical of isolated formation scenarios. Our results seem consistent with an AGN origin for GW190521, especially if this was eccentric."}
{"main_page": "https://arxiv.org/abs/2404.00744", "pdf": "https://arxiv.org/pdf/2404.00744", "title": "The distribution of Bayes' ratio", "authors": "Luca Amendola, Vrund Patel, Ziad Sakr, Elena Sellentin, Kevin Wolz", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Statistics Theory (math.ST)", "abstract": "The ratio of Bayesian evidences is a popular tool in cosmology to compare different models. There are however several issues with this method: Bayes' ratio depends on the prior even in the limit of non-informative priors, and Jeffrey's scale, used to assess the test, is arbitrary. Moreover, the standard use of Bayes' ratio is often criticized for being unable to reject models. In this paper, we address these shortcoming by promoting evidences and evidence ratios to frequentist statistics and deriving their sampling distributions. By comparing the evidence ratios to their sampling distributions, poor fitting models can now be rejected. Our method additionally does not depend on the prior in the limit of very weak priors, thereby safeguarding the experimenter against premature rejection of a theory with a uninformative prior, and replaces the arbitrary Jeffrey's scale by probability thresholds for rejection. We provide analytical solutions for some simplified cases (Gaussian data, linear parameters, and nested models), and we apply the method to cosmological supernovae Ia data. We dub our method the FB method, for Frequentist-Bayesian."}
{"main_page": "https://arxiv.org/abs/2404.00747", "pdf": "https://arxiv.org/pdf/2404.00747", "title": "Baryon acoustic scale at $z_{\\eff} = 0.166$ with the SDSS blue galaxies", "authors": "Felipe Avila, Edilson de Carvalho, Armando Bernui, Hanna Lima, Rafael C. Nunes", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "The Baryon Acoustic Oscillations (BAO) phenomenon provides a unique opportunity to establish a standard ruler at any epoch in the history of the evolving universe. The key lies in identifying a suitable cosmological tracer to conduct the measurement. In this study, we focus on quantifying the sound horizon scale of BAO in the Local Universe. Our chosen cosmological tracer is a sample of blue galaxies from the SDSS survey, positioned at the effective redshift $z_{{\\eff}} = 0.166$. Utilizing Planck-CMB input values for redshift-to-distance conversion, we derive the BAO scale $s_{\\scalebox{0.65}{\\rm BAO}} = 100.28 ^{+10.79} _{-22.96}$ Mpc$/h$ at the 1$\\sigma$ confidence level. Subsequently, we extrapolate the BAO signal scale in redshift space: $\\Delta z_{\\scalebox{0.6}{\\rm BAO}}(z_{\\rm eff}=0.166)=0.0361^{+0.00262}_ {-0.0055}$. This measurement holds the potential to discriminate among dark energy models within the Local Universe. To validate the robustness of our methodology for BAO scale measurement, we conduct three additional BAO analyses using different cosmographic approaches for distance calculation from redshifts. These tests aim to identify possible biases or systematics in our measurements of $s_{\\scalebox{0.65}{\\rm BAO}}$. Encouragingly, our diverse cosmographic approaches yield results in statistical agreement with the primary measurement, indicating no significant deviations. Conclusively, our study contributes with a novel determination of the BAO scale in the Local Universe, at $z_{{\\eff}} = 0.166$, achieved through the analysis of the SDSS blue galaxies cosmic tracer."}
{"main_page": "https://arxiv.org/abs/2404.00840", "pdf": "https://arxiv.org/pdf/2404.00840", "title": "A proposal for enhancing technosignature search toward the Galactic  center", "authors": "Naoki Seto", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); Popular Physics (physics.pop-ph)", "abstract": "We discuss the possibility of enhancing intelligent life searches toward the Galactic center. From the clockwork orbital motions of stars around the Sgr A${}^*$ black hole, we can determine the distance to the Galactic center at an exceptional accuracy, despite its remoteness $\\sim 8.3$kpc. In addition, we can define precise reference epochs by selecting a prominent object such as the bright B-type star S2. These properties have a particular affinity for the coordinated signaling scheme which was hypothesized by Seto (2019) for systematically connecting intentional senders to searchers without a prior communication. If S2 is actually being used as a common reference clock, we can compress the search directions around the Galactic center by more than two orders of magnitude, with the scanning interval of $\\sim16$yr."}
{"main_page": "https://arxiv.org/abs/2404.00887", "pdf": "https://arxiv.org/pdf/2404.00887", "title": "Formation and Evolution of the Stream of SOHO Kreutz Sungrazers. II.  Results and Implications of Monte Carlo Simulation", "authors": "Zdenek Sekanina", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "I present the results of the first comprehensive effort aimed at modeling a major component of the stream of SOHO sungrazers, 5000 of which have been detected by the onboard coronagraphs since 1996. The stream of Population I of the Kreutz system, investigated by a Monte Carlo simulation technique, is treated as a product of cascading fragmentation due to unstable rotation of a \"seed,\" a subkilometer-sized object that separated with others from comet X/1106 C1 at perihelion. The stream's activity is predicted to last for 200 years from ~1950 to ~2150, culminating in the 2010s, when a swarm of bright SOHO sungrazers (peak mags not fainter than 3) of Population I was observed. By the end of 2023 about 42 percent of the stream had already arrived. Scatter amounts to 7 deg in the longitude of the ascending node and at most 0.2 solar radius in the perihelion distance. On its initial orbit the seed would pass perihelion in 2036, 193 years after C/1843 D1, the principal fragment of X/1106 C1. Comet C/1668 E1 is proposed as another major fragment and yet another is predicted to arrive in the 2050s or 2060s."}
{"main_page": "https://arxiv.org/abs/2404.00889", "pdf": "https://arxiv.org/pdf/2404.00889", "title": "Transport of the magnetic flux away from a decaying sunspot via  convective motions", "authors": "Chenxi Zheng, Thierry Roudier, Brigitte Schmieder, Guiping Ruan, Jean-Marie Malherbe, Yang Liu, Yao Chen, Wenda Cao", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Aims. The aim of this paper is to consider relationship between the decay of sunspots and convection via the motion of the family of granules and how the diffusion mechanism of magnetic field operates in a decaying sunspot. Methods. We report the decay of a sunspot observed by the 1.6m Goode Solar Telescope (GST) with the TiO Broadband Filter Imager (BFI) and the Near-InfraRed Imaging Spectropolarimeter (NIRIS). The analysis was aided by the Helioseismic and Magnetic Imager (HMI) on board the Solar Dynamic Observatory (SDO). In the first step, we followed the decay of the sunspot with HMI data over three days by constructing its evolving area and total magnetic flux. In the second step, the high spatial and temporal resolution of the GST instruments allowed us to analyze the causes of the decay of the sunspot. Afterward, we followed the emergence of granules in the moat region around the sunspot over six hours. The evolution of the trees of fragmenting granules (TFGs) was derived based on their relationship with the horizontal surface flows. Results. We find that the area and total magnetic flux display an exponential decrease over the course of the sunspot decay. We identified 22 moving magnetic features (MMFs) in the moats of pores, which is a signature of sunspot decay through diffusion. We note that the MMFs were constrained to follow the borders of TFGs during their journey away from the sunspot. Conclusions. The TFGs and their development contribute to the diffusion of the magnetic field outside the sunspot. The conclusion of our analysis shows the important role of the TFGs in sunspot decay. Finally, the the family of granules evacuates the magnetic field."}
{"main_page": "https://arxiv.org/abs/2404.00911", "pdf": "https://arxiv.org/pdf/2404.00911", "title": "Clues in Bailey Diagrams Indicate that the Horizontal Branch  Evolutionary Effect Is the Direct Reason for Oosterhoff Phenomenon", "authors": "L.-J. Li, S.-B. Qian, L.-Y. Zhu, X.-D. Shi, W.-P. Liao", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Noticing the potential relationship between the pulsation amplitude of fundamental mode RR Lyrae stars and their average effective temperatures, we derived the relation between them from observational data. Using these relationships, we present the zero-age horizontal branch lines and corresponding evolutionary tracks in the Bailey diagrams. We first find that the trends of zero-age horizontal branch lines are consistent with the distributions of Oosterhoff I RR Lyrae stars, and there is a period shift effect in relatively metal-rich samples ([Fe/H] > -1). Main results show that evolutionary effects are the direct cause of the Oosterhoff dichotomy. The vast majority of Oosterhoff I RR Lyrae stars are in the early stage of horizontal branch evolution, while most of the Oosterhoff II stars are near the end of the horizontal branch phase. Our Bailey diagrams can intuitively explain some Oosterhoff phenomena (e.g., long-period RR Lyrae stars in the metal-rich globular clusters NGC 6388 and NGC 6441), and also have the potential to become an important tool for in-depth study of RR Lyrae stars. Further research is needed on the Oosterhoff dichotomy to explore the formations and evolutionary processes of the Milky Way and its substructures."}
{"main_page": "https://arxiv.org/abs/2404.00933", "pdf": "https://arxiv.org/pdf/2404.00933", "title": "Constraining ultra slow roll inflation using cosmological datasets", "authors": "H. V. Ragavendra, Anjan Kumar Sarkar, Shiv K. Sethi", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "In recent years, the detection of gravitational waves by LIGO and PTA collaborations have raised the intriguing possibility of excess matter power at small scales. Such an increase can be achieved by ultra slow roll (USR) phase during inflationary epoch. We constrain excess power over small scales within the framework of such models using cosmological datasets, particularly of CMB anisotropies and Lyman-$\\alpha$. We parameterize the USR phase in terms of the e-fold at the onset of USR (counted from the end of inflation) $\\bar N_1$ and the duration of USR phase $\\Delta N$. The former dictates the scale of enhancement in the primordial power spectrum, while the latter determines the amplitude of such an enhancement. From a joint dataset of CMB, SNIa and galaxy surveys, we obtain $\\bar N_1 \\lesssim 45$ with no bound on $\\Delta N$. This in turn implies that the scales over which the power spectrum can deviate significantly from the nearly scale invariant behavior of a typical slow-roll model is $k \\gtrsim 1 \\, \\rm Mpc^{-1}$. On the other hand, the Lyman-$\\alpha$ data is sensitive to baryonic power spectrum along the line of sight. We consider a semi-analytic theoretical method and high spectral-resolution Lyman-$\\alpha$ data to constrain the model. The Lyman-$\\alpha$ data limits both the USR parameters: $\\bar N_1 \\lesssim 41$ and $\\Delta N \\lesssim 0.4$. This constrains the amplitude of the power spectrum enhancement to be less than a factor of hundred over scales $1 \\lesssim k/{\\rm Mpc^{-1}} \\lesssim 100$, thereby considerably improving the constraint on power over these scales as compared to the bounds arrived at from CMB spectral distortion."}
{"main_page": "https://arxiv.org/abs/2404.00937", "pdf": "https://arxiv.org/pdf/2404.00937", "title": "The Interaction Between Stars and Past AGN Disk: Possible Explanation  for the Kinematic Distributions of S-stars in the Galactic Center", "authors": "Xiao Fan, Qingwen Wu, Jiancheng Wu, Xiangli Lei, Mengye Wang, Fulin Li", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The presence of young stars, aged around several million years and situated within the range of $\\sim 0.04-1$ parsec from our Galactic Center raises a question about their origins and dynamical evolutions. Their kinematics provide an opportunity to explore their formation or possible subsequent dynamical evolution. If Sagittarius A* was active in the past as suggested by several observations, the accretion disk may have a significant impact on the dynamics of stars in the Galactic Center. The drag force exerted on stars during star-disk interaction could lead some of them to sink into the accretion disk, and these embedded stars will rapidly migrate inward and eventually be disrupted within $\\sim10^5$ years. This could roughly explain the absence of stars within $2.5 \\times 10^4 R_{\\rm g}$ ($\\sim$ 1000 AU). Additionally, Kozai-Lidov oscillations, induced by the gravitational perturbation of the disk, could contribute to the bimodal distribution of S-star inclinations and drive a majority of stars into high eccentricity orbits."}
{"main_page": "https://arxiv.org/abs/2404.00941", "pdf": "https://arxiv.org/pdf/2404.00941", "title": "Repeating Nuclear Transients as Candidate Electromagnetic Counterparts  of LISA Extreme Mass Ratio Inspirals", "authors": "Shubham Kejriwal, Vojtech Witzany, Michal Zajacek, Dheeraj R. Pasham, Alvin J. K. Chua", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "Extreme-mass-ratio inspirals (EMRIs) are one of the primary targets for the recently adopted millihertz gravitational-wave (GW) observatory LISA. Some previous studies have argued that a fraction of all EMRIs form in matter-rich environments, and can potentially explain the dozens of soft X-ray band ($\\sim 10^{-1} \\rm keV$), low-frequency ($\\sim 0.1$ mHz) periodic phenomena known as quasi-periodic eruptions (QPEs) and quasi-periodic oscillations (QPOs). Here, using a representative EMRI population retrofitted with cutoffs on LISA-band SNRs and luminosity distances to account for the sensitivity of current instruments, we estimate the mean frequency band in which QPEs and QPOs originating from detectable LISA EMRIs may be emitting an X-ray signal ``today'' (i.e., in 2024) to be $0.46 \\pm 0.22$ mHz. We also model the well-known QPO source, RE J1034+396, which falls in this frequency band, as an EMRI assuming its primary black hole mass to be $10^6-10^7 M_\\odot$. Through a prior-predictive analysis, we estimate the orbiting compact object's mass to be $46^{+ 10}_{-40} M_\\odot$ and the source's LISA-band SNR as $\\approx 14$, highlighting it as a candidate multi-messenger EMRI target. We also highlight the role of current and near-future X-ray and UV observatories in enabling multi-messenger observations of EMRIs in conjunction with LISA, and conclude with a discussion of caveats of the current analysis, such as the exclusion of eccentricity and inclination from the model, and the measurability of sub-solar mass compact object EMRIs."}
{"main_page": "https://arxiv.org/abs/2404.00944", "pdf": "https://arxiv.org/pdf/2404.00944", "title": "Spiral Galaxies' Disk Dominance and Testing MOND", "authors": "Gene Byrd, Sethanne Howard", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Many Hubble type S galaxies have a flat rotation curve, V extending into the outer disk. The surface brightness there is too low to create V from stars of a reasonable mass-to-light ratio. To maintain a stable disk, a massive dark matter halo is usually assumed to dominate in creating V. Gravitational arm amplification is used here to estimate whether V is created by a disk mixture, or by a 100 percent halo. The disk surface density is not estimated from the disk surface brightness and an assumed mass to light ratio. The observed arm pitch angle is presumed to be long term maximally amplified. This permits calculation of the disk surface mass density with radius relative to a 100 percent disk which would fully create V. NGC 7217's tightly wound 4.8 degree arm pitch angle indicates a disk component contributing 43 percent of the observed V for the range over the spiral arms (important but not dominant). It has too low a disk density to create V with the rest presumably arising from a halo. V is proportional to the square root of surface density. By contrast a loose arm galaxy disk can dominate in creating V. For example NGC 3198's arm pitch angle of 30 degrees implies a disk surface density sufficient to account for 88 percent of V which is a dominant fraction. Little dark matter halo is needed for galaxies like this. Observationally, the dark outer disk may be molecular hydrogen. NGC 3198's dominant disk also provides a counter example to the need for any universal (MOND) force law modification over the outer disk spiral arms."}
{"main_page": "https://arxiv.org/abs/2404.01034", "pdf": "https://arxiv.org/pdf/2404.01034", "title": "Survival of Gas in Subhalos and Its Impact on the 21 cm Forest Signals:  Insights from Hydrodynamic Simulations", "authors": "Genki Naruse, Kenji Hasegawa, Kenji Kadota, Hiroyuki Tashiro, Kiyotomo Ichiki", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "Understanding the survival of gas within subhalos under various astrophysical processes is crucial for elucidating cosmic structure formation and evolution. We study the resilience of gas in subhalos, focusing on the impact of tidal and ram pressure stripping through hydrodynamic simulations. Our results uncover significant gas stripping primarily driven by ram pressure effects, which also profoundly influence the gas distribution within these subhalos. Notably, despite their vulnerability to ram pressure effects, the low-mass subhalos can play a pivotal role in influencing the observable characteristics of cosmic structures due to their large abundance. Specifically, we explore the application of our findings to the 21 cm forest, showing how the survival dynamics of gas in subhalos can modulate the 21 cm optical depth, a key probe for detecting minihalos in the pre-reionization era. (abridged) In this work, we further investigate the contribution of subhalos to the 21 cm optical depth with hydrodynamics simulations, particularly highlighting the trajectories and fates of subhalos within mass ranges of \\(10^{4-6} M_{\\odot}h^{-1}\\) in a host halo of \\(10^7 M_{\\odot}h^{-1}\\). Despite their susceptibility to ram pressure stripping, the contribution of abundant low-mass subhalos to the 21-cm optical depth is more significant than that of their massive counterparts primarily due to their greater abundance. We find that the 21-cm optical depth can be increased by a factor of approximately two due to the abundant low-mass subhalos. (abridged) Our work provides critical insights into the gas dynamics within subhalos in the early Universe, highlighting their resilience against environmental stripping effects, and their impact on observable 21-cm signals."}
{"main_page": "https://arxiv.org/abs/2404.01044", "pdf": "https://arxiv.org/pdf/2404.01044", "title": "Discovery of thionylimide, HNSO, in space: the first N-, S- and  O-bearing interstellar molecule", "authors": "Miguel Sanz-Novo, Víctor M. Rivilla, Holger S. P. Müller, Izaskun Jiménez-Serra, Jesús Martín-Pintado, Laura Colzi, Shaoshan Zeng, Andrés Megías, Álvaro López-Gallifa, Antonio Martínez-Henares, Belén Tercero, Pablo de Vicente, David San Andrés, Sergio Martín, Miguel A. Requena-Torres", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We present the first detection in space of thionylimide (HNSO) toward the Galactic Center molecular cloud G+0.693-0.027, thanks to the superb sensitivity of an ultradeep molecular line survey carried out with the Yebes 40$\\,$m and IRAM 30$\\,$m telescopes. This molecule is the first species detected in the interstellar medium containing, simultaneously, N, S and O. We have identified numerous $K$$_a$ = 0, 1 and 2 transitions belonging to HNSO covering from $J$$_{\\rm up}$ = 2 to $J$$_{\\rm up}$ = 10, including several completely unblended features. We derive a molecular column density of $N$ = (8 $\\pm$ 1)$\\times$10$^{13}$ cm$^{-2}$, yielding a fractional abundance relative to H$_2$ of $\\sim$6$\\times$10$^{-10}$, which is about $\\sim$37 and $\\sim$4.8 times less abundant than SO and SO2, respectively. Although there are still many unknowns in the interstellar chemistry of NSO-bearing molecules, we propose that HNSO is likely formed through the reaction of the NSO radical and atomic H on the surface of icy grains, with alternative routes also deserving exploration. Finally, HNSO appears as a promising link between N- , S- and O- interstellar chemistry and its discovery paves the route to the detection of a new family of molecules in space."}
{"main_page": "https://arxiv.org/abs/2404.01049", "pdf": "https://arxiv.org/pdf/2404.01049", "title": "A Novel Sector-Based Algorithm for an Optimized Star-Galaxy  Classification", "authors": "Anumanchi Agastya Sai Ram Likhit, Divyansh Tripathi, Akshay Agarwal", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG)", "abstract": "This paper introduces a novel sector-based methodology for star-galaxy classification, leveraging the latest Sloan Digital Sky Survey data (SDSS-DR18). By strategically segmenting the sky into sectors aligned with SDSS observational patterns and employing a dedicated convolutional neural network (CNN), we achieve state-of-the-art performance for star galaxy classification. Our preliminary results demonstrate a promising pathway for efficient and precise astronomical analysis, especially in real-time observational settings."}
{"main_page": "https://arxiv.org/abs/2404.01092", "pdf": "https://arxiv.org/pdf/2404.01092", "title": "Rediscussion of eclipsing binaries. Paper XVIII. The F-type system OO  Pegasi", "authors": "John Southworth", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "OO Peg is a detached eclipsing binary system containing two late-A-type stars in a circular orbit with a period of 2.985 d. Using published spectroscopic results and a light curve from the Transiting Exoplanet Survey Satellite (TESS) we determine their masses to be 1.69 +/- 0.09 and 1.74 +/- 0.06 Msun, and their radii to be 2.12 +/- 0.03 and 1.91 +/- 0.03 Rsun. The TESS data are of high quality, but discrepancies in the radial velocities from two sources prevent a precise mass measurement. The primary star is definitively hotter, larger and more luminous than its companion, but its mass is lower (albeit to a significance of only 1.1 sigma). Using published apparent magnitudes and temperatures, we find a distance of 238.8 +/- 6.1 pc, in agreement with the Gaia DR3 parallax. Although both components are in the delta Scuti instability strip, we find no evidence of pulsations. More extensive spectroscopy is needed to improve our understanding of the system."}
{"main_page": "https://arxiv.org/abs/2404.01124", "pdf": "https://arxiv.org/pdf/2404.01124", "title": "Cosmic Web Classification through Stochastic Topological Ranking", "authors": "Alejandro Palomino, Felipe Leonardo Gómez-Cortés, Xiao-Dong Li, Jaime E. Forero-Romero", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "This paper introduces ASTRA (Algorithm for Stochastic Topological RAnking), a novel method designed for the classification of galaxies into principal cosmic web structures -- voids, sheets, filaments, and knots -- especially tailored for large spectroscopic surveys. ASTRA utilizes observed data and a corresponding random catalog, generating probabilities for data and random points to belong to each cosmic web type. Extensive evaluation includes testing on datasets from N-body simulations (dark matter only and hydrodynamical) and observations, incorporating visual inspections and quantitative analyses of mass and volume filling fractions. ASTRA demonstrates proficiency in constructing void size function catalogs and is benchmarked against established cosmic web classification methods. Spatial correlations among cosmic web types are explored using 2-point correlation functions. ASTRA's approach to the cosmic web holds promise for enhancing the retrieval of non-standard clustering statistics, thereby advancing the estimation of cosmological parameters. With simplicity, speed, and applicability across various datasets, ASTRA is a valuable tool in the quantitative study of the large-scale structure of the Universe."}
{"main_page": "https://arxiv.org/abs/2404.01169", "pdf": "https://arxiv.org/pdf/2404.01169", "title": "A Comparative Study of Dust Grain Polarisation Efficiencies in the  Interstellar and Intracluster Mediums towards Anti-Center Galaxy", "authors": "N. Bijas, Chakali Eswaraiah, Panigrahy Sandhyarani, Jessy Jose, Maheswar Gopinathan", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Dust polarisation observations at optical wavelengths help understand the dust grain properties and trace the plane-of-the-sky component of the magnetic field. In this study, we make use of published optical polarisation data acquired with AIMPOL along with distances ($d$) and extinction ($A_{\\mathrm{V}}$) data. We study the variation of polarisation efficiency ($P/A_{\\mathrm{V}}$) as a function of $A_{\\mathrm{V}}$ in the diffuse interstellar medium (ISM) and intracluster mediums (ICM) using the already published polarisation data of six clusters. Among these clusters, NGC 2281, NGC 1664, and NGC 1960 are old; while Stock 8, NGC 1931, and NGC 1893 are young. We categorize stars towards each cluster into foreground, background, and cluster members by employing two clustering algorithms GMM and DBSCAN. Thus, classified field stars and cluster members are used to reveal the polarisation properties of ISM and ICM dust, respectively. We find that the dust grains located in the diffuse ISM show higher polarisation efficiencies when compared to those located in the ICM of younger clusters."}
{"main_page": "https://arxiv.org/abs/2404.01175", "pdf": "https://arxiv.org/pdf/2404.01175", "title": "Reconstructing Robust Background IFU spectra using Machine Learning", "authors": "Carter Lee Rhea, Julie Hlavacek-Larrondo, Justine Giroux, Auriane Thilloy, Hyunseop Choi, Laurie Rousseau-Nepton, Marie-Lou Gendron-Marsolais, Mario Pasquato, Simon Prunet", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "In astronomy, spectroscopy consists of observing an astrophysical source and extracting its spectrum of electromagnetic radiation. Once extracted, a model is fit to the spectra to measure the observables, leading to an understanding of the underlying physics of the emission mechanism. One crucial, and often overlooked, aspect of this model is the background emission, which contains foreground and background astrophysical sources, intervening atmospheric emission, and artifacts related to the instrument such as noise. This paper proposes an algorithmic approach to constructing a background model for SITELLE observations using statistical tools and supervised machine learning algorithms. We apply a segmentation algorithm implemented in photutils to divide the data cube into background and source spaxels. After applying a principal component analysis (PCA) on the background spaxels, we train an artificial neural network to interpolate from the background to the source spaxels in the PCA coefficient space, which allows us to generate a local background model over the entire data cube. We highlight the performance of this methodology by applying it to SITELLE observations obtained of a SIGNALS galaxy, \\NGC4449, and the Perseus galaxy cluster of galaxies, NGC 1275. We discuss the physical interpretation of the principal components and noise reduction in the resulting PCA-based reconstructions. Additionally, we compare the fit results using our new background modeling approach to standard methods used in the literature and find that our method better captures the emission from HII regions in NGC 4449 and the faint emission regions in NGC 1275. These methods also demonstrate that the background does change as a function of the position of the datacube."}
{"main_page": "https://arxiv.org/abs/2404.01181", "pdf": "https://arxiv.org/pdf/2404.01181", "title": "Constraining Dark Matter Annihilation with Fermi-LAT Observations of  Ultra-Faint Compact Stellar Systems", "authors": "A. Circiello, A. McDaniel, A. Drlica-Wagner, C. Karwin, M. Ajello, M. Di Mauro, M. Sánchez-Conde", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "Recent results from numerical simulations and models of galaxy formation suggest that recently discovered ultra-faint compact stellar systems (UFCSs) in the halo of the Milky Way (MW) may be some of the smallest and faintest galaxies. If this is the case, these systems would be attractive targets for indirect searches of weakly interacting massive particle (WIMP) dark matter (DM) annihilation due to their relative proximity and high expected DM content. In this study, we analyze 14.3 years of gamma-ray data collected by the Fermi-LAT coincident with 26 UFCSs. No significant excess gamma-ray emission is detected, and we present gamma-ray flux upper limits for these systems. Assuming that the UFCSs are dark-matter-dominated galaxies consistent with being among the faintest and least massive MW dwarf spheroidal (dSphs) satellite galaxies, we derive the projected sensitivity for a dark matter annihilation signal. We find that observations of UFCSs have the potential to yield some of the most powerful constraints on DM annihilation, with sensitivity comparable to observations of known dSphs and the Galactic center. This result emphasizes the importance of precise kinematic studies of UFCSs to empirically determine their DM content."}
{"main_page": "https://arxiv.org/abs/2404.01235", "pdf": "https://arxiv.org/pdf/2404.01235", "title": "Anomaly Detection and Approximate Similarity Searches of Transients in  Real-time Data Streams", "authors": "P. D. Aleo, A. W. Engel, G. Narayan, C. R. Angus, K. Malanchev, K. Auchettl, V. F. Baldassare, A. Berres, T. J. L. de Boer, B. M. Boyd, K. C. Chambers, K. W. Davis, N. Esquivel, D. Farias, R. J. Foley, A. Gagliano, C. Gall, H. Gao, S. Gomez, M. Grayling, C.-C. Lin, E. A. Magnier, K. S. Mandel, T. Matheson, S. I. Raimundo, V. G. Shah, M. D. Soraisam, K. M. de Soto, S. Vicencio, V. A. Villar", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "We present LAISS (Lightcurve Anomaly Identification and Similarity Search), an automated pipeline to detect anomalous astrophysical transients in real-time data streams. We deploy our anomaly detection model on the nightly ZTF Alert Stream via the ANTARES broker, identifying a manageable $\\sim$1-5 candidates per night for expert vetting and coordinating follow-up observations. Our method leverages statistical light-curve and contextual host-galaxy features within a random forest classifier, tagging transients of rare classes (spectroscopic anomalies), of uncommon host-galaxy environments (contextual anomalies), and of peculiar or interaction-powered phenomena (behavioral anomalies). Moreover, we demonstrate the power of a low-latency ($\\sim$ms) approximate similarity search method to find transient analogs with similar light-curve evolution and host-galaxy environments. We use analogs for data-driven discovery, characterization, (re-)classification, and imputation in retrospective and real-time searches. To date we have identified $\\sim$50 previously known and previously missed rare transients from real-time and retrospective searches, including but not limited to: SLSNe, TDEs, SNe IIn, SNe IIb, SNe Ia-CSM, SNe Ia-91bg-like, SNe Ib, SNe Ic, SNe Ic-BL, and M31 novae. Lastly, we report the discovery of 325 total transients, all observed between 2018-2021 and absent from public catalogs ($\\sim$1% of all ZTF Astronomical Transient reports to the Transient Name Server through 2021). These methods enable a systematic approach to finding the \"needle in the haystack\" in large-volume data streams. Because of its integration with the ANTARES broker, LAISS is built to detect exciting transients in Rubin data."}
{"main_page": "https://arxiv.org/abs/2404.01236", "pdf": "https://arxiv.org/pdf/2404.01236", "title": "Cosmic topology. Part IVa. Classification of manifolds using machine  learning: a case study with small toroidal universes", "authors": "Andrius Tamosiunas, Fernando Cornet-Gomez, Yashar Akrami, Stefano Anselmi, Javier Carrón Duque, Craig J. Copi, Johannes R. Eskilt, Özenç Güngör, Andrew H. Jaffe, Arthur Kosowsky, Mikel Martin Barandiaran, James B. Mertens, Deyan P. Mihaylov, Thiago S. Pereira, Samanta Saha, Amirhossein Samandar, Glenn D. Starkman, Quinn Taylor, Valeri Vardanyan", "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th)", "abstract": "Non-trivial spatial topology of the Universe may give rise to potentially measurable signatures in the cosmic microwave background. We explore different machine learning approaches to classify harmonic-space realizations of the microwave background in the test case of Euclidean $E_1$ topology (the 3-torus) with a cubic fundamental domain of a size scale significantly smaller than the diameter of the last scattering surface. Different machine learning approaches are capable of classifying the harmonic-space realizations with accuracy greater than 99% if the topology scale is half of the diameter of the last-scattering surface and orientation of the topology is known. For distinguishing random rotations of these sky realizations from realizations of the covering space, the extreme gradient boosting classifier algorithm performs best with an accuracy of 88%. Slightly lower accuracies of 83% to 87% are obtained with the random forest classifier along with one- and two-dimensional convolutional neural networks. The techniques presented here can also accurately classify non-rotated cubic $E_1$ topology realizations with a topology scale slightly larger than the diameter of the last-scattering surface, if provided enough training data. This work identifies the prospects and the main challenges for developing machine learning techniques that are capable of accurately classifying observationally viable topologies."}
{"main_page": "https://arxiv.org/abs/2404.01239", "pdf": "https://arxiv.org/pdf/2404.01239", "title": "Characterization of Atmosphere-Skimming Cosmic-Ray Showers in  High-Altitude Experiments", "authors": "Matias Tueros, Sergio Cabana-Freire, Jaime Álvarez-Muñiz", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "Atmosphere-skimming showers are initiated by cosmic rays with incoming directions such that the full development of the cascade occurs inside the atmosphere without ever reaching the ground. This new class of showers has been observed in balloon-borne experiments such as ANITA, but a characterisation of their properties is lacking. The interplay between the Earth's magnetic field, the long distances over which atmosphere-skimming showers develop, and the low density of the atmosphere they traverse gives rise to several effects that are not seen in downward-going cascades, and require detailed modeling. In this article, we used the latest version of the ZHAireS-RASPASS shower simulation program to tackle this problem, and dwell on the particular phenomena that arises from the peculiar environment on which these showers develop. We focus in particular on the properties of the longitudinal profile of the shower and its fluctuations as a function of cosmic-ray energy, direction and primary mass. We have also studied the phase-space of cosmic-ray arrival directions where detection in high-altitude experiments is more likely, and have found that only in a small range of directions the showers are sufficiently developed before reaching the altitude of the detector. Our results are relevant for the design of high-altitude and in particular balloon-borne experiments, and for the interpretation of the data they collect."}
{"main_page": "https://arxiv.org/abs/2404.01246", "pdf": "https://arxiv.org/pdf/2404.01246", "title": "New infrared camera of the Caucasian Mountain Observatory of the SAI  MSU: design, main parameters, and first light", "authors": "S.G. Zheltoukhov, A.M. Tatarnikov, A.A. Belyakova, E.A. Koksharova", "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "This paper presents a prototype of an infrared photometer, created at SAI of MSU based on the commercial infrared module Gavin-615A. The operating spectral range of the photometer is 3-5 mkm. Investigations of the photometer's detector have shown that its parameters coincide with those stated by the manufacturer. The nonlinearity of the detector does not exceed approx 5% across the entire signal range, and coefficients for correction functions were determined. Additionally, we determined the readout noise RN=1200+-210 e-, the conversion coefficient GAIN=520+-9 e-/ADU, the signal magnitude of the bias frame BIAS = 960.5+-2.2 ADU, and the dark current 9.3e6 +-1.1e6 e-/s, which is the sum of the detector's dark current and the radiation from the entrance window of the detector module. The value of dark current was measured at a window temperature of 6C. Observations commenced with the photometer at the 2.5-m telescope of the Caucasian Mountain Observatory of MSU, with the first results presented in this paper. The unvignetted field of view was 30\". In the M band under good atmospheric conditions, an image quality close to the diffraction limit was achieved. Images of a star with brightness L=7.96 and M=6.78 were obtained over the 20-second exposure time and a SNR=10. It is shown that at high image quality with SNR=3 and exposure of 20 seconds it is possible to observe stars up to L=9 mag and M=8 mag. The main module of the photometer was also used in measurements of the sky background brightness."}
{"main_page": "https://arxiv.org/abs/2404.01252", "pdf": "https://arxiv.org/pdf/2404.01252", "title": "Non-radial oscillations in newly born compact star considering effects  of phase transition", "authors": "Anil Kumar, Pratik Thakur, Monika Sinha", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "The massive stars end their lives by supernova explosions leaving central compact objects that may evolve into neutron stars. Initially, after birth, the star remains hot and gradually cools down. We explore the matter and star properties during this initial stage of the compact stars considering the possibility of the appearance of deconfined quark matter in the core of the star. At the initial stage after the supernova explosion, the occurrence of non-radial oscillation in the newly born compact object is highly possible. Non-radial oscillations are an important source of GWs. There is a high chance for GWs from these oscillations, especially the nodeless fundamental (f-) mode to be detected by next-generation GW detectors. We study the evolution in frequencies of non-radial oscillation after birth considering phase transition and predicting the possible signature for different possibilities of theoretical compact star models."}
{"main_page": "https://arxiv.org/abs/2404.01264", "pdf": "https://arxiv.org/pdf/2404.01264", "title": "JWST COMPASS: A NIRSpec/G395H Transmission Spectrum of the Sub-Neptune  TOI-836c", "authors": "Nicole L. Wallack, Natasha E. Batalha, Lili Alderson, Nicholas Scarsdale, Jea I. Adams Redai, Artyom Aguichine, Munazza K. Alam, Peter Gao, Angie Wolfgang, Natalie M. Batalha, James Kirk, Mercedes López-Morales, Sarah E. Moran, Johanna Teske, Hannah R. Wakeford, Nicholas F. Wogan", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "Planets between the sizes of Earth and Neptune are the most common in the Galaxy, bridging the gap between the terrestrial and giant planets in our Solar System. Now that we are firmly in the era of JWST, we can begin to measure, in more detail, the atmospheres of these ubiquitous planets to better understand their evolutionary trajectories. The two planets in the TOI-836 system are ideal candidates for such a study, as they fall on either side of the radius valley, allowing for direct comparisons of the present-day atmospheres of planets that formed in the same environment but had different ultimate end states. We present results from the JWST NIRSpec G395H transit observation of the larger and outer of the planets in this system, TOI-836c (2.587 R$_{\\oplus}$, 9.6 M$_{\\oplus}$, T$_{\\rm eq}$$\\sim$665 K). While we measure average 30-pixel binned precisions of $\\sim$24ppm for NRS1 and $\\sim$43ppm for NRS2 per spectral bin, we do find residual correlated noise in the data, which we attempt to correct using the JWST Engineering Database. We find a featureless transmission spectrum for this sub-Neptune planet, and are able to rule out atmospheric metallicities $<$175$\\times$ Solar in the absence of aerosols at $\\lesssim$1 millibar. We leverage microphysical models to determine that aerosols at such low pressures are physically plausible. The results presented herein represent the first observation from the COMPASS (Compositions of Mini-Planet Atmospheres for Statistical Study) JWST program, which also includes TOI-836b and will ultimately compare the presence and compositions of atmospheres for 12 super-Earths/sub-Neptunes."}
{"main_page": "https://arxiv.org/abs/2404.01269", "pdf": "https://arxiv.org/pdf/2404.01269", "title": "Metallicity and $α$-abundance for 48 million stars in  low-extinction regions in the Milky Way", "authors": "Kohei Hattori (NAOJ, The Institute of Statistical Mathematics)", "subjects": "Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "We estimate ([M/H], [$\\alpha$/M]) for 48 million giants and dwarfs in low dust extinction regions from the Gaia DR3 XP spectra by using tree-based machine-learning models trained on APOGEE DR17 and metal-poor star sample of Li et al. The root mean square error of our estimation is 0.0890 dex for [M/H] and 0.0436 dex for [$\\alpha$/M], when we evaluate our models with the test data. Our estimation is most reliable for giants and metal-rich stars, because the training data are dominated by such stars. The high-[$\\alpha$/M] stars and low-[$\\alpha$/M] stars selected by our ([M/H], [$\\alpha$/M]) show different kinematical properties for giants and low-temperature dwarfs. We further investigate how our machine-learning models extract information on ([M/H], [$\\alpha$/M]). Intriguingly, our models seem to extract information on [$\\alpha$/M] from Na D lines (589 nm) and Mg I line (516 nm). This result is understandable given the observed correlation between Na and Mg abundances in the literature. The catalog of ([M/H], [$\\alpha$/M]) as well as their associated uncertainties will be publicly available online."}
{"main_page": "https://arxiv.org/abs/2404.01289", "pdf": "https://arxiv.org/pdf/2404.01289", "title": "The galaxy cluster AC114 III. The role of galaxy clusters in the  mass-metallicity relation", "authors": "A. Andrade (1 and 2), I. Saviane (2), L. Monaco (3), I. Yegorova (2), D. Proust (4)", "subjects": "Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We study the role of galaxy clusters in the mass-metallicity relation by using a sample of galaxies belonging to the AC114 (z=0.317) galaxy cluster. The data was taken from archival VIMOS-MOS spectroscopy to estimate gas-phase metallicities by using strong-line methods. On the other hand, the data obtained from DECaLS DR10 and VIKING DR4 ESO surveys were used to estimate photometric masses. We found that passive galaxies dominate the population of AC114 in the cluster center, whereas the star-forming members tend to be located outside this region. The constructed MZR from the latter indicates that AC114 SF galaxies have a lower metallicity content than foreground galaxies (z up to 0.28) and the same or even lower metallicities with respect to background galaxies (spanning redshifts 0.34 to 0.70), producing slightly a shallower slope compared to the field MZR at z~0.3. Additionally, it shows a higher scatter of 0.17 dex, consistent with MZRs of galaxy clusters reported in the literature. The responsible mechanisms behind the scatter are consistent with simulations and observations where dynamic and environmental effects such as galaxy-galaxy interactions and ram-pressure stripping are shaping the chemical evolution of the AC114 SF members. The former mechanism can decrease gas-phase metallicities because of pristine gas infall to the galaxy's outskirts, and the latter increases gas-phase metallicities because of the stripping of the metal-poor gas located at the outskirts of the SF members. The AC114 SF members are metal-poorer than field galaxies at the same redshift, so the cluster dominated by galaxy-galaxy interactions is the best scenario that explains the slightly shallower slope and the higher scatter of the AC114-MZR compared to the field MZR at z~0.3."}
