{"main_page": "https://arxiv.org/abs/2404.00339", "pdf": "https://arxiv.org/pdf/2404.00339", "title": "Quadrupole Moment of a Magnetically Confined Mountain on an Accreting  Neutron Star in General Relativity", "authors": "Pedro Henrique Barboza Rossetto, Jörg Frauendiener, Andrew Melatos", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "General relativistic corrections are calculated for the quadrupole moment of a magnetically confined mountain on an accreting neutron star. The hydromagnetic structure of the mountain satisfies the general relativistic Grad-Shafranov equation supplemented by the flux-freezing condition of ideal magnetohydrodynamics, as in previous calculations of the magnetic dipole moment. It is found that the ellipticity and hence the gravitational wave strain is $4\\%$ to $12\\%$ smaller than in the analogous Newtonian system. The direct contribution of the magnetic field to the nonaxisymmetric component of the stress-energy tensor is also considered, and it is shown that it is negligible in systems such as low-mass X-ray binaries."}
{"main_page": "https://arxiv.org/abs/2404.00363", "pdf": "https://arxiv.org/pdf/2404.00363", "title": "Recent progresses in strange quark stars", "authors": "Xiao-Li Zhang, Yong-Feng Huang, Ze-Cheng Zou", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "According to the hypothesis that strange quark matter may be the true ground state of matter at extremely high densities, strange quark stars should be stable and could exist in the Universe. It is possible that pulsars may actually be strange stars, but not neutron stars. Here we present a short review on recent progresses in the field of strange quark stars. Three popular phenomenological models widely used to describe strange quark matter are introduced, with special attention being paid on the corresponding equation of state in each model. Combining the equation of state with the Tolman-Oppenheimer-Volkov equations, the inner structure and mass-radius relation can be obtained for the whole sequence of strange stars. Strong gravitational wave emissions may be generated by strange stars through various mechanisms, which may help identify strange stars via observations. Especially, close-in strange quark planets with respect to their hosts may provide a unique test for the existence of strange quark objects. Fierce electromagnetic bursts could also be generated by strange stars. The energy may come from the phase transition of neutron stars to strange stars, or from the merger of binary strange stars. The collapse of the strange star crust can also release a huge amount of energy. It is shown that strange quark stars may be involved in short gamma-ray bursts and fast radio bursts."}
{"main_page": "https://arxiv.org/abs/2404.00716", "pdf": "https://arxiv.org/pdf/2404.00716", "title": "Supernova spotting in Super-Kamiokande Gd", "authors": "L. Kneale", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det)", "abstract": "Since the Super-Kamiokande (SK) neutrino experiment in Japan added gadolinium sulphate octahydrate (Gd) to the pure water in its detector, it has entered a new era in supernova neutrino detection. The addition of Gd makes it possible to tag neutrons from inverse beta decay (IBD) interactions of electron antineutrinos with free protons in the water. This has led to significant improvement in the experiment's sensitivity to low-energy electron antineutrinos, which is key in the observation of supernova neutrinos. Super-Kamiokande Gadolinium (SK-Gd) has the potential to make the first observation of the diffuse supernova neutrino background (DSNB) and pre-supernova (preSN) neutrinos, and can improve the pointing capability of SK in the event of a core-collapse supernova (CCSN) explosion. We present the latest results and prospects for supernova neutrino detection with SK-Gd."}
{"main_page": "https://arxiv.org/abs/2404.00720", "pdf": "https://arxiv.org/pdf/2404.00720", "title": "Kicking time back in black-hole mergers: Ancestral masses, spins, birth  recoils and hierarchical-formation viability of GW190521", "authors": "Carlos Araújo Álvarez, Henry W.Y. Wong, Juan Calderón Bustillo", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "Pair-instability supernova (PISN) is thought to prevent the formation of black holes from stellar collapse within the approximate mass range $M\\in [65,130]M_\\odot$. However, such black holes may form through hierarchical formation channels, as the result of merging \"ancestor\" black holes, whose properties determine those of the ``child'' black hole, namely its mass, spin, and recoil velocity (or kick). Crucially, the child black hole will be expelled from its host environment if its \"birth kick\" exceeds the corresponding escape velocity, preventing it from undergoing further mergers. In this work, we exploit tight relations between the final kick and final spin of quasi-circular black-hole mergers to obtain posterior probability distributions for the hypothetical ancestral masses, spins and birth kicks of the component black holes of GW190521, assuming both quasi-circular (with generic spins) eccentric (aligned-spin) scenarios for the latter. With this, we evaluate the probability $p_{2g}$ that the GW190521 components formed from the merger of stellar-origin black holes, being retained by the host environment. For the primary component BH1, which falls squarely in the PISN mass gap, we find that such scenario is strongly suppressed if GW190521 happened in a Globular Cluster, unless GW190521 was quasi-circular and BH1 had aligned-spin ancestors, characteristic of isolated black-hole binary formation scenarios. Similarly, for denser host environments (excluding AGNs), we only obtain probabilities $p_{2g} > 0.5$ if GW190521 was quasi-circular and BH1 had aligned-spin ancestors. If GW190521 was eccentric, we find maximal values $p_{2g}$ of only $p_{2g} \\simeq 0.1$ which require ancestral mass ratios $q\\geq 2$, untypical of isolated formation scenarios. Our results seem consistent with an AGN origin for GW190521, especially if this was eccentric."}
{"main_page": "https://arxiv.org/abs/2404.00941", "pdf": "https://arxiv.org/pdf/2404.00941", "title": "Repeating Nuclear Transients as Candidate Electromagnetic Counterparts  of LISA Extreme Mass Ratio Inspirals", "authors": "Shubham Kejriwal, Vojtech Witzany, Michal Zajacek, Dheeraj R. Pasham, Alvin J. K. Chua", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "Extreme-mass-ratio inspirals (EMRIs) are one of the primary targets for the recently adopted millihertz gravitational-wave (GW) observatory LISA. Some previous studies have argued that a fraction of all EMRIs form in matter-rich environments, and can potentially explain the dozens of soft X-ray band ($\\sim 10^{-1} \\rm keV$), low-frequency ($\\sim 0.1$ mHz) periodic phenomena known as quasi-periodic eruptions (QPEs) and quasi-periodic oscillations (QPOs). Here, using a representative EMRI population retrofitted with cutoffs on LISA-band SNRs and luminosity distances to account for the sensitivity of current instruments, we estimate the mean frequency band in which QPEs and QPOs originating from detectable LISA EMRIs may be emitting an X-ray signal ``today'' (i.e., in 2024) to be $0.46 \\pm 0.22$ mHz. We also model the well-known QPO source, RE J1034+396, which falls in this frequency band, as an EMRI assuming its primary black hole mass to be $10^6-10^7 M_\\odot$. Through a prior-predictive analysis, we estimate the orbiting compact object's mass to be $46^{+ 10}_{-40} M_\\odot$ and the source's LISA-band SNR as $\\approx 14$, highlighting it as a candidate multi-messenger EMRI target. We also highlight the role of current and near-future X-ray and UV observatories in enabling multi-messenger observations of EMRIs in conjunction with LISA, and conclude with a discussion of caveats of the current analysis, such as the exclusion of eccentricity and inclination from the model, and the measurability of sub-solar mass compact object EMRIs."}
{"main_page": "https://arxiv.org/abs/2404.01181", "pdf": "https://arxiv.org/pdf/2404.01181", "title": "Constraining Dark Matter Annihilation with Fermi-LAT Observations of  Ultra-Faint Compact Stellar Systems", "authors": "A. Circiello, A. McDaniel, A. Drlica-Wagner, C. Karwin, M. Ajello, M. Di Mauro, M. Sánchez-Conde", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "Recent results from numerical simulations and models of galaxy formation suggest that recently discovered ultra-faint compact stellar systems (UFCSs) in the halo of the Milky Way (MW) may be some of the smallest and faintest galaxies. If this is the case, these systems would be attractive targets for indirect searches of weakly interacting massive particle (WIMP) dark matter (DM) annihilation due to their relative proximity and high expected DM content. In this study, we analyze 14.3 years of gamma-ray data collected by the Fermi-LAT coincident with 26 UFCSs. No significant excess gamma-ray emission is detected, and we present gamma-ray flux upper limits for these systems. Assuming that the UFCSs are dark-matter-dominated galaxies consistent with being among the faintest and least massive MW dwarf spheroidal (dSphs) satellite galaxies, we derive the projected sensitivity for a dark matter annihilation signal. We find that observations of UFCSs have the potential to yield some of the most powerful constraints on DM annihilation, with sensitivity comparable to observations of known dSphs and the Galactic center. This result emphasizes the importance of precise kinematic studies of UFCSs to empirically determine their DM content."}
{"main_page": "https://arxiv.org/abs/2404.01235", "pdf": "https://arxiv.org/pdf/2404.01235", "title": "Anomaly Detection and Approximate Similarity Searches of Transients in  Real-time Data Streams", "authors": "P. D. Aleo, A. W. Engel, G. Narayan, C. R. Angus, K. Malanchev, K. Auchettl, V. F. Baldassare, A. Berres, T. J. L. de Boer, B. M. Boyd, K. C. Chambers, K. W. Davis, N. Esquivel, D. Farias, R. J. Foley, A. Gagliano, C. Gall, H. Gao, S. Gomez, M. Grayling, C.-C. Lin, E. A. Magnier, K. S. Mandel, T. Matheson, S. I. Raimundo, V. G. Shah, M. D. Soraisam, K. M. de Soto, S. Vicencio, V. A. Villar", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "We present LAISS (Lightcurve Anomaly Identification and Similarity Search), an automated pipeline to detect anomalous astrophysical transients in real-time data streams. We deploy our anomaly detection model on the nightly ZTF Alert Stream via the ANTARES broker, identifying a manageable $\\sim$1-5 candidates per night for expert vetting and coordinating follow-up observations. Our method leverages statistical light-curve and contextual host-galaxy features within a random forest classifier, tagging transients of rare classes (spectroscopic anomalies), of uncommon host-galaxy environments (contextual anomalies), and of peculiar or interaction-powered phenomena (behavioral anomalies). Moreover, we demonstrate the power of a low-latency ($\\sim$ms) approximate similarity search method to find transient analogs with similar light-curve evolution and host-galaxy environments. We use analogs for data-driven discovery, characterization, (re-)classification, and imputation in retrospective and real-time searches. To date we have identified $\\sim$50 previously known and previously missed rare transients from real-time and retrospective searches, including but not limited to: SLSNe, TDEs, SNe IIn, SNe IIb, SNe Ia-CSM, SNe Ia-91bg-like, SNe Ib, SNe Ic, SNe Ic-BL, and M31 novae. Lastly, we report the discovery of 325 total transients, all observed between 2018-2021 and absent from public catalogs ($\\sim$1% of all ZTF Astronomical Transient reports to the Transient Name Server through 2021). These methods enable a systematic approach to finding the \"needle in the haystack\" in large-volume data streams. Because of its integration with the ANTARES broker, LAISS is built to detect exciting transients in Rubin data."}
{"main_page": "https://arxiv.org/abs/2404.01239", "pdf": "https://arxiv.org/pdf/2404.01239", "title": "Characterization of Atmosphere-Skimming Cosmic-Ray Showers in  High-Altitude Experiments", "authors": "Matias Tueros, Sergio Cabana-Freire, Jaime Álvarez-Muñiz", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "Atmosphere-skimming showers are initiated by cosmic rays with incoming directions such that the full development of the cascade occurs inside the atmosphere without ever reaching the ground. This new class of showers has been observed in balloon-borne experiments such as ANITA, but a characterisation of their properties is lacking. The interplay between the Earth's magnetic field, the long distances over which atmosphere-skimming showers develop, and the low density of the atmosphere they traverse gives rise to several effects that are not seen in downward-going cascades, and require detailed modeling. In this article, we used the latest version of the ZHAireS-RASPASS shower simulation program to tackle this problem, and dwell on the particular phenomena that arises from the peculiar environment on which these showers develop. We focus in particular on the properties of the longitudinal profile of the shower and its fluctuations as a function of cosmic-ray energy, direction and primary mass. We have also studied the phase-space of cosmic-ray arrival directions where detection in high-altitude experiments is more likely, and have found that only in a small range of directions the showers are sufficiently developed before reaching the altitude of the detector. Our results are relevant for the design of high-altitude and in particular balloon-borne experiments, and for the interpretation of the data they collect."}
{"main_page": "https://arxiv.org/abs/2404.01252", "pdf": "https://arxiv.org/pdf/2404.01252", "title": "Non-radial oscillations in newly born compact star considering effects  of phase transition", "authors": "Anil Kumar, Pratik Thakur, Monika Sinha", "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "The massive stars end their lives by supernova explosions leaving central compact objects that may evolve into neutron stars. Initially, after birth, the star remains hot and gradually cools down. We explore the matter and star properties during this initial stage of the compact stars considering the possibility of the appearance of deconfined quark matter in the core of the star. At the initial stage after the supernova explosion, the occurrence of non-radial oscillation in the newly born compact object is highly possible. Non-radial oscillations are an important source of GWs. There is a high chance for GWs from these oscillations, especially the nodeless fundamental (f-) mode to be detected by next-generation GW detectors. We study the evolution in frequencies of non-radial oscillation after birth considering phase transition and predicting the possible signature for different possibilities of theoretical compact star models."}
