{"main_page": "https://arxiv.org/abs/2404.00093", "pdf": "https://arxiv.org/pdf/2404.00093", "title": "JWST COMPASS: NIRSpec/G395H Transmission Observations of the Super-Earth  TOI-836b", "authors": "Lili Alderson, Natasha E. Batalha, Hannah R. Wakeford, Nicole L. Wallack, Artyom Aguichine, Johanna Teske, Jea Adams Redai, Munazza K. Alam, Natalie M. Batalha, Peter Gao, James Kirk, Mercedes Lopez-Morales, Sarah E. Moran, Nicholas Scarsdale, Nicholas F. Wogan, Angie Wolfgang", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "We present two transit observations of the ~870K, 1.7R$_E$ super-Earth TOI-836b with JWST NIRSpec/G395H, resulting in a 2.8-5.2$\\mu$m transmission spectrum. Using two different reduction pipelines, we obtain a median transit depth precision of 34ppm for Visit 1 and 36ppm for Visit 2, leading to a combined precision of 25ppm in spectroscopic channels 30 pixels wide (~0.02$\\mu$m). We find that the transmission spectrum from both visits is well fit by a zero-sloped line by fitting zero-sloped and sloped lines, as well as step functions to our data. Combining both visits, we are able to rule out atmospheres with metallicities <250xSolar for an opaque pressure level of 0.1 bar, corresponding to mean molecular weights to <6gmol$^{-1}$. We therefore conclude that TOI-836b does not have an H$_2$-dominated atmosphere, in possible contrast with its larger, exterior sibling planet, TOI-836c. We recommend that future proposals to observe small planets exercise caution when requiring specific numbers of transits to rule out physical scenarios, particularly for high metallicities and planets around bright host stars, as PandExo predictions appear to be more optimistic than that suggested by the gains from additional transits implied by our data."}
{"main_page": "https://arxiv.org/abs/2404.00887", "pdf": "https://arxiv.org/pdf/2404.00887", "title": "Formation and Evolution of the Stream of SOHO Kreutz Sungrazers. II.  Results and Implications of Monte Carlo Simulation", "authors": "Zdenek Sekanina", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "I present the results of the first comprehensive effort aimed at modeling a major component of the stream of SOHO sungrazers, 5000 of which have been detected by the onboard coronagraphs since 1996. The stream of Population I of the Kreutz system, investigated by a Monte Carlo simulation technique, is treated as a product of cascading fragmentation due to unstable rotation of a \"seed,\" a subkilometer-sized object that separated with others from comet X/1106 C1 at perihelion. The stream's activity is predicted to last for 200 years from ~1950 to ~2150, culminating in the 2010s, when a swarm of bright SOHO sungrazers (peak mags not fainter than 3) of Population I was observed. By the end of 2023 about 42 percent of the stream had already arrived. Scatter amounts to 7 deg in the longitude of the ascending node and at most 0.2 solar radius in the perihelion distance. On its initial orbit the seed would pass perihelion in 2036, 193 years after C/1843 D1, the principal fragment of X/1106 C1. Comet C/1668 E1 is proposed as another major fragment and yet another is predicted to arrive in the 2050s or 2060s."}
{"main_page": "https://arxiv.org/abs/2404.01264", "pdf": "https://arxiv.org/pdf/2404.01264", "title": "JWST COMPASS: A NIRSpec/G395H Transmission Spectrum of the Sub-Neptune  TOI-836c", "authors": "Nicole L. Wallack, Natasha E. Batalha, Lili Alderson, Nicholas Scarsdale, Jea I. Adams Redai, Artyom Aguichine, Munazza K. Alam, Peter Gao, Angie Wolfgang, Natalie M. Batalha, James Kirk, Mercedes López-Morales, Sarah E. Moran, Johanna Teske, Hannah R. Wakeford, Nicholas F. Wogan", "subjects": "Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "Planets between the sizes of Earth and Neptune are the most common in the Galaxy, bridging the gap between the terrestrial and giant planets in our Solar System. Now that we are firmly in the era of JWST, we can begin to measure, in more detail, the atmospheres of these ubiquitous planets to better understand their evolutionary trajectories. The two planets in the TOI-836 system are ideal candidates for such a study, as they fall on either side of the radius valley, allowing for direct comparisons of the present-day atmospheres of planets that formed in the same environment but had different ultimate end states. We present results from the JWST NIRSpec G395H transit observation of the larger and outer of the planets in this system, TOI-836c (2.587 R$_{\\oplus}$, 9.6 M$_{\\oplus}$, T$_{\\rm eq}$$\\sim$665 K). While we measure average 30-pixel binned precisions of $\\sim$24ppm for NRS1 and $\\sim$43ppm for NRS2 per spectral bin, we do find residual correlated noise in the data, which we attempt to correct using the JWST Engineering Database. We find a featureless transmission spectrum for this sub-Neptune planet, and are able to rule out atmospheric metallicities $<$175$\\times$ Solar in the absence of aerosols at $\\lesssim$1 millibar. We leverage microphysical models to determine that aerosols at such low pressures are physically plausible. The results presented herein represent the first observation from the COMPASS (Compositions of Mini-Planet Atmospheres for Statistical Study) JWST program, which also includes TOI-836b and will ultimately compare the presence and compositions of atmospheres for 12 super-Earths/sub-Neptunes."}
