{"main_page": "https://arxiv.org/abs/2404.00104", "pdf": "https://arxiv.org/pdf/2404.00104", "title": "Accurate PRD modeling of the forward-scattering Hanle effect in the  chromospheric CaI 4227 Å line", "authors": "Luca Belluzzi, Simone Riva, Gioele Janett, Nuno Guerreiro, Fabio Riva, Pietro Benedusi, Tanausú del Pino Alemán, Ernest Alsina Ballester, Javier Trujillo Bueno, Jiří Štěpán", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Measurable linear scattering polarization signals have been predicted and detected at the solar disk center in the core of chromospheric lines. These forward-scattering polarization signals, which are of high interest for magnetic field diagnostics, have always been modeled either under the assumption of complete frequency redistribution (CRD), or taking partial frequency redistribution (PRD) effects into account under the angle-averaged (AA) approximation. This work aims at assessing the suitability of the CRD and PRD-AA approximations for modeling the forward-scattering polarization signals produced by the presence of an inclined magnetic field, the so-called forward-scattering Hanle effect, in the chromospheric CaI 4227 A line. Radiative transfer calculations are performed in semi-empirical 1D solar atmospheres, out of local thermodynamic equilibrium (LTE). A two-step solution strategy is applied: the non-LTE RT problem is first solved considering a multilevel atom and neglecting polarization phenomena. The same problem is then solved including polarization, considering a two-level atom and keeping fixed the lower-level population calculated at the previous step. The emergent linear polarization signals calculated under the CRD and PRD-AA approximations are analyzed and compared to those obtained by modeling PRD effects in their general angle-dependent (AD) formulation. With respect to the PRD-AD case, the CRD and PRD-AA calculations significantly underestimate the amplitude of the line-center polarization signals produced by the forward-scattering Hanle effect. The results of this work suggest that a PRD-AD modeling is required in order to develop reliable diagnostic techniques exploiting the forward-scattering polarization signals observed in the CaI 4227 A line. These results need to be confirmed by full 3D calculations including non-magnetic symmetry-breaking effects."}
{"main_page": "https://arxiv.org/abs/2404.00105", "pdf": "https://arxiv.org/pdf/2404.00105", "title": "Diagnostics of the solar coronal plasmas by magnetohydrodynamic waves:  Magnetohydrodynamic seismology", "authors": "Valery M. Nakariakov, Sihui Zhong, Dmitrii Y. Kolotkov, Rebecca L. Meadowcroft, Yu Zhong, Ding Yuan", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph); Space Physics (physics.space-ph)", "abstract": "Macroscopic wave and oscillatory phenomena ubiquitously detected in the plasma of the corona of the Sun are interpreted in terms of magnetohydrodynamic theory. Fast and slow magnetoacoustic waves are clearly distinguished in observations. Properties of coronal magnetohydrodynamic waves are determined by local parameters of the plasma, including the field-aligned filamentation typical for the corona. It makes coronal magnetohydrodynamic waves reliable probes of the coronal plasma structures by the method of magnetohydrodynamic seismology. For example, propagating slow waves indicate the local direction of the guiding magnetic field. Standing, sloshing and propagating slow waves can be used for probing the coronal heating function and the polytropic index. Kink oscillations of coronal plasma loops provide us with the estimations of the absolute value of the magnetic field in oscillating plasma loops. This tutorial introduces several techniques of magnetohydrodynamic seismology of solar coronal plasmas. It includes the description of practical steps in the data acquisition, pre-processing, and processing using the open-access data of the Atmospheric Imaging Assembly on the Solar Dynamics Observatory spacecraft, and elaborated data analysis techniques of motion magnification and Bayesian statistics."}
{"main_page": "https://arxiv.org/abs/2404.00127", "pdf": "https://arxiv.org/pdf/2404.00127", "title": "Non-thermal broadening of coronal lines in a 3D MHD loop model", "authors": "C.A. Breu, H. Peter, S.K. Solanki, R. Cameron, I. De Moortel", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Observed spectral profiles of emission lines from the corona are found to have widths exceeding the thermal line width. To investigate the physical mechanism, we run a 3D MHD model of a single, straightened loop in which we partially resolve turbulent motions that form in response to the driving by self-consistently evolving magneto-convection in the photosphere. The convective motions shear and twist the magnetic field lines, leading to heating. From the model we synthesize spectral profiles of emission lines forming at temperatures around and above 1 MK. The coronal heating process generates a range of velocity amplitudes and directions structured on a scale much smaller than the resolving power of current instruments, leading to a broadening of the spectral lines. Our model includes the mass exchange between corona and chromosphere, thus we also capture flows parallel to the loop axis. We find that the spectral lines show a non-thermal line broadening roughly consistent with observations for a viewing angle perpendicular to the axis. The broadening through field-parallel flows is comparable, although slightly smaller. The line broadening is independent of the instrument resolution for a perpendicular line-of-sight. We can connect the non-thermal line broadening to heating events and flows. While small-scale velocities along the line-of-sight are mainly responsible for the broadening observed perpendicular to the loop, chromospheric evaporation is important for the line broadening observed along the loop. The model reproduces observed values for non-thermal line widths. In the model these result from continuous driving by magnetoconvection, without imposing driving motions or starting from an already braided field."}
{"main_page": "https://arxiv.org/abs/2404.00135", "pdf": "https://arxiv.org/pdf/2404.00135", "title": "Coronal Signatures of Flare Generated Fast Mode Wave at EUV and Radio  wavelengths", "authors": "V. Vasanth", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "This paper presents a detailed study of the type II solar radio burst that occurred on 06 March 2014 using combined data analysis. It is a classical radio event consisting of type III radio burst and a following type II radio burst in the dynamic spectrum. The type II radio burst is observed between 235 - 130 MHz (120 - 60 MHz) in harmonic (fundamental) bands with the life time of 5 minutes between 09:26 UT - 09:31 UT. The estimated speed of type II burst by applying twofold Saito model is 650 km/s. An extreme ultraviolet (EUV) wave is observed with Atmospheric Imaging Assembly (AIA) onboard the Solar Dynamics Observatory (SDO) pass bands. The very close temporal onset association of EUV wave and flare energy release indicates that the EUV wave is likely produced by a flare pressure pulse. The eruption is also accompanied by a weak coronal mass ejection (CME) observed with the coronagraphs onboard Solar and Heliospheric Observatory (SOHO) and the twin Solar Terrestrial Relations Observatory (STEREO). The plane of sky speed of the CME was 252 km/s at SOHO/LASCO-C2 and 280 km/s at STEREO-B/SECCHI-COR1 FOV. The EUV wave has two wave fronts, one expanding radially outward, and the other one moving along the arcade. The source position of the type II burst imaged by the Nancay Radio Heliograph (NRH) shows that it was associated with the outward moving EUV wave. The CME is independent of the shock wave as confirmed by the location of NRH radio sources below the CME's leading edge. Therefore the type II radio burst is probably ignited by the flare. This study shows the possibility of EUV wave and coronal shock triggered by flare pressure pulse, generating the observed type II radio burst."}
{"main_page": "https://arxiv.org/abs/2404.00151", "pdf": "https://arxiv.org/pdf/2404.00151", "title": "Discovery of the Longest-Period Classical Cepheid in the Milky Way", "authors": "I. Soszyński, D. M. Skowron, A. Udalski, P. Pietrukowicz, M. Gromadzki, M. K. Szymański, J. Skowron, P. Mróz, R. Poleski, S. Kozłowski, P. Iwanek, M. Wrona, K. Ulaczyk, K. Rybicki, M. Mróz", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "We report the discovery of the classical Cepheid OGLE-GD-CEP-1884 (= GDS_J1535467-555656) with the longest pulsation period known in our Galaxy. The period of 78.14 d is nearly 10 d longer than that of the previous record-holding Cepheid, S Vulpeculae, and thus, OGLE-GD-CEP-1884 can be categorized as the first ultra long period Cepheid in the Milky Way. This star is present in the ASAS-SN and Gaia DR3 catalogs of variable stars, but it has been classified as a long-period variable in those catalogs. Based on more than 10 years of the photometric monitoring of this star carried out by the OGLE project in the I and V bands and a radial velocity curve from the Gaia Focused Product Release, we unequivocally demonstrate that this object is a fundamental-mode classical Cepheid. By employing the mid-infrared period-luminosity relation, we determine the distance to OGLE-GD-CEP-1884 (4.47 +- 0.34 kpc) and place it on the Milky Way map, along with about 2400 other classical Cepheids. We also discuss the potential of finding additional ultra long period Cepheids in our Galaxy."}
{"main_page": "https://arxiv.org/abs/2404.00889", "pdf": "https://arxiv.org/pdf/2404.00889", "title": "Transport of the magnetic flux away from a decaying sunspot via  convective motions", "authors": "Chenxi Zheng, Thierry Roudier, Brigitte Schmieder, Guiping Ruan, Jean-Marie Malherbe, Yang Liu, Yao Chen, Wenda Cao", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Aims. The aim of this paper is to consider relationship between the decay of sunspots and convection via the motion of the family of granules and how the diffusion mechanism of magnetic field operates in a decaying sunspot. Methods. We report the decay of a sunspot observed by the 1.6m Goode Solar Telescope (GST) with the TiO Broadband Filter Imager (BFI) and the Near-InfraRed Imaging Spectropolarimeter (NIRIS). The analysis was aided by the Helioseismic and Magnetic Imager (HMI) on board the Solar Dynamic Observatory (SDO). In the first step, we followed the decay of the sunspot with HMI data over three days by constructing its evolving area and total magnetic flux. In the second step, the high spatial and temporal resolution of the GST instruments allowed us to analyze the causes of the decay of the sunspot. Afterward, we followed the emergence of granules in the moat region around the sunspot over six hours. The evolution of the trees of fragmenting granules (TFGs) was derived based on their relationship with the horizontal surface flows. Results. We find that the area and total magnetic flux display an exponential decrease over the course of the sunspot decay. We identified 22 moving magnetic features (MMFs) in the moats of pores, which is a signature of sunspot decay through diffusion. We note that the MMFs were constrained to follow the borders of TFGs during their journey away from the sunspot. Conclusions. The TFGs and their development contribute to the diffusion of the magnetic field outside the sunspot. The conclusion of our analysis shows the important role of the TFGs in sunspot decay. Finally, the the family of granules evacuates the magnetic field."}
{"main_page": "https://arxiv.org/abs/2404.00911", "pdf": "https://arxiv.org/pdf/2404.00911", "title": "Clues in Bailey Diagrams Indicate that the Horizontal Branch  Evolutionary Effect Is the Direct Reason for Oosterhoff Phenomenon", "authors": "L.-J. Li, S.-B. Qian, L.-Y. Zhu, X.-D. Shi, W.-P. Liao", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Noticing the potential relationship between the pulsation amplitude of fundamental mode RR Lyrae stars and their average effective temperatures, we derived the relation between them from observational data. Using these relationships, we present the zero-age horizontal branch lines and corresponding evolutionary tracks in the Bailey diagrams. We first find that the trends of zero-age horizontal branch lines are consistent with the distributions of Oosterhoff I RR Lyrae stars, and there is a period shift effect in relatively metal-rich samples ([Fe/H] > -1). Main results show that evolutionary effects are the direct cause of the Oosterhoff dichotomy. The vast majority of Oosterhoff I RR Lyrae stars are in the early stage of horizontal branch evolution, while most of the Oosterhoff II stars are near the end of the horizontal branch phase. Our Bailey diagrams can intuitively explain some Oosterhoff phenomena (e.g., long-period RR Lyrae stars in the metal-rich globular clusters NGC 6388 and NGC 6441), and also have the potential to become an important tool for in-depth study of RR Lyrae stars. Further research is needed on the Oosterhoff dichotomy to explore the formations and evolutionary processes of the Milky Way and its substructures."}
{"main_page": "https://arxiv.org/abs/2404.01092", "pdf": "https://arxiv.org/pdf/2404.01092", "title": "Rediscussion of eclipsing binaries. Paper XVIII. The F-type system OO  Pegasi", "authors": "John Southworth", "subjects": "Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "OO Peg is a detached eclipsing binary system containing two late-A-type stars in a circular orbit with a period of 2.985 d. Using published spectroscopic results and a light curve from the Transiting Exoplanet Survey Satellite (TESS) we determine their masses to be 1.69 +/- 0.09 and 1.74 +/- 0.06 Msun, and their radii to be 2.12 +/- 0.03 and 1.91 +/- 0.03 Rsun. The TESS data are of high quality, but discrepancies in the radial velocities from two sources prevent a precise mass measurement. The primary star is definitively hotter, larger and more luminous than its companion, but its mass is lower (albeit to a significance of only 1.1 sigma). Using published apparent magnitudes and temperatures, we find a distance of 238.8 +/- 6.1 pc, in agreement with the Gaia DR3 parallax. Although both components are in the delta Scuti instability strip, we find no evidence of pulsations. More extensive spectroscopy is needed to improve our understanding of the system."}
