{"main_page": "https://arxiv.org/abs/2404.00238", "pdf": "https://arxiv.org/pdf/2404.00238", "title": "Flattening a trapped atomic gas using a programmable optical potential  in a feedback loop", "authors": "Sol Kim, Kyuhwan Lee, Jongmin Kim, Y. Shin", "subjects": "Quantum Gases (cond-mat.quant-gas)", "abstract": "We present a method for producing a flat, large-area Fermi gas of $^6$Li with a uniform area density. The method uses a programmable optical potential within a feedback loop to flatten the in-plane trapping potential for atoms. The optical potential is generated using a laser beam, whose intensity profile is adjusted by a spatial light modulator and optimized through measurements of the density distribution of the sample. The resulting planar sample exhibits a uniform area density within a region of about 480 $\\mu$m in diameter and the standard deviation of the trap bottom potential is estimated to be $\\approx k_B \\times$ 6.1 nK, which is less than 20$\\%$ of the transverse confinement energy. We discuss a dimensional crossover toward 2D regime by reducing the number of atoms in the planar trap, including the effect of the spatial variation of the transverse trapping frequency in the large-area sample."}
{"main_page": "https://arxiv.org/abs/2404.00275", "pdf": "https://arxiv.org/pdf/2404.00275", "title": "Discrete Scale Invariance and $U(2)$ Family of Two-Body Contact  Interactions in One Dimension", "authors": "Satoshi Ohya", "subjects": "Quantum Gases (cond-mat.quant-gas); Quantum Physics (quant-ph)", "abstract": "Because of the absence of indistinguishability constraint, interparticle interactions between nonidentical particles have in general much more variety than those between identical particles. In particular, it is known that there exists a $U(2)$ family of two-body contact interactions between nonidentical particles in one spatial dimension. This paper studies breakdown of continuous scale invariance to discrete scale invariance under this $U(2)$ family of two-body contact interactions in two-body problems of nonidentical particles on the half line. We show that, in contrast to the corresponding identical-particle problem, there exist two distinct channels that admit geometric sequences of two-body bound states."}
{"main_page": "https://arxiv.org/abs/2404.00533", "pdf": "https://arxiv.org/pdf/2404.00533", "title": "Gauge potentials and vortices in the Fock space of a pair of  periodically driven Bose-Einstein condensates", "authors": "J. Mumford, D. Kamp, D. H. J. O'Dell", "subjects": "Quantum Gases (cond-mat.quant-gas); Quantum Physics (quant-ph)", "abstract": "We perform a theoretical study of the coupled dynamics of two species of Bose-Einstein condensates (BECs) in a double well potential where both the tunneling and the interatomic interactions are driven periodically in time. The population difference between the wells of each species gives rise to a two dimensional lattice in Fock space with dimensions given by the number of atoms in each BEC. We use a Floquet analysis to derive an effective Hamiltonian that acts in this Fock space and find that it contains an artificial gauge field. This system simulates noninteracting particles in a tight binding lattice subject to an additional harmonic potential and vector potential. When the intra-species interactions are attractive there is a critical value at which the ground state of the Floquet operator undergoes a transition from a Gaussian state to a quantized vortex state in Fock space. The transition can be quantified in terms of the angular momentum as well as the entanglement entropy of the ground state with both showing sudden jumps as the intra-species interactions become stronger. The stability of the vortex state vanishes in the thermodynamic limit."}
{"main_page": "https://arxiv.org/abs/2404.00642", "pdf": "https://arxiv.org/pdf/2404.00642", "title": "Bloch-Landau-Zener oscillations in a quasi-periodic potential", "authors": "Henrique C. Prates, Vladimir V. Konotop", "subjects": "Quantum Gases (cond-mat.quant-gas); Quantum Physics (quant-ph)", "abstract": "Bloch oscillations and Landau-Zener tunneling are ubiquitous phenomena which are sustained by a band-gap spectrum of a periodic Hamiltonian and can be observed in dynamics of a quantum particle or a wavepacket in a periodic potential under action of a linear force. Such physical setting remains meaningful for aperiodic potentials too, although band-gap structure does not exist anymore. Here we consider the dynamics of noninteracting atoms and Bose-Einstein condensates in a quasi-periodic one-dimensional optical lattice subjected to a weak linear force. Excited states with energies below the mobility edge, and thus localized in space, are considered. We show that the observed oscillatory behavior is enabled by tunneling between the initial state and a state (or several states) located nearby in the coordinate-energy space. The states involved in such Bloch-Landau-Zener oscillations are determined by the selection rule consisting of the condition of their spatial proximity and condition of quasi-resonances occurring at avoided crossings of the energy levels. The latter condition is formulated mathematically using the Gershgorin circle theorem. The effect of the inter-atomic interactions on the dynamics can also be predicted on the bases of the developed theory. The reported results can be observed in any physical system allowing for observation of the Bloch oscillations, upon introducing incommensurablity in the governing Hamiltonian."}
{"main_page": "https://arxiv.org/abs/2404.00737", "pdf": "https://arxiv.org/pdf/2404.00737", "title": "Interaction-driven breakdown of Aharonov--Bohm caging in flat-band  Rydberg lattices", "authors": "Tao Chen, Chenxi Huang, Ivan Velkovsky, Tomoki Ozawa, Hannah Price, Jacob P. Covey, Bryce Gadway", "subjects": "Quantum Gases (cond-mat.quant-gas); Atomic Physics (physics.atom-ph); Quantum Physics (quant-ph)", "abstract": "Flat bands play a central role in hosting emergent states of matter in many condensed matter systems, from the nascent insulating states of twisted bilayer graphene to the fractionalized excitations found in frustrated magnets and quantum Hall materials. Here, we report on the experimental realization of highly tunable flat-band models populated by strongly interacting Rydberg atoms. Using the approach of synthetic dimensions, we engineer a flat-band rhombic lattice with twisted boundaries, and through nonequilibrium dynamics we explore the control of Aharonov--Bohm (AB) caging via a tunable $U(1)$ gauge field. Through microscopic measurements of Rydberg pairs, we explore the interaction-driven breakdown of AB caging in the limit of strong dipolar interactions that mix the lattice bands. In the limit of weak interactions, where caging remains intact, we observe an effective magnetism that arises due to the interaction-driven mixing of degenerate flat-band states. These observations of strongly correlated flat-band dynamics open the door to explorations of new emergent phenomena in synthetic quantum materials."}
{"main_page": "https://arxiv.org/abs/2404.00956", "pdf": "https://arxiv.org/pdf/2404.00956", "title": "Parallel finite-element codes for the Bogoliubov-de Gennes stability  analysis of Bose-Einstein condensates", "authors": "Georges Sadaka, Pierre Jolivet, Efstathios G. Charalampidis, Ionut Danaila", "subjects": "Quantum Gases (cond-mat.quant-gas)", "abstract": "We present and distribute a parallel finite-element toolbox written in the free software FreeFem for computing the Bogoliubov-de Gennes (BdG) spectrum of stationary solutions to one- and two-component Gross-Pitaevskii (GP) equations, in two or three spatial dimensions. The parallelization of the toolbox relies exclusively upon the recent interfacing of FreeFem with the PETSc library. The latter contains itself a wide palette of state-of-the-art linear algebra libraries, graph partitioners, mesh generation and domain decomposition tools, as well as a suite of eigenvalue solvers that are embodied in the SLEPc library. Within the present toolbox, stationary states of the GP equations are computed by a Newton method. Branches of solutions are constructed using an adaptive step-size continuation algorithm. The combination of mesh adaptivity tools from FreeFem with the parallelization features from PETSc makes the toolbox efficient and reliable for the computation of stationary states. Their BdG spectrum is computed using the SLEPc eigenvalue solver. We perform extensive tests and validate our programs by comparing the toolbox's results with known theoretical and numerical findings that have been reported in the literature."}
