{"main_page": "https://arxiv.org/abs/2404.00215", "pdf": "https://arxiv.org/pdf/2404.00215", "title": "Minimizing the Profligacy of Searches with Reset", "authors": "John C. Sunil, Richard A. Blythe, Martin R. Evans, Satya N. Majumdar", "subjects": "Statistical Mechanics (cond-mat.stat-mech)", "abstract": "We introduce the profligacy of a search process as a competition between its expected cost and the probability of finding the target. The arbiter of the competition is a parameter $\\lambda$ that represents how much a searcher invests into increasing the chance of success. Minimizing the profligacy with respect to the search strategy specifies the optimal search. We show that in the case of diffusion with stochastic resetting, the amount of resetting in the optimal strategy has a highly nontrivial dependence on model parameters resulting in classical continuous transitions, discontinuous transitions and tricritical points as well as non-standard discontinuous transitions exhibiting re-entrant behavior and overhangs."}
{"main_page": "https://arxiv.org/abs/2404.00219", "pdf": "https://arxiv.org/pdf/2404.00219", "title": "Complete universal scaling in first-order phase transitions", "authors": "Fan Zhong", "subjects": "Statistical Mechanics (cond-mat.stat-mech)", "abstract": "Phase transitions and critical phenomena are among the most intriguing phenomena in nature and society. They are classified as first-order phase transitions (FOPTs) and continuous ones. While the latter show marvelous phenomena of scaling and universality, whether the former behaves similarly is a long-standing controversial issue. Here we definitely demonstrate complete universal scaling in field driven FOPTs for Langevin equations in both zero and two spatial dimensions by rescaling all parameters and subtracting extra contributions with singular dimensions from an effective temperature and a special field according to an effective theory that possesses a fixed point of a seemingly un-physical imaginary value. This offers a perspective different from the usual nucleation and growth but conforming to continuous phase transitions to study FOPTs."}
{"main_page": "https://arxiv.org/abs/2404.00379", "pdf": "https://arxiv.org/pdf/2404.00379", "title": "Non-additive Stochastic Model for Supercooled Liquids: New Perspectives  for Glass Science", "authors": "Antonio Cesar do Prado Rosa Junior, Elias Brito Alves Junior, Wanisson Silva Santana, Clebson Cruz", "subjects": "Statistical Mechanics (cond-mat.stat-mech)", "abstract": "We present a review of the Non-additive Stochastic Model for supercooled liquids (NSM), an efficient approach for diffusive processes that provides a suitable interpretation for the non-Arrhenius dynamics in these materials. Based on a class of non-homogeneous continuity equations, the NSM provides functions able to model the thermal behavior of the viscosity and diffusivity in fragile liquids. The model defines a rigorous physical criterion that distinguishes super-Arrhenius from sub-Arrhenius processes, establishes a robust scale of fragility, describes fragile-to-strong curves in Angell's plot, and provides an accurate fitting equation for experimental viscosity data as effective as other viscosity classic models."}
{"main_page": "https://arxiv.org/abs/2404.00422", "pdf": "https://arxiv.org/pdf/2404.00422", "title": "Moments of Entropy Production in Dissipative Devices", "authors": "Jean-Charles Delvenne, Léopold Van Brandt", "subjects": "Statistical Mechanics (cond-mat.stat-mech)", "abstract": "We characterize the possible moments of entropy production for general overdamped Markovian systems. We find a general formulation of the problem, and derive a new necessary condition between the second and third moment. We determine all possible first, second and third moments of entropy production for a white noise process. As a consequence, we obtain a lower bound for the skewness of the current fluctuations in dissipative devices such as transistors, thereby demonstrating that the Gaussianity assumption widely used in electronic engineering is thermodynamically inconsistent."}
{"main_page": "https://arxiv.org/abs/2404.00615", "pdf": "https://arxiv.org/pdf/2404.00615", "title": "Harmonic chain driven by active Rubin bath: transport properties and  steady-state correlations", "authors": "Ritwick Sarkar, Ion Santra, Urna Basu", "subjects": "Statistical Mechanics (cond-mat.stat-mech); Soft Condensed Matter (cond-mat.soft)", "abstract": "Characterizing the properties of an extended system driven by active reservoirs is a question of increasing importance. Here we address this question in two steps. We start by investigating the dynamics of a probe particle connected to an `active Rubin bath' -- a linear chain of overdamped run-and-tumble particles. We derive exact analytical expressions for the effective noise and dissipation kernels, acting on the probe, and show that the active nature of the bath leads to a modified fluctuation-dissipation relation. In the next step, we study the properties of an activity-driven system, modeled by a chain of harmonic oscillators connected to two such active reservoirs at the two ends. We show that the system reaches a nonequilibrium stationary state (NESS), remarkably different from that generated due to a thermal gradient. We characterize this NESS by computing the kinetic temperature profile, spatial and temporal velocity correlations of the oscillators, and the average energy current flowing through the system. It turns out that, the activity drive leads to the emergence of two characteristic length scales, proportional to the activities of the reservoirs. Strong signatures of activity are also manifest in the anomalous short-time decay of the velocity autocorrelations. Finally, we find that the energy current shows a non-monotonic dependence on the activity drive and reversal in direction, corroborating previous findings."}
{"main_page": "https://arxiv.org/abs/2404.01032", "pdf": "https://arxiv.org/pdf/2404.01032", "title": "Gelation in input-driven aggregation", "authors": "P. L. Krapivsky, Sergey A. Matveev", "subjects": "Statistical Mechanics (cond-mat.stat-mech); Classical Analysis and ODEs (math.CA); Dynamical Systems (math.DS); Numerical Analysis (math.NA)", "abstract": "We investigate irreversible aggregation processes driven by a source of small mass clusters. In the spatially homogeneous situation, a well-mixed system is consists of clusters of various masses whose concentrations evolve according to an infinite system of nonlinear ordinary differential equations. We focus on the cluster mass distribution in the long time limit. An input-driven aggregation with rates proportional to the product of merging partners undergoes a percolation transition. We examine this process analytically and numerically. There are two theoretical schemes and two natural ways of numerical integration on the level of a truncated system with a finite number of equations. After the percolation transition, the behavior depends on the adopted approach: The giant component quickly engulfs the entire system (Flory approach), or a non-trivial stationary mass distribution emerges (Stockmayer approach). We also outline generalization to ternary aggregation."}
{"main_page": "https://arxiv.org/abs/2404.01107", "pdf": "https://arxiv.org/pdf/2404.01107", "title": "Exact moments for trapped active particles: inertial impact on  steady-state properties and re-entrance", "authors": "Manish Patel, Debasish Chaudhuri", "subjects": "Statistical Mechanics (cond-mat.stat-mech); Biological Physics (physics.bio-ph)", "abstract": "In this study, we investigate the behavior of inertial active Brownian particles in a $d$-dimensional harmonic trap in the presence of translational diffusion. While the solution of the Fokker-Planck equation is generally challenging, it can be utilized to compute the exact time evolution of all time-dependent dynamical moments using a Laplace transform approach. We present the explicit form for several moments of position and velocity in $d$-dimensions. An interplay of time scales assures that the effective diffusivity and steady-state kinetic temperature depend on both inertia and trap strength, unlike passive systems. We present detailed `phase diagrams' using kurtosis of velocity and position showing possibilities of re-entrance."}
{"main_page": "https://arxiv.org/abs/2404.01130", "pdf": "https://arxiv.org/pdf/2404.01130", "title": "Thermodynamic dissipation does not bound replicator growth and decay  rates", "authors": "Artemy Kolchinsky", "subjects": "Statistical Mechanics (cond-mat.stat-mech); Biological Physics (physics.bio-ph); Populations and Evolution (q-bio.PE)", "abstract": "In a well-known paper, Jeremy England derived a bound on the free energy dissipated by a self-replicating system [England, \"Statistical physics of self-replication\", The Journal of Chemical Physics, 2013]. This bound is usually interpreted as a universal relationship that links thermodynamic dissipation to the replicator's per-capita decay and growth rates. Contrary to this interpretation, we argue from thermodynamic principles that such a relationship cannot exist. In particular, we show that it is impossible for a system to undergo both replication and per-capita decay back into reactants. While it is possible for a system to undergo replication and decay into separate waste products, in that case replication and decay are two independent physical processes, and there is no universal relationship between their thermodynamic and dynamical properties."}
{"main_page": "https://arxiv.org/abs/2404.01142", "pdf": "https://arxiv.org/pdf/2404.01142", "title": "Hitting probabilities for fast stochastic search", "authors": "Samantha Linn, Sean D. Lawley", "subjects": "Statistical Mechanics (cond-mat.stat-mech); Probability (math.PR)", "abstract": "Many physical phenomena are modeled as stochastic searchers looking for targets. In these models, the probability that a searcher finds a particular target, its so-called hitting probability, is often of considerable interest. In this work we determine hitting probabilities for stochastic search processes conditioned on being faster than a random short time. Such times have been used to model stochastic resetting or stochastic inactivation. These results apply to any search process, diffusive or otherwise, whose unconditional short-time behavior can be adequately approximated, which we characterize for broad classes of stochastic search. We illustrate these results in several examples and show that the conditional hitting probabilities depend predominantly on the relative geodesic lengths between the initial position of the searcher and the targets. Finally, we apply these results to a canonical evidence accumulation model for decision making."}
{"main_page": "https://arxiv.org/abs/2404.01286", "pdf": "https://arxiv.org/pdf/2404.01286", "title": "Beyond Linear Response: Equivalence between Thermodynamic Geometry and  Optimal Transport", "authors": "Adrianne Zhong, Michael R. DeWeese", "subjects": "Statistical Mechanics (cond-mat.stat-mech)", "abstract": "A fundamental result of thermodynamic geometry is that the optimal, minimal-work protocol that drives a nonequilibrium system between two thermodynamic states in the slow-driving limit is given by a geodesic of the friction tensor, a Riemannian metric defined on control space. For overdamped dynamics in arbitrary dimensions, we demonstrate that thermodynamic geometry is equivalent to $L^2$ optimal transport geometry defined on the space of equilibrium distributions corresponding to the control parameters. We show that obtaining optimal protocols past the slow-driving or linear response regime is computationally tractable as the sum of a friction tensor geodesic and a counterdiabatic term related to the Fisher information metric. These geodesic-counterdiabatic optimal protocols are exact for parameteric harmonic potentials, reproduce the surprising non-monotonic behavior recently discovered in linearly-biased double well optimal protocols, and explain the ubiquitous discontinuous jumps observed at the beginning and end times."}
