{"main_page": "https://arxiv.org/abs/2404.00155", "pdf": "https://arxiv.org/pdf/2404.00155", "title": "Machine learning classification of local environments in molecular  crystals", "authors": "Daisuke Kuroshima, Michael Kilgour, Mark E. Tuckerman, Jutta Rogal", "subjects": "Materials Science (cond-mat.mtrl-sci); Chemical Physics (physics.chem-ph); Computational Physics (physics.comp-ph)", "abstract": "Identifying local structural motifs and packing patterns of molecular solids is a challenging task for both simulation and experiment. We demonstrate two novel approaches to characterize local environments in different polymorphs of molecular crystals using learning models that employ either flexibly learned or handcrafted molecular representations. In the first case, we follow our earlier work on graph learning in molecular crystals, deploying an atomistic graph convolutional network, combined with molecule-wise aggregation, to enable per-molecule environmental classification. For the second model, we develop a new set of descriptors based on symmetry functions combined with a point-vector representation of the molecules, encoding information about the positions as well as relative orientations of the molecule. We demonstrate very high classification accuracy for both approaches on urea and nicotinamide crystal polymorphs, and practical applications to the analysis of dynamical trajectory data for nanocrystals and solid-solid interfaces. Both architectures are applicable to a wide range of molecules and diverse topologies, providing an essential step in the exploration of complex condensed matter phenomena."}
{"main_page": "https://arxiv.org/abs/2404.00291", "pdf": "https://arxiv.org/pdf/2404.00291", "title": "Gradient bandgap enables >13% efficiency sulfide Kesterite solar cells  with open-circuit voltage over 800 mV", "authors": "Kang Yin, Jinlin Wang, Licheng Lou, Xiao Xu, Bowen Zhang, Menghan Jiao, Jiangjian Shi, Dongmei Li, Huijue Wu, Yanhong Luo, Qingbo Meng", "subjects": "Materials Science (cond-mat.mtrl-sci); Applied Physics (physics.app-ph)", "abstract": "Sulfide Kesterite Cu2ZnSnS4 (CZTS), a nontoxic and low-cost photovoltaic material, has always being facing severe charge recombination and poor carrier transport, resulting in the cell efficiency record stagnating around 11% for years. Gradient bandgap is a promising approach to relieve these issues, however, has not been effectively realized in Kesterite solar cells due to the challenges in controlling the gradient distribution of alloying elements at high temperatures. Herein, targeting at the Cd alloyed CZTS, we propose a pre-crystallization strategy to reduce the intense vertical mass transport and Cd rapid diffusion in the film growth process, thereby realizing front Cd-gradient CZTS absorber. The Cd-gradient CZTS absorber, exhibiting downward bending conduction band structure, has significantly enhanced the minority carrier transport and additionally improved band alignment and interface property of CZTS/CdS heterojunction. Ultimately, we have achieved a champion total-area efficiency of 13.5% (active-area efficiency: 14.1%) in the cell and in particular a high open-circuit voltage of >800 mV. We have also achieved a certified total-area cell efficiency of 13.16%, realizing a substantial step forward for the pure sulfide Kesterite solar cell."}
{"main_page": "https://arxiv.org/abs/2404.00393", "pdf": "https://arxiv.org/pdf/2404.00393", "title": "Optimum surface-passivation schemes for near-surface spin defects in  silicon carbide", "authors": "Cyrille Armel Sayou Ngomsi, Tamanna Joshi, Pratibha Dev", "subjects": "Materials Science (cond-mat.mtrl-sci)", "abstract": "Spin-active defects in silicon carbide (SiC) are promising quantum light sources for realizing scalable quantum technologies. In different applications, these photoluminescent defects are often placed in a nanostructured host or close to surfaces in order to enhance the signal from the defects. However, proximity to the surface not only modifies frequencies of the quantum emission from the defect, but also adversely affects their photo-stability, resulting in blinking and/or photobleaching of the defect. These effects can be ameliorated by passivating surfaces with optimal adsorbates. In this work, we explore different passivation schemes using density functional theory-based calculations. We show that a uniform surface passivation with either hydrogen or with mixed hydrogen/hydroxyl groups completely removes surface states from the SiC band gap, restoring the optical properties of the defects."}
{"main_page": "https://arxiv.org/abs/2404.00564", "pdf": "https://arxiv.org/pdf/2404.00564", "title": "First Principles Studies of Stacking Fault Energies in Ternary Magnesium  Alloys", "authors": "Qiwen Qiu, Stephen Yue, Jun Song", "subjects": "Materials Science (cond-mat.mtrl-sci)", "abstract": "Magnesium (Mg) alloys have emerged as promising materials due to their low density and high strength-to-weight ratio, offering a wide range of applications across multiple industries. Nevertheless, the inherent brittleness of Mg alloys poses a significant hurdle, necessitating innovative approaches to enhance their mechanical performance. Among the various strategies, manipulating stacking fault energy (SFE) has been a key focus, although primarily within the realm of binary alloys. This study investigates SFE in Mg alloys, focusing on ternary compositions. Utilizing first-principles DFT calculations, we analyze solute interactions and their influence on SFE, particularly in Mg-Al-X and Mg-Zn-X configurations. Predictive models are developed for estimating SFE effects, revealing solute pairs that mimic rare earth elements and show potential for improved ductility. The findings contribute to fundamental insights into Mg alloy behavior, offering practical directions for designing advanced materials with superior mechanical properties."}
{"main_page": "https://arxiv.org/abs/2404.00659", "pdf": "https://arxiv.org/pdf/2404.00659", "title": "Sign-reversal Anomalous Hall effect driven by a magnetic transition in  Cr$_{7-δ}$Te$_8$", "authors": "Bowen Chen, Xiaokai Wu, Zhiyu Liao, Zhendong Fu, Bing Xu, Meng Wang, Bing Shen", "subjects": "Materials Science (cond-mat.mtrl-sci)", "abstract": "The search for exotic spin configurations and related novel transport properties continues to be fueled by the promise of new electronic states and outstanding candidate components for spintronic applications. In layered Cr$_{7-\\delta}$Te$_8$, the applied field drives a before unreported magnetic transition revealed by the alternating current magnetic susceptibility measurements around room temperature. This observed magnetic transition results in a sign change for the anomalous Hall effect which exhibits non-monotonous temperature dependence. The prominent topological Hall effect (THE) with a large value of 1$\\mu \\Omega \\cdot cm$ has been observed without breaking the inversion symmetry for Cr$_{7-\\delta}$Te$_8$. This robust THE can persist up to room temperature attributed to the nonzero fluctuation-driven scalar spin chirality. The complicated interactions of long-range and short-range magnetic orders lead to rich exotic magnetic states with related novel transport properties in Cr$_{7-\\delta}$Te$_8$."}
{"main_page": "https://arxiv.org/abs/2404.00779", "pdf": "https://arxiv.org/pdf/2404.00779", "title": "Charge and spin current pumping by ultrafast demagnetization dynamics", "authors": "Jalil Varela-Manjarres, Ali Kefayati, M. Benjamin Jungfleisch, John Q. Xiao, Branislav K. Nikolic", "subjects": "Materials Science (cond-mat.mtrl-sci); Mesoscale and Nanoscale Physics (cond-mat.mes-hall)", "abstract": "The surprising discovery of ultrafast demagnetization -- where electric field of femtosecond laser pulse couples to electrons of a ferromagnetic (FM) layer causing its magnetization vector {\\em to shrink while not rotating}, is also assumed to be accompanied by generation of spin current in the direction orthogonal to electric field. However, understanding of the microscopic origin of such spin current and how efficiently it can be converted into charge current, as the putative source of THz radiation, is lacking despite nearly three decades of intense studies. Here we connect the standard pumping phenomena driven by microwave precession of magnetization vector replacing periodic time-dependence of magnetization precession with nonperiodic time-dependence of demagnetization, as obtained from experiments on ultrafast-light-driven Ni layer. Applying time-dependent nonequilibrium Green's functions, able to evolve such setup with arbitrary time dependence, reveals how demagnetization dynamics pumps both charge and spin currents in directions both parallel and orthogonal to electric field of laser pulse, even in the absence of spin-orbit coupling and thereby induced spin-to-charge conversion mechanisms. Although pumped currents follow $dM_z/dt$ in some setups, this becomes obscured when NM layers are disconnected and pumped currents start to reflect from FM boundaries (as is the case of experimental setups). Finally, we use the Jefimenko equations to compute electromagnetic radiation by charge current pumped in disconnected setup during demagnetization, or later during its slow recovery, unraveling that radiated electric field only in the former time interval exhibits features in 0.1--30 THz frequency range probed experimentally or explored for applications of spintronic THz emitters."}
{"main_page": "https://arxiv.org/abs/2404.00821", "pdf": "https://arxiv.org/pdf/2404.00821", "title": "Intrinsic conductance of ferroelectric domain walls", "authors": "Feng Yang", "subjects": "Materials Science (cond-mat.mtrl-sci); Applied Physics (physics.app-ph)", "abstract": "Ferroelectric domain walls hold great promise for innovative applications in ferroelectric devices. However, the underlying mechanisms behind the observed giant conductance of charged domain walls remain poorly understood. Using a first-principles approach that incorporates Boltzmann transport theory and the relaxation time approximation, we determine the carrier concentration, mobility, and conductivity of domain walls with head-to-head and tail-to-tail polarization orientations. Our systematic exploration reveals that the accumulation of carriers, particularly their concentration, plays a dominant role in the domain wall conductance mechanism. However, the observed conductance differences between head-to-head and tail-to-tail domain walls are primarily due to differences in carrier mobility. The width of the domain wall is a key factor determining the device scale. Our calculated domain wall width is significantly smaller than previously reported values. This method, not limited to a certain ferroelectric material, can be used for the optimization and application development of various domain wall materials and devices."}
{"main_page": "https://arxiv.org/abs/2404.00833", "pdf": "https://arxiv.org/pdf/2404.00833", "title": "Electronic Structure of Molybdenene", "authors": "Ashkan Shekaari", "subjects": "Materials Science (cond-mat.mtrl-sci)", "abstract": "Nanoscale CAMS (computer-aided materials simulation) within the framework of density functional theory (DFT) has been applied to investigate electronic structure of molybdenene monolayer in both its hexagonal and triclinic eigen-structures as observed formerly in the lab. In agreement with experimental findings, and based on electronic band structure and density of states (DOS) calculations, it has been found that both monolayers are metallic Dirac materials, known as metallic relative of graphene in the literature. Partial DOS analyses have also revealed that both Mo atoms of the unit cells have exactly the same contributions to the metallic property observed, the largest of which, compared to the rest, emerge from the $d$ valence orbitals due to being both half-empty as well as the outermost (then containing weakest-bound electrons), giving charge carriers a higher kinetic/movement degree of freedom to conduct electricity, governed by Pauli's exclusion principle."}
{"main_page": "https://arxiv.org/abs/2404.00845", "pdf": "https://arxiv.org/pdf/2404.00845", "title": "Harnessing Interlayer Magnetic Coupling for Efficient, Field-Free  Current-Induced Magnetization Switching in a Magnetic Insulator", "authors": "Leran Wang, Alejandro O. Leon, Wenqing He, Zhongyu Liang, Xiaohan Li, Xiaoxiao Fang, Wenyun Yang, Licong Peng, Jinbo Yang, Caihua Wan, Gerrit E. W. Bauer, Zhaochu Luo", "subjects": "Materials Science (cond-mat.mtrl-sci)", "abstract": "Owing to the unique features of low Gilbert damping, long spin-diffusion lengths and zero Ohmic losses, magnetic insulators are promising candidate materials for next-generation spintronic applications. However, due to the localized magnetic moments and the complex metal-oxide interface between magnetic insulators and heavy metals, spin-functional Dzyaloshinskii-Moriya interactions or spin Hall and Edelstein effects are weak, which diminishes the performance of these typical building blocks for spintronic devices. Here, we exploit the exchange coupling between metallic and insulating magnets for efficient electrical manipulation of heavy metal/magnetic insulator heterostructures. By inserting a thin Co layer, we enhance the spin-orbit torque efficiency by more than 20 times, which significantly reduces the switching current density. Moreover, we demonstrate field-free current-induced magnetization switching caused by a symmetry-breaking non-collinear magnetic texture. Our work launches magnetic insulators as an alternative platform for low-power spintronic devices."}
{"main_page": "https://arxiv.org/abs/2404.00865", "pdf": "https://arxiv.org/pdf/2404.00865", "title": "Scaling Crystal Structure Relaxation with a Universal Trustworthy Deep  Generative Model", "authors": "Ziduo Yang, Yiming Zhao, Xiaoqing Liu, Xiuying Zhang, Yifan Li, Qiujie Lyu, Calvin Yu-Chian Chen, Lei Shen", "subjects": "Materials Science (cond-mat.mtrl-sci)", "abstract": "The evolution of AI and high-throughput technologies has boosted a rapid increase in the number of new materials, challenging our computational ability to comprehensively analyze their properties. Relaxed crystal structures often serve as the foundational basis for further property calculations. However, determining equilibrium structures traditionally involves computationally expensive iterative calculations. Here, we develop DeepRelax, an efficient deep generative model designed for rapid structural relaxation without any iterative process. DeepRelax learns the equilibrium structural distribution, enabling it to predict relaxed structures directly from their unrelaxed counterparts. The ability to perform structural relaxation in just a few hundred milliseconds per structure, combined with the scalability of parallel processing, makes DeepRelax particularly useful for large-scale virtual screening. To demonstrate the universality of DeepRelax, we benchmark it against three different databases of X-Mn-O oxides, Materials Project, and Computational 2D Materials Database with various types of materials. In these tests, DeepRelax exhibits both high accuracy and efficiency in structural relaxation, as further validated by DFT calculations. Finally, we integrate DeepRelax with an implementation of uncertainty quantification, enhancing its reliability and trustworthiness in material discovery. This work provides an efficient and trustworthy method to significantly accelerate large-scale computations, offering substantial advancements in the field of computational materials science."}
{"main_page": "https://arxiv.org/abs/2404.00894", "pdf": "https://arxiv.org/pdf/2404.00894", "title": "First-principles study of defects and doping limits in CaO", "authors": "Zhenkun Yuan, Geoffroy Hautier", "subjects": "Materials Science (cond-mat.mtrl-sci)", "abstract": "Calcium oxide (CaO) is a promising host for quantum defects because of its ultrawide band gap and potential for long spin coherence times. Using hybrid functional calculations, we investigate the intrinsic point defects and how they limit Fermi-level positions and doping in CaO. Our results reveal calcium and oxygen vacancies to be the most common intrinsic defects, acting as compensating acceptors and donors, respectively. Oxygen interstitials are also prevailing under O-rich conditions and act as compensating donors. Due to compensation by these defects, O-poor conditions are required to dope CaO n-type, while O-rich conditions are required for p-type doping. We find that, at room temperature, intrinsic CaO can only achieve Fermi-level positions between 1.76 eV above the valence-band maximum (VBM) and 1.73 eV below the conduction-band minimum (CBM). If suitable shallow dopants can be found, the allowed range of Fermi levels would increase to between VBM+0.53 eV and CBM-0.27 eV and is set by the compensating intrinsic defects. Additionally, we study hydrogen impurities, and show that hydrogen will limit p-type doping but can also act as shallow donor when substituting oxygen ($\\mathrm{H}_\\mathrm{O}$ defects)."}
{"main_page": "https://arxiv.org/abs/2404.00917", "pdf": "https://arxiv.org/pdf/2404.00917", "title": "Continuous crossover between insulating ferroelectrics and the polar  metals: \\textit{Ab initio} calculation of structural phase transitions of  Li$B$O$_3$ ($B$ = Ta, W, Re, Os)", "authors": "Ryota Masuki, Takuya Nomoto, Ryotaro Arita, Terumasa Tadano", "subjects": "Materials Science (cond-mat.mtrl-sci)", "abstract": "Inspired by the recent discovery of a new polar metal LiReO$_3$ by K. Murayama, \\textit{et al}, we calculate the temperature($T$)-dependent crystal structures of Li$B$O3 with $B$ = Ta, W, Re, Os, using the self-consistent phonon (SCPH) theory. We have reproduced the experimentally observed polar-nonpolar structural phase transitions and the transition temperatures ($T_c$) of LiTaO$_3$, LiReO$_3$, and LiOsO$_3$. From the calculation, we predict that LiWO$_3$ is a polar metal, which is yet to be tested experimentally. Upon doping electrons to the insulating LiTaO$_3$, the predicted $T_c$ is quickly suppressed and approaches those of the polar metals. Thus, there is a continuous crossover between ferroelectric insulators and polar metals if we dope electrons to the polar metals. Investigating the detailed material dependence of the interatomic force constants (IFCs), we explicitly show that the suppression of $T_c$ in polar metals can be ascribed to the screening of the long-range Li-O interaction, which is caused by the presence of the itinerant electrons."}
{"main_page": "https://arxiv.org/abs/2404.00984", "pdf": "https://arxiv.org/pdf/2404.00984", "title": "Stabilization and high thermoelectric performance of high-entropy-type  cubic AgBi(S, Se, Te)2", "authors": "Asato Seshita, Aichi Yamashita, Takeshi Fujita, Takayoshi Katase, Akira Miura, Yuki Nakahira, Chikako Moriyoshi, Yoshihiro Kuroiwa, Yoshikazu Mizuguchi", "subjects": "Materials Science (cond-mat.mtrl-sci)", "abstract": "As thermoelectric generators can convert waste heat into electricity, they play an important role in energy harvesting. The metal chalcogenide AgBiSe2 is one of the high-performance thermoelectric materials with low lattice thermal conductivity (klat), but it exhibits temperature-dependent crystal structural transitions from hexagonal to rhombohedral, and finally a cubic phase as the temperature rises. The high figure-of-merit ZT is obtained only for the high-temperature cubic phase. In this study, we utilized the high-entropy-alloy (HEA) concept for AgBiSe2 to stabilize the cubic phase throughout the entire temperature range with enhanced thermoelectric performance. We synthesized high-entropy-type AgBiSe2-2xSxTex bulk polycrystals and realized the stabilization of the cubic phase from room temperature to 800 K for x > 0.6. The ultra-low klat at of 0.30 Wm^-1K^-1 and the high peak ZT 0.9 at around 750 K were realized for cubic AgBiSe2-2xSxTex without carrier tuning. In addition, the average ZT value of x = 0.6 and 0.7 for the temperature range of 360-750 K increased to 0.38 and 0.40, respectively, which are comparable to the highest previously reported values."}
{"main_page": "https://arxiv.org/abs/2404.01035", "pdf": "https://arxiv.org/pdf/2404.01035", "title": "MICROSIM: A high performance phase-field solver based on CPU and GPU  implementations", "authors": "Tanmay Dutta, Dasari Mohan, Saurav Shenoy, Nasir Attar, Abhikshek Kalokhe, Ajay Sagar, Swapnil Bhure, Swaroop .S. Pradhan, Jitendriya Praharaj, Subham Mridha, Anshika Kushwaha, Vaishali Shah, M. P. Gururajan, V. Venkatesh Shenoi, Gandham Phanikumar, Saswata Bhattacharyya, Abhik Choudhury", "subjects": "Materials Science (cond-mat.mtrl-sci); Mathematical Physics (math-ph)", "abstract": "The phase-field method has become a useful tool for the simulation of classical metallurgical phase transformations as well as other phenomena related to materials science. The thermodynamic consistency that forms the basis of these formulations lends to its strong predictive capabilities and utility. However, a strong impediment to the usage of the method for typical applied problems of industrial and academic relevance is the significant overhead with regard to the code development and know-how required for quantitative model formulations. In this paper, we report the development of an open-source phase-field software stack that contains generic formulations for the simulation of multi-phase and multi-component phase transformations. The solvers incorporate thermodynamic coupling that allows the realization of simulations with real alloys in scenarios directly relevant to the materials industry. Further, the solvers utilize parallelization strategies using either multiple CPUs or GPUs to provide cross-platform portability and usability on available supercomputing machines. Finally, the solver stack also contains a graphical user interface to gradually introduce the usage of the software. The user interface also provides a collection of post-processing tools that allow the estimation of useful metrics related to microstructural evolution."}
{"main_page": "https://arxiv.org/abs/2404.01128", "pdf": "https://arxiv.org/pdf/2404.01128", "title": "An atomic-scale perspective on individual thiol-terminated molecules  anchored to single S vacancies in MoS$_2$", "authors": "J. Rika Simon, Dmitrii Maksimov, Christian Lotze, Paul Wiechers, Juan Pablo Guerrero Felipe, Björn Kobin, Jutta Schwarz, Stefan Hecht, Katharina J. Franke, Mariana Rossi", "subjects": "Materials Science (cond-mat.mtrl-sci); Chemical Physics (physics.chem-ph); Computational Physics (physics.comp-ph)", "abstract": "Sulphur vacancies in MoS$_2$ on Au(111) have been shown to be negatively charged as reflected by a Kondo resonance. Here, we use scanning tunneling microscopy to show that these vacancies serve as anchoring sites for thiol-based molecules (CF$_3$-3P-SH) with two distinct reaction products, one of them showing a Kondo resonance. Based on comparisons with density-functional theory (DFT) calculations, including a random structure search and computation of energies and electronic properties at a hybrid exchange-correlation functional level, we conclude that both anchored molecules are charge neutral. One of them is an anchored intact CF$_3$-3P-SH molecule while the other one is the result of catalytically activated dehydrogenation to CF$_3$-3P-S with subsequent anchoring. Our investigations highlight a perspective of functionalizing defects with thiol-terminated molecules that can be equipped with additional functional groups, such as charge donor- or acceptor-moieties, switching units or magnetic centers."}
{"main_page": "https://arxiv.org/abs/2404.01214", "pdf": "https://arxiv.org/pdf/2404.01214", "title": "High-temperature domain wall current in Mg-doped lithium niobate single  crystals up to 400°C", "authors": "Uliana Yakhnevych, Marlo Kunzner, Leonard M. Verhoff, Julius Ratzenberger, Elke Beyreuther, Michael Rüsing, Simone Sanna, Lukas M. Eng, Holger Fritze", "subjects": "Materials Science (cond-mat.mtrl-sci)", "abstract": "Conductive ferroelectric domain walls (DWs) represent a promising topical system for the development of nanoelectronic components and devices. DWs may show very different properties as compared to their bulk counterparts. Of central interest here is the domain wall current (DWC) of charged DWs in 5mol% Mg-doped lithium niobate single crystals; in contrast to former works, we extend the DWC study here to temperatures as high as 400{\\deg}C. Both the temporal stability and the thermal activation energies of 100 - 160 meV are readily deduced from current-voltage sweeps as recorded over multiple heating cycles. Our experimental work is backed up by atomistic modelling of the DWC. The latter suggests that a large band bending renders head-to-head (H2H) and tail-to-tail (T2T) DWs semimetallic. These detailed investigations underline the potential to extending DWC-based nanoelectronic applications even into the so-far unexplored high-temperature regime."}
