{"main_page": "https://arxiv.org/abs/2404.00100", "pdf": "https://arxiv.org/pdf/2404.00100", "title": "Magnetic properties of the spiral spin liquid and surrounding phases in  the square lattice XY model", "authors": "Matías G. Gonzalez, Anna Fancelli, Han Yan, Johannes Reuther", "subjects": "Strongly Correlated Electrons (cond-mat.str-el); Statistical Mechanics (cond-mat.stat-mech)", "abstract": "Spiral spin liquids possess a subextensively degenerate ground-state manifold, represented by a continuum of energy minima in reciprocal space. Since a small change of the spiral state wavevector requires a global change of the spin configuration in real space, it is a priori unclear how such systems can fluctuate within the degenerate ground state manifold. Only recently it was proposed that momentum vortices are responsible for the liquidity of the spiral phase and that these systems are closely related to an emergent rank-2 U(1) gauge theory [H. Yan and J. Reuther, Phys. Rev. Research 4, 023175 (2022)]. As a consequence of this gauge structure, four-fold pinch-point singularities were found in a generalized spin correlator. In this article, we use classical Monte Carlo and molecular dynamics calculations to embed the previously studied spiral spin liquid into a broader phase diagram of the square lattice XY model. We find a multitude of unusual phases and phase transitions surrounding the spiral spin liquid such as an effective four-state Potts transition into a colinear double-striped phase resulting from the spontaneous breaking of two coupled $\\mathbb{Z}_2$ symmetries. Since this phase is stabilized by entropic effects selecting the momenta away from the spiral manifold, it undergoes a re-entrance phenomenon at low temperatures into a nematic spiral phase. We also observe a region of parameters where the phase transition into the spiral spin liquid does not break any symmetries and where the critical exponents do not match those of standard universality classes. We study the importance of momentum vortices in driving this phase transition and discuss the possibility of a Kosterlitz-Thouless transition of momentum vortices. Finally, we explore the regime where the rank-2 U(1) gauge theory is valid by investigating the four-fold pinch point singularities across the phase diagram"}
{"main_page": "https://arxiv.org/abs/2404.00214", "pdf": "https://arxiv.org/pdf/2404.00214", "title": "Ferromagnetic state with large magnetic moments realized in epitaxially  strained Sr3Ru2O7 films", "authors": "Ren Oshima, Tatsuto Hatanaka, Shinichi Nishihaya, Takuya Nomoto, Markus Kriener, Takahiro C. Fujita, Masashi Kawasaki, Ryotaro Arita, Masaki Uchida", "subjects": "Strongly Correlated Electrons (cond-mat.str-el); Materials Science (cond-mat.mtrl-sci)", "abstract": "Technical advancement of oxide molecular beam epitaxy (MBE) has opened new avenues for studying various quantum transport phenomena in correlated transition-metal oxides, as exemplified by the exotic superconductivity of Sr$_2$RuO$_4$ and quantum oscillations of SrRuO$_3$. On the other hand, film research of another Ruddlesden-Popper strontium ruthenate Sr$_3$Ru$_2$O$_7$ which exhibits a unique quantum phase related to metamagnetism in bulk systems did not progress well. Here we report the fabrication of high-quality Sr$_3$Ru$_2$O$_7$ thin films by oxide MBE and the observation of a strain-induced ferromagnetic ground state. The change in magnetic exchange coupling evaluated by first-principles calculations indicates a systematic relation between the compression of the $c$-axis length and induced ferromagnetism. Giant epitaxial strain in high-quality films will be a key to a comprehensive understanding of the magnetism in Ruddlesden-Popper strontium ruthenates Sr$_{n+1}$Ru$_n$O$_{3n+1}$, which sensitively depends on the ratio of in-plane to out-of-plane Ru-Ru distances."}
{"main_page": "https://arxiv.org/abs/2404.00575", "pdf": "https://arxiv.org/pdf/2404.00575", "title": "Long-Range Nanoelectromechanical Coupling at the LaAlO$_3$/SrTiO$_3$  Interface", "authors": "Aditi Nethwewala (1,2), Kitae Eom (3), Muqing Yu (1,2), Ranjani Ramachandran (1,2), Chang-Beom Eom (3), Patrick Irvin (1,2), Jeremy Levy (1,2) ((1) Department of Physics and Astronomy, University of Pittsburgh, Pittsburgh, PA, USA, (2) Pittsburgh Quantum Institute, Pittsburgh, PA, USA. (3) Department of Materials Science and Engineering, University of Wisconsin-Madison, Madison, WI, USA)", "subjects": "Strongly Correlated Electrons (cond-mat.str-el); Mesoscale and Nanoscale Physics (cond-mat.mes-hall); Materials Science (cond-mat.mtrl-sci)", "abstract": "The LaAlO$_3$/SrTiO$_3$ interface hosts a plethora of gate-tunable electronic phases. Gating of LaAlO$_3$/SrTiO$_3$ interfaces are usually assumed to occur electrostatically. However, increasing evidence suggests that non-local interactions can influence and, in some cases, dominate the coupling between applied gate voltages and electronic properties. Here, we sketch quasi-1D ballistic electron waveguides at the LaAlO$_3$/SrTiO$_3$ interface as a probe to understand how gate tunability varies as a function of spatial separation. Gate tunability measurements reveal the scaling law to be at odds with the pure electrostatic coupling observed in traditional semiconductor systems. The non-Coulombic gating at the interface is attributed to the existence of a long-range nanoelectromechanical coupling between the gate and electron waveguide, mediated by the ferroelastic domains in SrTiO$_3$. The long-range interactions at the LaAlO$_3$/SrTiO$_3$ interface add unexpected richness and complexity to this correlated electron system."}
{"main_page": "https://arxiv.org/abs/2404.00706", "pdf": "https://arxiv.org/pdf/2404.00706", "title": "Chiral spin textures driven by emergent spin-orbit interaction: a  numerical study", "authors": "Shuai Yang, Zhiyu Dong, Yan Chen", "subjects": "Strongly Correlated Electrons (cond-mat.str-el); Mesoscale and Nanoscale Physics (cond-mat.mes-hall); Materials Science (cond-mat.mtrl-sci)", "abstract": "We explore numerically the intricate interplay between Berry phases in both real and momentum spaces within itinerant magnets. This interplay manifests as an emergent spin-orbit coupling, where charge carriers occupying a Berry-curved band generate an orbital magnetization, inducing a pseudo-magnetic field originating in chiral spin textures. Using density-matrix-renormalization-group techniques, we demonstrate that switching on a band Berry curvature in a metallic ferromagnetic phase results in chiral magnetic textures. Furthermore, employing a two-leg strip geometry, we establish a connection between charge and spin chirality, further supporting this emergent spin-orbit interaction."}
{"main_page": "https://arxiv.org/abs/2404.00823", "pdf": "https://arxiv.org/pdf/2404.00823", "title": "Octupolar edge state in an $e_g$ orbital system on a square lattice", "authors": "Katsunori Kubo", "subjects": "Strongly Correlated Electrons (cond-mat.str-el)", "abstract": "A tight-binding model for $e_g$ orbitals on a square lattice is investigated. We consider only the nearest-neighbor hopping and the model is characterized by two hopping parameters, $t_1$ and $t_2$. There are Dirac points in the electronic band structure and the type of the Dirac points (type-I or type-II) depends on the ratio $t_2/t_1$. For the case of the type-I Dirac points, edge states appear for a lattice with edges perpendicular to the $[11]$ direction. The edge states at a certain momentum along the edges have octupole moments with opposite signs between the right and left edges. Thus, these edge states can be called helical octupolar edge states. This study bridges the research fields of topological phenomena and multipole physics."}
{"main_page": "https://arxiv.org/abs/2404.00996", "pdf": "https://arxiv.org/pdf/2404.00996", "title": "Charge density wave without long-range structural modulation in canted  antiferromagnetic kagome FeGe", "authors": "Chenfei Shi, Hanbin Deng, Surya Rohith Kotla, Yi Liu, Sitaram Ramakrishnan, Claudio Eisele, Harshit Agarwal, Leila Noohinejad, Ji-Yong Liu, Tianyu Yang, Guowei Liu, Bishal Baran Maity, Qi Wang, Zhaodi Lin, Baojuan Kang, Wanting Yang, Yongchang Li, Zhihua Yang, Yuke Li, Yanpeng Qi, Arumugam Thamizhavel, Wei Ren, Guang-Han Cao, Jia-Xin Yin, Sander van Smaalen, Shixun Cao, Jin-Ke Bao", "subjects": "Strongly Correlated Electrons (cond-mat.str-el); Materials Science (cond-mat.mtrl-sci)", "abstract": "Strongly correlated electron systems with a kagome lattice can host abundant exotic quantum states such as superconductivity and spin/charge density waves (CDW) due to the complicated interactions between different degrees of freedoms in the framework of a unique two-dimensional geometrically frustrated lattice structure. Recently, successive orders of A-type antiferromagnetism (AFM), $2\\times2\\times2$ CDW and canted double-cone AFM have been manifested upon cooling in magnetic kagome FeGe. However, the mechanism of the CDW order and its interaction with magnetism are presently enigmatic at best. Here we investigate the evolution of CDW order with temperature across the spin canting transition in FeGe by single-crystal x-ray diffraction. Refinements of its modulated structure are presented using the superspace approach. Interestingly, the superlattice reflections originating from CDW-induced long-range structural modulation become extremely weak after the system enters the canted AFM while a $2\\times2$ CDW in the $ab$ plane persists as a long-range order demonstrated by strong electronic modulation in the d$I$/d$V$ map of scanning tunneling spectroscopy. We discovered a novel CDW order without long-range structural modulation in FeGe probably because of the competition between CDW and canted AFM in determining the underlying crystal structure. In addition, occupational modulations of Ge1 atoms located in the kagome plane and displacive modulations of all the atoms were extracted from the refinements, confirming the existence of Ge atom dimerization along the $c$ axis as the major distortion and indicating a dynamic transformation between different CDW domains."}
