{"main_page": "https://arxiv.org/abs/2404.00273", "pdf": "https://arxiv.org/pdf/2404.00273", "title": "NMR of a single nuclear spin detected by a scanning tunneling microscope", "authors": "Yishay Manassen, Michael Averbukh, Zion Hazan, Yahel Tzuriel, Pino Boscolo, Alexsander Shnirman, Baruch Horovitz", "subjects": "Mesoscale and Nanoscale Physics (cond-mat.mes-hall)", "abstract": "We demonstrate ionization of a molecule with the bias voltage of a Scanning Tunnelling Microscope (STM) resulting in a coexistence of a neutral and ionic molecules, i.e. radical (paramagnetic) and non-radical (diamagnetic) states. This coexistence may be facilitated by a periodic switching between two bias voltages. The precession of the nucleus in the diamagnetic state modulates the nuclear polarization as well as the hyperfine transitions as seen in electron spin resonance (ESR). We analyze the power spectrum of a selected hyperfine intensity and obtain the nuclear magnetic resonance (NMR) spectrum. We have observed this phenomenon in three types of molecules: TEMPO, toluene and triphenylphosphine, showing NMR of $^{14}$N, $^{13}$C, $^{31}$P and $^1$H nuclei. The spectra are detailed and show signatures of the chemical environment, i.e. chemical shifts. A master equation including off-diagonal hyperfine interactions accounts for these observations."}
{"main_page": "https://arxiv.org/abs/2404.00375", "pdf": "https://arxiv.org/pdf/2404.00375", "title": "Dynamic Viscosity of the ABC-stacked Multilayer Graphene in the  Collisionless Regime", "authors": "Weiwei Chen, Yedi Shen, Tianle Zhan, W. Zhu", "subjects": "Mesoscale and Nanoscale Physics (cond-mat.mes-hall); Materials Science (cond-mat.mtrl-sci)", "abstract": "We explore the dynamic shear viscosity of the undoped ABC-stacked multilayer graphene based on the chiral-$N$ effective Hamiltonian, where the chirality $N$ is equivalent to the layer number. We investigate the dependence of the dynamic shear viscosity on the frequency in the collisionless regime and calculate Coulomb interaction corrections by three leading order Feynman diagrams: self-energy diagram, vertex diagram, and honey diagram. We propose that the dynamic shear viscosity is generated by the relaxation of momentum flux polarization through electron-hole excitations, and that the interaction can amplify this effect. Furthermore, our research indicates that the dynamic shear viscosity exhibits a robust linear positive dependence on $N$. This finding suggests that by making modifications to the number of layers in graphene, it is possible to finely tune the electron viscous effects."}
{"main_page": "https://arxiv.org/abs/2404.00519", "pdf": "https://arxiv.org/pdf/2404.00519", "title": "Electron Collimation in Twisted Bilayer Graphene via Gate-defined  Moiré Barriers", "authors": "Wei Ren, Xi Zhang, Ziyan Zhu, Moosa Khan, Kenji Watanabe, Takashi Taniguchi, Efthimios Kaxiras, Mitchell Luskin, Ke Wang", "subjects": "Mesoscale and Nanoscale Physics (cond-mat.mes-hall)", "abstract": "Electron collimation via a graphene pn-junction allows electrostatic control of ballistic electron trajectories akin to that of an optical circuit. Similar manipulation of novel correlated electronic phases in twisted-bilayer graphene (tBLG) can provide additional probes to the underlying physics and device components towards advanced quantum electronics. In this work, we demonstrate collimation of the electron flow via gate-defined moir\\'e barriers in a tBLG device, utilizing the band-insulator gap of the moir\\'e superlattice. A single junction can be tuned to host a chosen combination of conventional pseudo barrier and moir\\'e tunnel barriers, from which we demonstrate improved collimation efficiency. By measuring transport through two consecutive moir\\'e collimators separated by 1 um, we demonstrate evidence of electron collimation in tBLG in the presence of realistic twist-angle inhomogeneity."}
{"main_page": "https://arxiv.org/abs/2404.00692", "pdf": "https://arxiv.org/pdf/2404.00692", "title": "Spontaneous charge-ordered state in Bernal-stacked bilayer graphene", "authors": "Xiu-Cai Jiang, Ze-Yi Song, Ze Ruan, Yu-Zhong Zhang", "subjects": "Mesoscale and Nanoscale Physics (cond-mat.mes-hall); Materials Science (cond-mat.mtrl-sci); Strongly Correlated Electrons (cond-mat.str-el)", "abstract": "We propose that a weakly spontaneous charge-ordered insulating state probably exists in Bernal-stacked bilayer graphene which can account for experimentally observed non-monotonic behavior of resistance as a function of the gated field, namely, the gap closes and reopens at a critical gated field. The underlying physics is demonstrated by a simple model on a corresponding lattice that contains the nearest intralayer and interlayer hoppings, electric field, and staggered potential between different sublattices. Combining density functional theory calculations with model analyses, we argue that the interlayer van der Waals interactions cooperating with ripples may be responsible for the staggered potential which induces a charge-ordered insulating state in the absence of the electric field."}
{"main_page": "https://arxiv.org/abs/2404.00695", "pdf": "https://arxiv.org/pdf/2404.00695", "title": "Hidden-Rashba-driven Absence of Odd-integer Quantized States in an Oxide  Quantum Hall System", "authors": "Jingyue Wang, Junwei Huang, Daniel Kaplan, Xuehan Zhou, Congwei Tan, Jing Zhang, Gangjian Jin, Xuzhong Cong, Yongchao Zhu, Xiaoyin Gao, Yan Liang, Huakun Zuo, Zengwei Zhu, Ruixue Zhu, Ady Stern, Hongtao Liu, Peng Gao, Binghai Yan, Hongtao Yuan, Hailin Peng", "subjects": "Mesoscale and Nanoscale Physics (cond-mat.mes-hall); Materials Science (cond-mat.mtrl-sci)", "abstract": "The discovery of the quantum Hall effect in 1980, a turning point in condensed matter physics, has inspired exploring emergent quantized states regarding novel electron states, band topologies and spin textures. Owing to the lifted degeneracies universally-existing, most quantum Hall systems host both even- and odd-integer quantum Hall plateaus simultaneously. Selective control of these quantized states is of great significance to understand the exotic ground states and manipulate the spin textures in quantum Hall systems; however, it remains challenging. Here we demonstrate the absence of odd-integer state in inversion-symmetric Bi2O2Se quantum Hall system driven by the unique hidden Rashba effect. Pronounced quantum oscillations and only even-integer quantized plateaus were observed in the few-layer Bi2O2Se films epitaxially grown on SrTiO3. However, after reducing the thickness of epitaxial Bi2O2Se film to one unit cell limit with giant Rashba parameter of 440 meV.A, both odd- and even-integer states can show up simultaneously in this 2D Janus film. Theoretical calculations revealed that such absence of odd-integer states, i.e., a suppressed Zeeman splitting, stems from a unique hidden Rashba effect in the inversion-symmetric Bi2O2Se. However, this hidden Rashba effect can be further broken down due to tunable inversion-symmetry breaking. Our work highlights the extraordinary controllability of quantized states at the atomic level and further provides an unprecedented path to explore and handle novel spin textures and ground states."}
{"main_page": "https://arxiv.org/abs/2404.00818", "pdf": "https://arxiv.org/pdf/2404.00818", "title": "Nonreciprocal superfluidlike topological spin transport", "authors": "Alexey A. Kovalev, Bo Li, Edward Schwartz", "subjects": "Mesoscale and Nanoscale Physics (cond-mat.mes-hall); Strongly Correlated Electrons (cond-mat.str-el)", "abstract": "We study superfluidlike spin transport facilitated by thermal diffusion of magnetic domain walls, where the positive and negative chiralities of domain walls act as opposite topological charges. The topological charge conservation leads to algebraic decay of the topological current, allowing for the transport of spin over extended distances. We demonstrate that the presence of the Dzyaloshinskii-Moriya interaction can lead to nonreciprocity in topological flow. In one scenario, the nonreciprocity arises due to diode-like behavior where the nucleation of domain walls is governed by thermal activation for one direction of spin current and by viscous injection for the other direction of spin current. We confirm our predictions by micromagnetic simulations of domain walls in TmIG nanowire."}
{"main_page": "https://arxiv.org/abs/2404.01027", "pdf": "https://arxiv.org/pdf/2404.01027", "title": "Easy-to-configure zero-dimensional valley-chiral modes in a graphene  point junction", "authors": "Konstantin Davydov, Xi Zhang, Wei Ren, Matthew Coles, Logan Kline, Bryan Zucker, Kenji Watanabe, Takashi Taniguchi, Ke Wang", "subjects": "Mesoscale and Nanoscale Physics (cond-mat.mes-hall)", "abstract": "The valley degree of freedom in 2D materials can be manipulated for low-dissipation quantum electronics called valleytronics. At the boundary between two regions of bilayer graphene with different atomic or electrostatic configuration, valley-polarized current has been realized. However, the demanding fabrication and operation requirements limit device reproducibility and scalability toward more advanced valleytronics circuits. We demonstrate a new device architecture of a point junction where a valley-chiral 0D PN junction is easily configured, switchable, and capable of carrying valley current with an estimated polarization of ~80%. This work provides a new building block in manipulating valley quantum numbers and scalable valleytronics."}
{"main_page": "https://arxiv.org/abs/2404.01061", "pdf": "https://arxiv.org/pdf/2404.01061", "title": "Wiedemann-Franz law violation domain for graphene and nonrelativistic  systems", "authors": "Thandar Zaw Win, Cho Win Aung, Gaurav Khandal, Sabyasachi Ghosh", "subjects": "Mesoscale and Nanoscale Physics (cond-mat.mes-hall); Statistical Mechanics (cond-mat.stat-mech)", "abstract": "Systematic and comparative research on Lorenz ratios for graphene and nonrelativistic systems has been studied to identify their Wiedemann-Franz law violation domain. Fermi energy and temperature are the main governing parameters for deciding the values of the Lorenz ratio, which is basically thermal conductivity divided by electrical conductivity times temperature times Lorenz number. Metals as three-dimensional nonrelativistic electron gas locate at higher Fermi-energy by temperature domain, where Lorenz ratio remains one. Hence, they obey the Wiedemann-Franz law. By creating higher doping in a two-dimensional graphene system, one can again reach a higher Fermi-energy by temperature domain and get a constant Lorenz ratio. For both graphene and non-relativistic systems, the Lorenz ratio goes below one if we go lower Fermi-energy by temperature domain, which is possible for the graphene system by decreasing the doping concentration. Experimentally observed greater than one Lorenz ratio in this lower Fermi-energy by temperature domain or Dirac Fluid domain indicates that non-fluid expressions of Lorenz ratio should be replaced by fluid-type expressions. We have noticed a divergent trend of Lorenz ratio in the Dirac Fluid domain using its fluid-type expression, and it matches with the trend of experimental data."}
{"main_page": "https://arxiv.org/abs/2404.01097", "pdf": "https://arxiv.org/pdf/2404.01097", "title": "Topological phases and edge modes of an uneven ladder", "authors": "Wen-Chuang Shang, Yi-Ning Han, Shimpei Endo, Chao Gao", "subjects": "Mesoscale and Nanoscale Physics (cond-mat.mes-hall); Quantum Gases (cond-mat.quant-gas); Quantum Physics (quant-ph)", "abstract": "We investigate the topological properties of a two-chain quantum ladder with uneven legs, i.e. the two chains differ in their periods by a factor of two. Such an uneven ladder presents rich band structures classified by the closure of either direct or indirect bandgaps. It also provides opportunities to explore fundamental concepts concerning band topology and edge modes, including the difference of intracellular and intercellular Zak phases, and the role of the inversion symmetry (IS). We calculate the Zak phases of the two kinds and find excellent agreement with the dipole moment and extra charge accumulation, respectively. We also find that configurations with IS feature a pair of degenerate two-side edge modes emerging as the closure of the direct bandgap, while configurations without IS feature one-side edge modes emerging as not only the closure of both direct and indirect bandgap but also within the band continuum. Furthermore, by projecting to the two sublattices, we find that the effective Bloch Hamiltonian corresponds to that of a generalized Su-Schrieffer-Heeger model or Rice-Mele model whose hopping amplitudes depend on the quasimomentum. In this way, the topological phases can be efficiently extracted through winding numbers. We propose that uneven ladders can be realized by spin-dependent optical lattices and their rich topological characteristics can be examined by near future experiments."}
{"main_page": "https://arxiv.org/abs/2404.01146", "pdf": "https://arxiv.org/pdf/2404.01146", "title": "Dielectric Screening Inside Carbon Nanotubes", "authors": "Georgy Gordeev, Sören Wasserroth, Han Li, Ado Jorio, Benjamin S. Flavel, Stephanie Reich", "subjects": "Mesoscale and Nanoscale Physics (cond-mat.mes-hall)", "abstract": "Dielectric screening plays a vital role for the physical properties in the nanoscale and also alters our ability to detect and characterize nanomaterials by optical techniques. We study the dielectric screening inside of carbon nanotubes and how it changes electromagnetic fields and many-body effects for encapsulated nanostructures. First, we show that the local electric field inside a nanotube is altered by one-dimensional screening with dramatic effects on the effective Raman scattering efficiency of the encapsulated species for metallic walls. The scattering intensity of the inner tube is two orders of magnitude weaker than for the tube in air, which is nicely reproduced by local field calculations. Secondly, we find that the optical transition energies of the inner nanotubes shift to lower energies compared to a single-walled carbon nanotubes of the same chirality. The shift is higher if the outer tube is metallic than when it is semiconducting. The magnitude of the shift suggests that the excitons of small diameter inner metallic tubes are thermally dissociated at room temperate if the outer tube is also metallic and in essence we observe band-to-band transitions."}
