{"main_page": "https://arxiv.org/abs/2404.00120", "pdf": "https://arxiv.org/pdf/2404.00120", "title": "Dynamics of nano-scale assemblies of amphiphilic PEG-PDMS-PEG copolymers", "authors": "Sudipta Gupta, Rasangi M. Perera, Christopher J. Van Leeuwen, Tianyu Li, Laura Stingaciu, Markus Bleuel, Kunlun Hong, Gerald J. Schneider", "subjects": "Soft Condensed Matter (cond-mat.soft)", "abstract": "Micelles and vesicles are promising candidates in targeted drug/gene delivery, bioreactors, and templates for nanoparticle synthesis. We investigated the morphology and dynamics of PEG-PDMS-PEG triblock copolymer nano-scale assemblies regarding the membrane dynamics because the molecular dynamics of the membrane govern mechanical properties like the stability of a membrane. We studied the structure by cryogenic transmission electron microscopy, small-angle neutron scattering, and the dynamics by dynamic light scattering and neutron spin echo spectroscopy. We changed the length of the hydrophilic block to obtain micellar and vesicular systems. The vesicle has a membrane rigidity, $\\kappa_\\eta = 16 \\pm 2 k_B T$, the same order of magnitude as the corresponding liposome value but one order of magnitude higher than polymeric interfaces in microemulsions. Hence, the height-height fluctuations of polymers in a polymersome seem much less than those measured for surfactants at an oil-water interface. Therefore, the polymersome is substantially more stable. The value is very close to liposomes, indicating a similar stability."}
{"main_page": "https://arxiv.org/abs/2404.00160", "pdf": "https://arxiv.org/pdf/2404.00160", "title": "Flow dichroism of DNA can be quantitatively predicted via coarse-grained  molecular simulations", "authors": "Isaac Pincus, Alison Rodger, J. Ravi Prakash", "subjects": "Soft Condensed Matter (cond-mat.soft); Statistical Mechanics (cond-mat.stat-mech)", "abstract": "We demonstrate the use of multiscale polymer modelling to quantitatively predict DNA linear dichroism (LD) in shear flow. LD is the difference in absorption of light polarised along two perpendicular axes, and has long been applied to study biopolymer structure and drug-biopolymer interactions. As LD is orientation-dependent, the sample must be aligned in order to measure a signal. Shear flow via a Couette cell can generate the required orientation, however it is challenging to separate the LD due to changes in polymer conformation from specific interactions, e.g. drug-biopolymer. In this study, we have applied a combination of Brownian dynamics and equilibrium Monte Carlo simulations to accurately predict polymer alignment, and hence flow LD, at modest computational cost. As the optical and conformational contributions to the LD can be explicitly separated, our findings allow for enhanced quantitative interpretation of LD spectra through the use of an in-silico model to capture conformational changes. Our model requires no fitting and only five input parameters, the DNA contour length, persistence length, optical factor, solvent quality, and relaxation time, all of which have been well characterized in prior literature. The method is sufficiently general to apply to a wide range of biopolymers beyond DNA, and our findings could help guide the search for new pharmaceutical drug targets via flow LD."}
{"main_page": "https://arxiv.org/abs/2404.01020", "pdf": "https://arxiv.org/pdf/2404.01020", "title": "Reversible-to-irreversible transition of colloidal polycrystals under  cyclic athermal quasistatic deformation", "authors": "Khushika, Lasse Laurson, Pritam Kumar Jana", "subjects": "Soft Condensed Matter (cond-mat.soft); Materials Science (cond-mat.mtrl-sci)", "abstract": "Cyclic loading on granular packings and amorphous media exhibits a transition from reversible elastic behavior to irreversible plasticity. The present study compares the irreversibility transition and microscopic details of colloidal polycrystals under oscillatory tensile-compressive and shear strain. Under both modes, the systems exhibit a reversible to irreversible transition. However, the strain amplitude at which the transition is observed is larger in the shear strain than in the tensile-compressive mode. The threshold strain amplitude is confirmed by analyzing the dynamical properties, such as mobility and atomic strain (von-Mises shear strain and the volumetric strain). The structural changes are quantified using a hexatic order parameter. Under both modes of deformation, dislocations and grain boundaries in polycrystals disappear, and monocrystals are formed. We also recognize the dislocation motion through grains. The key difference is that strain accumulates diagonally in oscillatory tensile-compressive deformation, whereas, in shear deformation, strain accumulation is along the $x$ or $y$ axis."}
