{"main_page": "https://arxiv.org/abs/2404.00719", "pdf": "https://arxiv.org/pdf/2404.00719", "title": "Revealing Symmetry-broken Superconducting Configurations by Density  Functional Theory", "authors": "Zi-Kui Liu, Shun-Li Shang", "subjects": "Superconductivity (cond-mat.supr-con); Computational Physics (physics.comp-ph); Quantum Physics (quant-ph)", "abstract": "A coherent theory for both conventional and unconventional superconductors is currently lacking. Here we show that the electron charge densities of Al, YBa2Cu3O7 (YBCO), and LaH10 along with Pb and Nb3Sn share the same feature of electron charge gains in their respective superconducting configurations (SCCs) predicted by first-principles calculations based on the density functional theory (DFT). It is discovered that the formation of SCCs is due to the local symmetry breaking from their normal conducting configurations (NCCs), and the electron charge gains in SCCs form electron tunnels in crystals that resemble pontoons, thus termed as electron pontoon tunnel (EPT) here. The nuclei promoting the formation of EPTs in conventional superconductors have strong bonding with other nuclei, resulting in their EPTs easily destroyed and thus low superconducting critical temperature (Tc), while in unconventional superconductor, this bonding is very weak as shown by negative stretching force constants in YBCO, thus resulting in much higher Tc. The fundamental understanding of SCCs and the capability to predict them by DFT enable theoretical search of room temperature superconductors without empirical models."}
{"main_page": "https://arxiv.org/abs/2404.00963", "pdf": "https://arxiv.org/pdf/2404.00963", "title": "Inversion and Tunability of Van Hove Singularities in $A$V$_{3}$Sb$_{5}$  ($A$ = K, Rb, and Cs) kagome metals", "authors": "Sangjun Sim, Min Yong Jeong, Hyunggeun Lee, Dong Hyun David Lee, Myung Joon Han", "subjects": "Superconductivity (cond-mat.supr-con); Strongly Correlated Electrons (cond-mat.str-el)", "abstract": "To understand the alkali-metal-dependent material properties of recently discovered $A$V$_{3}$Sb$_{5}$ ($A$ = K, Rb, and Cs), we conducted a detailed electronic structure analysis based on first-principles density functional theory calculations. Contrary to the case of $A$ = K and Rb, the energetic positions of the low-lying Van Hove singularities are reversed in CsV$_{3}$Sb$_{5}$, and the characteristic higher-order Van Hove point gets closer to the Fermi level. We found that this notable difference can be attributed to the chemical effect, apart from structural differences. Due to their different orbital compositions, Van Hove points show qualitatively different responses to the structure changes. A previously unnoticed highest lying point can be lowered, locating close to or even below the other ones in response to a reasonable range of bi- and uni-axial strain. Our results can be useful in better understanding the material-dependent features reported in this family and in realizing experimental control of exotic quantum phases."}
{"main_page": "https://arxiv.org/abs/2404.01117", "pdf": "https://arxiv.org/pdf/2404.01117", "title": "Variational approach for the two-body problem in a multiband  extended-Hubbard model", "authors": "M. Iskin", "subjects": "Superconductivity (cond-mat.supr-con); Strongly Correlated Electrons (cond-mat.str-el)", "abstract": "Considering a spin-up and a spin-down fermion in a generic tight-binding lattice with a multi-site basis, here we study the two-body problem using a multiband extended-Hubbard model with arbitrary but finite-ranged hopping and interaction parameters. We derive a linear eigenvalue problem for the entire two-body spectrum, alongside a nonlinear eigenvalue problem for the bound states in the form of a self-consistency equation. Our results are based on an exact variational approach and their versatility offers practical applications in a broad range of lattice geometries. As an illustration, we apply them to the linear-chain model and demonstrate that the resultant spin singlet and triplet bound states are in perfect agreement with the existing literature."}
