{"main_page": "https://arxiv.org/abs/2404.00367", "pdf": "https://arxiv.org/pdf/2404.00367", "title": "SA-LSPL:Sequence-Aware Long- and Short- Term Preference Learning for  next POI recommendation", "authors": "Bin Wang, Yan Zhang, Yan Ma, Yaohui Jin, Yanyan Xu", "subjects": "Computers and Society (cs.CY)", "abstract": "The next Point of Interest (POI) recommendation aims to recommend the next POI for users at a specific time. As users' check-in records can be viewed as a long sequence, methods based on Recurrent Neural Networks (RNNs) have recently shown good applicability to this task. However, existing methods often struggle to fully explore the spatio-temporal correlations and dependencies at the sequence level, and don't take full consideration for various factors influencing users' preferences. To address these issues, we propose a novel approach called Sequence-Aware Long- and Short-Term Preference Learning (SA-LSPL) for next-POI recommendation. We combine various information features to effectively model users' long-term preferences. Specifically, our proposed model uses a multi-modal embedding module to embed diverse check-in details, taking into account both user's personalized preferences and social influences comprehensively. Additionally, we consider explicit spatio-temporal correlations at the sequence level and implicit sequence dependencies. Furthermore, SA-LSPL learns the spatio-temporal correlations of consecutive and non-consecutive visits in the current check-in sequence, as well as transition dependencies between categories, providing a comprehensive capture of user's short-term preferences. Extensive experiments on two real-world datasets demonstrate the superiority of SA-LSPL over state-of-the-art baseline methods."}
{"main_page": "https://arxiv.org/abs/2404.00600", "pdf": "https://arxiv.org/pdf/2404.00600", "title": "AI Act and Large Language Models (LLMs): When critical issues and  privacy impact require human and ethical oversight", "authors": "Nicola Fabiano", "subjects": "Computers and Society (cs.CY); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)", "abstract": "The imposing evolution of artificial intelligence systems and, specifically, of Large Language Models (LLM) makes it necessary to carry out assessments of their level of risk and the impact they may have in the area of privacy, personal data protection and at an ethical level, especially on the weakest and most vulnerable. This contribution addresses human oversight, ethical oversight, and privacy impact assessment."}
{"main_page": "https://arxiv.org/abs/2404.00728", "pdf": "https://arxiv.org/pdf/2404.00728", "title": "Investigating Youths' Everyday Understanding of Machine Learning  Applications: a Knowledge-in-Pieces Perspective", "authors": "Luis Morales-Navarro, Yasmin B. Kafai", "subjects": "Computers and Society (cs.CY)", "abstract": "Despite recent calls for including artificial intelligence (AI) literacy in K-12 education, not enough attention has been paid to studying youths' everyday knowledge about machine learning (ML). Most research has examined how youths attribute intelligence to AI/ML systems. Other studies have centered on youths' theories and hypotheses about ML highlighting their misconceptions and how these may hinder learning. However, research on conceptual change shows that youths may not have coherent theories about scientific phenomena and instead have knowledge pieces that can be productive for formal learning. We investigate teens' everyday understanding of ML through a knowledge-in-pieces perspective. Our analyses reveal that youths showed some understanding that ML applications learn from training data and that applications recognize patterns in input data and depending on these provide different outputs. We discuss how these findings expand our knowledge base and implications for the design of tools and activities to introduce youths to ML."}
