{"main_page": "https://arxiv.org/abs/2404.00395", "pdf": "https://arxiv.org/pdf/2404.00395", "title": "A First Ontological Model for the Description of the Art Market in the  Semantic Web", "authors": "Manuele Veggi", "subjects": "Digital Libraries (cs.DL)", "abstract": "This dissertation presents the first version of a project at the Fondazione Federico Zeri, aimed at modelling the art market starting from the recognition of the peculiarities of this sector and relying on the data collected by this institute during its research activities on its documentary collection. Specifically, this study describes the development of an ontology, able to describe agents, events and sources which define the art market and enable its investigation. The recognition of existing conceptual models is hence followed by the description of the adopted methodology, based on the protocol SAMOD. The central section provides a general overview of the final ontology, integrating the results of a preliminary study. Lastly, the appendix lists motivating scenarios, examples and competency questions collected during the first SAMOD iterations, as well as a first alignment with existing models."}
{"main_page": "https://arxiv.org/abs/2404.00478", "pdf": "https://arxiv.org/pdf/2404.00478", "title": "Forensic Scientometrics -- An emerging discipline to protect the  scholarly record", "authors": "Leslie D. McIntosh, Cynthia Hudson Vitale", "subjects": "Digital Libraries (cs.DL)", "abstract": "Forensic Scientometrics (FoSci) is emerging as a vital discipline at the intersection of scientific integrity and security. Scholarship and scholarly communication are critical for maintaining scientific integrity, influencing public trust in science, health, technology, policy, and law. Yet, these foundations are threatened by the misuse of scientific research for personal, commercial, ideological, and geopolitical gains, including questionable practices and misconduct. The rise of paper mills and predatory publishers, along with ideological and geopolitical motivations, undermines academic integrity. This field pioneers the integration of traditional scientometric methods with ethics to address pressing challenges in research integrity and security, crucial in an era of heightened scrutiny over science's reliability. FoSci's development signifies a collective commitment to maintaining scientific trust, marked by a call for official recognition and support from stakeholders across the scientific ecosystem."}
{"main_page": "https://arxiv.org/abs/2404.01072", "pdf": "https://arxiv.org/pdf/2404.01072", "title": "How biomedical papers accumulated their clinical citations: A  large-scale retrospective analysis based on PubMed", "authors": "Xin Li, Xuli Tang, Wei Lu", "subjects": "Digital Libraries (cs.DL)", "abstract": "This paper explored the temporal characteristics of clinical citations of biomedical papers, including how long it takes to receive its first clinical citation (the initial stage) and how long it takes to receive two or more clinical citations after its first clinical citation (the build-up stage). Over 23 million biomedical papers in PubMed between 1940 and 2013 and their clinical citations are used as the research data. We divide these biomedical papers into three groups and four categories from clinical citation level and translational science perspectives. We compare the temporal characteristics of biomedical papers of different groups or categories. From the perspective of clinical citation level, the results show that highly clinically cited papers had obvious advantages of receiving clinical citations over medium and lowly clinically cited papers in both the initial and build-up stages. Meanwhile, as the number of clinical citations increased in the build-up stage, the difference in the length of time to receive the corresponding number of clinical citations among the three groups of biomedical papers significantly increased. From the perspective of translational science, the results reveal that biomedical papers closer to clinical science more easily receive clinical citations than papers closer to basic science in both the initial and build-up stages. Moreover, we found that highly clinically cited papers had the desperate advantage of receiving clinical citations over even the clinical guidelines or clinical trials. The robustness analysis of the two aspects demonstrates the reliability of our results."}
