{"main_page": "https://arxiv.org/abs/2404.00084", "pdf": "https://arxiv.org/pdf/2404.00084", "title": "KKL theorem for the influence of a set of variables", "authors": "Tomasz Przybyłowski", "subjects": "Combinatorics (math.CO); Discrete Mathematics (cs.DM); Probability (math.PR)", "abstract": "We study the notion of the influence of a set of variables on a Boolean function, which was recently introduced by Tal. We show that for an arbitrary fixed $d$, every Boolean function $f$ on $n$ variables admits a $d$-set of influence at least $\\frac{1}{10} \\mathbf{W}^{\\geq d}(f) (\\frac{\\log n}{n})^d$, which is a direct generalisation of the Kahn-Kalai-Linial theorem. We give an example demonstrating essential sharpness of this result. Further, we generalise a related theorem of Oleszkiewicz regarding influences of pairs of variables."}
{"main_page": "https://arxiv.org/abs/2404.00416", "pdf": "https://arxiv.org/pdf/2404.00416", "title": "Circular-arc graphs and the Helly property", "authors": "Jan Derbisz, Tomasz Krawczyk", "subjects": "Data Structures and Algorithms (cs.DS); Discrete Mathematics (cs.DM)", "abstract": "In this paper we investigate some problems related to the Helly properties of circular-arc graphs, which are defined as intersection graphs of arcs of a fixed circle. As such, circular-arc graphs are among the simplest classes of intersection graphs whose models might not satisfy the Helly property. In particular, some cliques of a circular-arc graph might be Helly in some but not all arc intersection models of the graph. Our first result is an alternative proof of a theorem by Lin and Szwarcfiter which asserts that for every circular-arc graph $G$ either every normalized model of $G$ satisfies the Helly property or no normalized model of $G$ satisfies this property. Further, we study the Helly properties of a single clique of a circular-arc graph $G$. We divide the cliques of $G$ into three types: a clique $C$ of $G$ is always-Helly/always-non-Helly/ambiguous if $C$ is Helly in every/no/(some but not all) normalized model of $G$. We provide a combinatorial description for the cliques of each type, and based on it, we devise a polynomial time algorithm which determines the type of a given clique. Finally, we study the Helly Cliques problem, in which we are given an $n$-vertex circular-arc graph $G$ and some of its cliques $C_1, \\ldots, C_k$ and we ask if there is an arc intersection model of $G$ in which all the cliques $C_1, \\ldots, C_k$ satisfy the Helly property. We show that: (1) the Helly Cliques problem admits a $2^{O(k\\log{k})}n^{O(1)}$-time algorithm (that is, it is FPT when parametrized by the number of cliques given in the input), (2) assuming Exponential Time Hypothesis (ETH), the Helly Cliques problem cannot be solved in time $2^{o(k)}n^{O(1)}$, (3) the Helly Cliques problem admits a polynomial kernel of size $O(k^6)$. All our results use a data structure, called a PQM-tree, which maintains all normalized models of a circular-arc graph $G$."}
{"main_page": "https://arxiv.org/abs/2404.01057", "pdf": "https://arxiv.org/pdf/2404.01057", "title": "Larger Nearly Orthogonal Sets over Finite Fields", "authors": "Ishay Haviv, Sam Mattheus, Aleksa Milojević, Yuval Wigderson", "subjects": "Combinatorics (math.CO); Computational Geometry (cs.CG); Discrete Mathematics (cs.DM)", "abstract": "For a field $\\mathbb{F}$ and integers $d$ and $k$, a set ${\\cal A} \\subseteq \\mathbb{F}^d$ is called $k$-nearly orthogonal if its members are non-self-orthogonal and every $k+1$ vectors of ${\\cal A}$ include an orthogonal pair. We prove that for every prime $p$ there exists some $\\delta = \\delta(p)>0$, such that for every field $\\mathbb{F}$ of characteristic $p$ and for all integers $k \\geq 2$ and $d \\geq k$, there exists a $k$-nearly orthogonal set of at least $d^{\\delta \\cdot k/\\log k}$ vectors of $\\mathbb{F}^d$. The size of the set is optimal up to the $\\log k$ term in the exponent. We further prove two extensions of this result. In the first, we provide a large set ${\\cal A}$ of non-self-orthogonal vectors of $\\mathbb{F}^d$ such that for every two subsets of ${\\cal A}$ of size $k+1$ each, some vector of one of the subsets is orthogonal to some vector of the other. In the second extension, every $k+1$ vectors of the produced set ${\\cal A}$ include $\\ell+1$ pairwise orthogonal vectors for an arbitrary fixed integer $1 \\leq \\ell \\leq k$. The proofs involve probabilistic and spectral arguments and the hypergraph container method."}
