{"main_page": "https://arxiv.org/abs/2404.00045", "pdf": "https://arxiv.org/pdf/2404.00045", "title": "Policy Optimization finds Nash Equilibrium in Regularized General-Sum LQ  Games", "authors": "Muhammad Aneeq uz Zaman, Shubham Aggarwal, Melih Bastopcu, Tamer Başar", "subjects": "Computer Science and Game Theory (cs.GT); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Multiagent Systems (cs.MA)", "abstract": "In this paper, we investigate the impact of introducing relative entropy regularization on the Nash Equilibria (NE) of General-Sum $N$-agent games, revealing the fact that the NE of such games conform to linear Gaussian policies. Moreover, it delineates sufficient conditions, contingent upon the adequacy of entropy regularization, for the uniqueness of the NE within the game. As Policy Optimization serves as a foundational approach for Reinforcement Learning (RL) techniques aimed at finding the NE, in this work we prove the linear convergence of a policy optimization algorithm which (subject to the adequacy of entropy regularization) is capable of provably attaining the NE. Furthermore, in scenarios where the entropy regularization proves insufficient, we present a $\\delta$-augmentation technique, which facilitates the achievement of an $\\epsilon$-NE within the game."}
{"main_page": "https://arxiv.org/abs/2404.00150", "pdf": "https://arxiv.org/pdf/2404.00150", "title": "Winning Without Observing Payoffs: Exploiting Behavioral Biases to Win  Nearly Every Round", "authors": "Avrim Blum, Melissa Dutz", "subjects": "Computer Science and Game Theory (cs.GT)", "abstract": "Gameplay under various forms of uncertainty has been widely studied. Feldman et al. (2010) studied a particularly low-information setting in which one observes the opponent's actions but no payoffs, not even one's own, and introduced an algorithm which guarantees one's payoff nonetheless approaches the minimax optimal value (i.e., zero) in a symmetric zero-sum game. Against an opponent playing a minimax-optimal strategy, approaching the value of the game is the best one can hope to guarantee. However, a wealth of research in behavioral economics shows that people often do not make perfectly rational, optimal decisions. Here we consider whether it is possible to actually win in this setting if the opponent is behaviorally biased. We model several deterministic, biased opponents and show that even without knowing the game matrix in advance or observing any payoffs, it is possible to take advantage of each bias in order to win nearly every round (so long as the game has the property that each action beats and is beaten by at least one other action). We also provide a partial characterization of the kinds of biased strategies that can be exploited to win nearly every round, and provide algorithms for beating some kinds of biased strategies even when we don't know which strategy the opponent uses."}
{"main_page": "https://arxiv.org/abs/2404.00153", "pdf": "https://arxiv.org/pdf/2404.00153", "title": "Precision game engineering through reshaping strategic payoffs", "authors": "Elie Eshoa (1, 2, 3 and 4), Ali R. Zomorrodi (3 and 4) ((1) Computer Science Department, Harvard John A. Paulson School of Engineering and Applied Sciences, Boston, MA, USA, (2) Harvard Kenneth C. Griffin Graduate School of Arts and Sciences, Cambridge, MA, USA, (3) Mucosal Immunology and Biology Research Center, Pediatrics Department, Massachusetts General Hospital, Boston, MA, USA, (4) Harvard Medical School, Boston, MA, USA)", "subjects": "Computer Science and Game Theory (cs.GT); Optimization and Control (math.OC)", "abstract": "Nash equilibrium is a key concept in game theory fundamental for elucidating the equilibrium state of strategic interactions, finding applications in diverse fields such as economics, political science, and biology. However, the Nash equilibrium may not always align with the optimal or desired outcomes within a system. This article introduces a novel game engineering framework that tweaks strategic payoffs within a game to achieve a desired Nash equilibrium while averting undesired ones. Leveraging mixed-integer linear programming, this framework identifies intricate combinations of players and strategies and optimal perturbations to their payoffs that enable the shift from undesirable Nash equilibria to more favorable ones. We demonstrate the effectiveness and scalability of our approach on games of varying complexity, ranging from simple prototype games such as the Prisoner's Dilemma and Snowdrift games with two or more players to complex game configurations with as high as $10^6$ entries in the payoff matrix. These studies showcase the capability of this framework in efficiently identifying the alternative ways of reshaping strategic payoffs to secure desired Nash equilibria and preclude the undesired equilibrium states. Our game engineering framework offers a versatile toolkit for precision strategic decision-making with far-reaching implications across diverse domains."}
{"main_page": "https://arxiv.org/abs/2404.00732", "pdf": "https://arxiv.org/pdf/2404.00732", "title": "An Abundance of Katherines: The Game Theory of Baby Naming", "authors": "Katy Blumer, Kate Donahue, Katie Fritz, Kate Ivanovich, Katherine Lee, Katie Luo, Cathy Meng, Katie Van Koevering", "subjects": "Computer Science and Game Theory (cs.GT); Computers and Society (cs.CY)", "abstract": "In this paper, we study the highly competitive arena of baby naming. Through making several Extremely Reasonable Assumptions (namely, that parents are myopic, perfectly knowledgeable agents who pick a name based solely on its uniquness), we create a model which is not only tractable and clean, but also perfectly captures the real world. We then extend our investigation with numerical experiments, as well as analysis of large language model tools. We conclude by discussing avenues for future research."}
{"main_page": "https://arxiv.org/abs/2404.00733", "pdf": "https://arxiv.org/pdf/2404.00733", "title": "Smooth Information Gathering in Two-Player Noncooperative Games", "authors": "Fernando Palafox, Jesse Milzman, Dong Ho Lee, Ryan Park, David Fridovich-Keil", "subjects": "Computer Science and Game Theory (cs.GT); Multiagent Systems (cs.MA); Systems and Control (eess.SY)", "abstract": "We present a mathematical framework for modeling two-player noncooperative games in which one player (the defender) is uncertain of the costs of the game and the second player's (the attacker's) intention but can preemptively allocate information-gathering resources to reduce this uncertainty. We obtain the defender's decisions by solving a two-stage problem. In Stage 1, the defender allocates information-gathering resources, and in Stage 2, the information-gathering resources output a signal that informs the defender about the costs of the game and the attacker's intent, and then both players play a noncooperative game. We provide a gradient-based algorithm to solve the two-stage game and apply this framework to a tower-defense game which can be interpreted as a variant of a Colonel Blotto game with smooth payoff functions and uncertainty over battlefield valuations. Finally, we analyze how optimal decisions shift with changes in information-gathering allocations and perturbations in the cost functions."}
{"main_page": "https://arxiv.org/abs/2404.00831", "pdf": "https://arxiv.org/pdf/2404.00831", "title": "Settling the Communication Complexity of VCG-based Mechanisms for all  Approximation Guarantees", "authors": "Frederick V. Qiu, S. Matthew Weinberg", "subjects": "Computer Science and Game Theory (cs.GT)", "abstract": "We consider truthful combinatorial auctions with items $M = [m]$ for sale to $n$ bidders, where each bidder $i$ has a private monotone valuation $v_i : 2^M \\to R_+$. Among truthful mechanisms, maximal-in-range (MIR) mechanisms achieve the best-known approximation guarantees among all poly-communication deterministic truthful mechanisms in all previously-studied settings. Our work settles the communication necessary to achieve any approximation guarantee via an MIR mechanism. Specifically: Let MIRsubmod$(m,k)$ denote the best approximation guarantee achievable by an MIR mechanism using $2^k$ communication between bidders with submodular valuations over $m$ items. Then for all $k = \\Omega(\\log(m))$, MIRsubmod$(m,k) = \\Omega(\\sqrt{m/(k\\log(m/k))})$. When $k = \\Theta(\\log(m))$, this improves the previous best lower bound for poly-comm. MIR mechanisms from $\\Omega(m^{1/3}/\\log^{2/3}(m))$ to $\\Omega(\\sqrt{m}/\\log(m))$. We also have MIRsubmod$(m,k) = O(\\sqrt{m/k})$. Moreover, our mechanism is optimal w.r.t. the value query and succinct representation models. When $k = \\Theta(\\log(m))$, this improves the previous best approximation guarantee for poly-comm. MIR mechanisms from $O(\\sqrt{m})$ to $O(\\sqrt{m/\\log(m)})$. Let also MIRgen$(m,k)$ denote the best approximation guarantee achievable by an MIR mechanism using $2^k$ communication between bidders with general valuations over $m$ items. Then for all $k = \\Omega(\\log(m))$, MIRgen$(m,k) = \\Omega(m/k)$. When $k = \\Theta(\\log(m))$, this improves the previous best lower bound for poly-comm. MIR mechanisms from $\\Omega(m/\\log^2(m))$ to $\\Omega(m/\\log(m))$. We also have MIRgen$(m,k) = O(m/k)$. Moreover, our mechanism is optimal w.r.t. the value query and succinct representation models. When $k = \\Theta(\\log(m))$, this improves the previous best approximation guarantee for poly-comm. MIR mechanisms from $O(m/\\sqrt{\\log(m)})$ to $O(m/\\log(m))$."}
