{"main_page": "https://arxiv.org/abs/2404.00206", "pdf": "https://arxiv.org/pdf/2404.00206", "title": "Random Reed-Solomon Codes are List Recoverable with Optimal List Size", "authors": "Dean Doron, S. Venkitesh", "subjects": "Information Theory (cs.IT); Computational Complexity (cs.CC); Combinatorics (math.CO)", "abstract": "We prove that Reed-Solomon (RS) codes with random evaluation points are list recoverable up to capacity with optimal output list size, for any input list size. Namely, given an input list size $\\ell$, a designated rate $R$, and any $\\varepsilon > 0$, we show that a random RS code is list recoverable from $1-R-\\varepsilon$ fraction of errors with output list size $L = O(\\ell/\\varepsilon)$, for field size $q=\\exp(\\ell,1/\\varepsilon) \\cdot n^2$. In particular, this shows that random RS codes are list recoverable beyond the ``list recovery Johnson bound''. Such a result was not even known for arbitrary random linear codes. Our technique follows and extends the recent line of work on list decoding of random RS codes, specifically the works of Brakensiek, Gopi, and Makam (STOC 2023), and of Guo and Zhang (FOCS 2023)."}
{"main_page": "https://arxiv.org/abs/2404.00265", "pdf": "https://arxiv.org/pdf/2404.00265", "title": "Environment-Aware Codebook for RIS-Assisted MU-MISO Communications:  Implementation and Performance Analysis", "authors": "Zhiheng Yu, Jiancheng An, Lu Gan, Chau Yuen", "subjects": "Information Theory (cs.IT); Signal Processing (eess.SP)", "abstract": "Reconfigurable intelligent surface (RIS) provides a new electromagnetic response control solution, which can reshape the characteristics of wireless channels. In this paper, we propose a novel environment-aware codebook protocol for RIS-assisted multi-user multiple-input single-output (MU-MISO) systems. Specifically, we first introduce a channel training protocol which consists of off-line and on-line stages. Secondly, we propose an environment-aware codebook generation scheme, which utilizes the statistical channel state information and alternating optimization method to generate codewords offline. Then, in the on-line stage, we use these pre-designed codewords to configure the RIS, and the optimal codeword resulting in the highest sum rate is adopted for assisting in the downlink data transmission. Thirdly, we analyze the theoretical performance of the proposed protocol considering the channel estimation errors. Finally, numerical simulations are provided to verify our theoretical analysis and the performance of the proposed scheme."}
{"main_page": "https://arxiv.org/abs/2404.00309", "pdf": "https://arxiv.org/pdf/2404.00309", "title": "Model-Driven Deep Learning for Distributed Detection with Binary  Quantization", "authors": "Wei Guo, Meng He, Chuan Huang, Hengtao He, Shenghui Song, Jun Zhang, Khaled B. Letaief", "subjects": "Information Theory (cs.IT); Signal Processing (eess.SP)", "abstract": "Within the realm of rapidly advancing wireless sensor networks (WSNs), distributed detection assumes a significant role in various practical applications. However, critical challenge lies in maintaining robust detection performance while operating within the constraints of limited bandwidth and energy resources. This paper introduces a novel approach that combines model-driven deep learning (DL) with binary quantization to strike a balance between communication overhead and detection performance in WSNs. We begin by establishing the lower bound of detection error probability for distributed detection using the maximum a posteriori (MAP) criterion. Furthermore, we prove the global optimality of employing identical local quantizers across sensors, thereby maximizing the corresponding Chernoff information. Subsequently, the paper derives the minimum MAP detection error probability (MAPDEP) by inplementing identical binary probabilistic quantizers across the sensors. Moreover, the paper establishes the equivalence between utilizing all quantized data and their average as input to the detector at the fusion center (FC). In particular, we derive the Kullback-Leibler (KL) divergence, which measures the difference between the true posterior probability and output of the proposed detector. Leveraging the MAPDEP and KL divergence as loss functions, the paper proposes model-driven DL method to separately train the probability controller module in the quantizer and the detector module at the FC. Numerical results validate the convergence and effectiveness of the proposed method, which achieves near-optimal performance with reduced complexity for Gaussian hypothesis testing."}
{"main_page": "https://arxiv.org/abs/2404.00404", "pdf": "https://arxiv.org/pdf/2404.00404", "title": "Value, Representation, Information and Communication", "authors": "Xiangjun Peng", "subjects": "Information Theory (cs.IT)", "abstract": "A new analytic framework is first formalized via the usage of the Monadology (Leibniz 1898), to expand the understanding of Zermelo-Fraenkel-choice set theory (ZFC) and Von Neumann-Bernays-Godel set theory (NBG). Implicitly, the framework levels value, representation and information separately. Given the fact that there exists a coincidental equivalence between Von Neumann universe and originally-formalized motivation in ZFC, this work hypothesizes the essential of ordered values for one monand, to carry out efficient communication with the rest. This work then focuses on the relationship among values, representation and information (and suggests potential methods for quantitative analysis). First, this framework generalizes the definition of values and representations from \"Indexes approximate Values\" principle by (Peng 2023) via surreal numbers (Knuth 1974). Second, credited to surreal numbers, this work recursively connects representations and information via subsets of sets. Therefore, the definition to metric space(s) is naturally formed by representations, and quantitative methods (e.g., Hausdorff Distance) can be applied for quantitative analysis among (sub)sets. Third, this framework conjectures that: as long as the metric space is (or can be formed as) complete, the existence tests can be performed via Cauchy Sequence (or its generalized methods). This work finally revisits the communication theory, and suggests new perspectives from the new analytic framework. Particularly, this work hypothesizes a (quantitative) relationship between values and representation, and conjectures that: the optimal construction of representations exists, and it can be derived as the core value of one monad via Cauchy Inequality (or its generalized methods)."}
{"main_page": "https://arxiv.org/abs/2404.00598", "pdf": "https://arxiv.org/pdf/2404.00598", "title": "Robust Beamforming Design and Antenna Selection for Dynamic HRIS-aided  Massive MIMO Systems", "authors": "Jintao Wang, Binggui Zhou, Chengzhi Ma, Shiqi Gong, Guanghua Yang, Shaodan Ma", "subjects": "Information Theory (cs.IT); Signal Processing (eess.SP)", "abstract": "In this paper, a dynamic hybrid active-passive reconfigurable intelligent surface (HRIS) is proposed to further enhance the massive multiple-input-multiple-output (MIMO) system, since it supports the dynamic placement of active and passive elements. Specifically, considering the impact of the hardware impairments (HWIs), we investigate the channel-aware configuration of the receive antennas at the base station (BS) and the active/passive elements at the HRIS to improve the reliability of system. To this end, we investigate the average mean-square-error (MSE) minimization problem for the HRIS-aided massive MIMO system by jointly optimizing the BS receive antenna selection matrix, the reflection phase coefficients, the reflection amplitude matrix, and the mode selection matrix of the HRIS under the power budget of the HRIS. To tackle the non-convexity and intractability of this problem, we first transform the binary and discrete variables into continuous ones, and then propose a penalty-based exact block coordinate descent (BCD) algorithm to solve these subproblems alternately. Numerical simulations demonstrate the great superiority of the proposed scheme over the conventional benchmark schemes."}
{"main_page": "https://arxiv.org/abs/2404.00612", "pdf": "https://arxiv.org/pdf/2404.00612", "title": "Resource Allocation for Green Probabilistic Semantic Communication with  Rate Splitting", "authors": "Ruopeng Xu, Zhaohui Yang, Zhouxiang Zhao, Qianqian Yang, Zhaoyang Zhang", "subjects": "Information Theory (cs.IT); Signal Processing (eess.SP)", "abstract": "In this paper, the energy efficient design for probabilistic semantic communication (PSC) system with rate splitting multiple access (RSMA) is investigated. Basic principles are first reviewed to show how the PSC system works to extract, compress and transmit the semantic information in a task-oriented transmission. Subsequently, the process of how multiuser semantic information can be represented, compressed and transmitted with RSMA is presented, during which the semantic compression ratio (SCR) is introduced to directly measure the computation overhead in a transmission task, and communication overhead is indirectly described as well. Hence, the problem of wireless resource allocation jointly considering the computation and communication consumption for the PSC system with RSMA is investigated. Both conventional wireless resource constraints and unique constraints on semantic communication are considered to maximize the energy efficiency (EE). Simulation results verify the effectiveness of the proposed scheme."}
{"main_page": "https://arxiv.org/abs/2404.00613", "pdf": "https://arxiv.org/pdf/2404.00613", "title": "On $(θ, Θ)$-cyclic codes and their applications in  constructing QECCs", "authors": "Awadhesh Kumar Shukla, Sachin Pathak, Om Prakash Pandey, Vipul Mishra, Ashish Kumar Upadhyay", "subjects": "Information Theory (cs.IT)", "abstract": "Let $\\mathbb F_q$ be a finite field, where $q$ is an odd prime power. Let $R=\\mathbb{F}_q+u\\mathbb{F}_q+v\\mathbb{F}_q+uv\\mathbb F_q$ with $u^2=u,v^2=v,uv=vu$. In this paper, we study the algebraic structure of $(\\theta, \\Theta)$-cyclic codes of block length $(r,s )$ over $\\mathbb{F}_qR.$ Specifically, we analyze the structure of these codes as left $R[x:\\Theta]$-submodules of $\\mathfrak{R}_{r,s} = \\frac{\\mathbb{F}_q[x:\\theta]}{\\langle x^r-1\\rangle} \\times \\frac{R[x:\\Theta]}{\\langle x^s-1\\rangle}$. Our investigation involves determining generator polynomials and minimal generating sets for this family of codes. Further, we discuss the algebraic structure of separable codes. A relationship between the generator polynomials of $(\\theta, \\Theta)$-cyclic codes over $\\mathbb F_qR$ and their duals is established. Moreover, we calculate the generator polynomials of dual of $(\\theta, \\Theta)$-cyclic codes. As an application of our study, we provide a construction of quantum error-correcting codes (QECCs) from $(\\theta, \\Theta)$-cyclic codes of block length $(r,s)$ over $\\mathbb{F}_qR$. We support our theoretical results with illustrative examples."}
{"main_page": "https://arxiv.org/abs/2404.00628", "pdf": "https://arxiv.org/pdf/2404.00628", "title": "Fluid Antenna Relay Assisted Communication Systems Through Antenna  Location Optimization", "authors": "Ruopeng Xu, Yixuan Chen, Jiawen Kang, Minrui Xu, Zhaohui Yang, Chongwen Huang, Niyato Dusit", "subjects": "Information Theory (cs.IT); Signal Processing (eess.SP)", "abstract": "In this paper, we investigate the problem of resource allocation for fluid antenna relay (FAR) system with antenna location optimization. In the considered model, each user transmits information to a base station (BS) with help of FAR. The antenna location of the FAR is flexible and can be adapted to dynamic location distribution of the users. We formulate a sum rate maximization problem through jointly optimizing the antenna location and bandwidth allocation with meeting the minimum rate requirements, total bandwidth budget, and feasible antenna region constraints. To solve this problem, we obtain the optimal bandwidth in closed form. Based on the optimal bandwidth, the original problem is reduced to the antenna location optimization problem and an alternating algorithm is proposed. Simulation results verify the effectiveness of the proposed algorithm and the sum rate can be increased by up to 125% compared to the conventional schemes."}
{"main_page": "https://arxiv.org/abs/2404.00631", "pdf": "https://arxiv.org/pdf/2404.00631", "title": "Network-Assisted Full-Duplex Cell-Free mmWave Networks: Hybrid MIMO  Processing and Multi-Agent DRL-Based Power Allocation", "authors": "Qingrui Fan, Yu Zhang, Jiamin Li, Dongming Wang, Hongbiao Zhang, Xiaohu You", "subjects": "Information Theory (cs.IT); Multiagent Systems (cs.MA); Signal Processing (eess.SP)", "abstract": "This paper investigates the network-assisted full-duplex (NAFD) cell-free millimeter-wave (mmWave) networks, where the distribution of the transmitting access points (T-APs) and receiving access points (R-APs) across distinct geographical locations mitigates cross-link interference, facilitating the attainment of a truly flexible duplex mode. To curtail deployment expenses and power consumption for mmWave band operations, each AP incorporates a hybrid digital-analog structure encompassing precoder/combiner functions. However, this incorporation introduces processing intricacies within channel estimation and precoding/combining design. In this paper, we first present a hybrid multiple-input multiple-output (MIMO) processing framework and derive explicit expressions for both uplink and downlink achievable rates. Then we formulate a power allocation problem to maximize the weighted bidirectional sum rates. To tackle this non-convex problem, we develop a collaborative multi-agent deep reinforcement learning (MADRL) algorithm called multi-agent twin delayed deep deterministic policy gradient (MATD3) for NAFD cell-free mmWave networks. Specifically, given the tightly coupled nature of both uplink and downlink power coefficients in NAFD cell-free mmWave networks, the MATD3 algorithm resolves such coupled conflicts through an interactive learning process between agents and the environment. Finally, the simulation results validate the effectiveness of the proposed channel estimation methods within our hybrid MIMO processing paradigm, and demonstrate that our MATD3 algorithm outperforms both multi-agent deep deterministic policy gradient (MADDPG) and conventional power allocation strategies."}
{"main_page": "https://arxiv.org/abs/2404.00665", "pdf": "https://arxiv.org/pdf/2404.00665", "title": "On cumulative and relative cumulative past information generating  function", "authors": "Santosh Kumar Chaudhary, Nitin Gupta, Achintya Roy", "subjects": "Information Theory (cs.IT)", "abstract": "In this paper, we introduce the cumulative past information generating function (CPIG) and relative cumulative past information generating function (RCPIG). We study its properties. We establish its relation with generalized cumulative past entropy (GCPE). We defined CPIG stochastic order and its relation with dispersive order. We provide the results for the CPIG measure of the convoluted random variables in terms of the measures of its components. We found some inequality relating to Shannon entropy, CPIG and GCPE. Some characterization and estimation results are also discussed regarding CPIG. We defined divergence measures between two random variables, Jensen-cumulative past information generating function(JCPIG), Jensen fractional cumulative past entropy measure, cumulative past Taneja entropy, and Jensen cumulative past Taneja entropy information measure."}
{"main_page": "https://arxiv.org/abs/2404.00836", "pdf": "https://arxiv.org/pdf/2404.00836", "title": "Rethinking Resource Management in Edge Learning: A Joint Pre-training  and Fine-tuning Design Paradigm", "authors": "Zhonghao Lyu, Yuchen Li, Guangxu Zhu, Jie Xu, H. Vincent Poor, Shuguang Cui", "subjects": "Information Theory (cs.IT); Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)", "abstract": "In some applications, edge learning is experiencing a shift in focusing from conventional learning from scratch to new two-stage learning unifying pre-training and task-specific fine-tuning. This paper considers the problem of joint communication and computation resource management in a two-stage edge learning system. In this system, model pre-training is first conducted at an edge server via centralized learning on local pre-stored general data, and then task-specific fine-tuning is performed at edge devices based on the pre-trained model via federated edge learning. For the two-stage learning model, we first analyze the convergence behavior (in terms of the average squared gradient norm bound), which characterizes the impacts of various system parameters such as the number of learning rounds and batch sizes in the two stages on the convergence rate. Based on our analytical results, we then propose a joint communication and computation resource management design to minimize an average squared gradient norm bound, subject to constraints on the transmit power, overall system energy consumption, and training delay. The decision variables include the number of learning rounds, batch sizes, clock frequencies, and transmit power control for both pre-training and fine-tuning stages. Finally, numerical results are provided to evaluate the effectiveness of our proposed design. It is shown that the proposed joint resource management over the pre-training and fine-tuning stages well balances the system performance trade-off among the training accuracy, delay, and energy consumption. The proposed design is also shown to effectively leverage the inherent trade-off between pre-training and fine-tuning, which arises from the differences in data distribution between pre-stored general data versus real-time task-specific data, thus efficiently optimizing overall system performance."}
{"main_page": "https://arxiv.org/abs/2404.00872", "pdf": "https://arxiv.org/pdf/2404.00872", "title": "Performance Evaluation of RIS-Assisted Spatial Modulation for Downlink  Transmission", "authors": "Xusheng Zhu, Qingqing Wu, Wen Chen", "subjects": "Information Theory (cs.IT); Signal Processing (eess.SP)", "abstract": "This paper explores the performance of reconfigurable intelligent surface (RIS) assisted spatial modulation (SM) downlink communication systems, focusing on the average bit error probability (ABEP). Notably, in scenarios with a large number of reflecting units, the composite channel can be approximated by a Gaussian distribution using the central limit theorem. The receiver utilizes a maximum likelihood detector to recover information in both spatial and symbol domains. In the proposed RIS-SM system, we analytically derive a closed-form expression for the union tight upper bound of ABEP, employing the Gaussian-Chebyshev quadrature method. The validity of these results is rigorously confirmed through exhaustive Monte Carlo simulations."}
{"main_page": "https://arxiv.org/abs/2404.00953", "pdf": "https://arxiv.org/pdf/2404.00953", "title": "Movable Antenna-Aided Hybrid Beamforming for Multi-User Communications", "authors": "Yichi Zhang, Yuchen Zhang, Lipeng Zhu, Sa Xiao, Wanbin Tang, Yonina C. Eldar, Rui Zhang", "subjects": "Information Theory (cs.IT); Signal Processing (eess.SP)", "abstract": "In this correspondence, we propose a movable antenna (MA)-aided multi-user hybrid beamforming scheme with a sub-connected structure, where multiple movable sub-arrays can independently change their positions within different local regions. To maximize the system sum rate, we jointly optimize the digital beamformer, analog beamformer, and positions of subarrays, under the constraints of unit modulus, finite movable regions, and power budget. Due to the non-concave/non-convex objective function/constraints, as well as the highly coupled variables, the formulated problem is challenging to solve. By employing fractional programming, we develop an alternating optimization framework to solve the problem via a combination of Lagrange multipliers, penalty method, and gradient descent. Numerical results reveal that the proposed MA-aided hybrid beamforming scheme significantly improves the sum rate compared to its fixed-position antenna (FPA) counterpart. Moreover, with sufficiently large movable regions, the proposed scheme with sub-connected MA arrays even outperforms the fully-connected FPA array."}
{"main_page": "https://arxiv.org/abs/2404.01059", "pdf": "https://arxiv.org/pdf/2404.01059", "title": "STAR-RIS Aided Secure MIMO Communication Systems", "authors": "Xiequn Dong, Zesong Fei, Xinyi Wang, Meng Hua, Qingqing Wu", "subjects": "Information Theory (cs.IT); Signal Processing (eess.SP)", "abstract": "This paper investigates simultaneous transmission and reflection reconfigurable intelligent surface (STAR-RIS) aided physical layer security (PLS) in multiple-input multiple-output (MIMO) systems, where the base station (BS) transmits secrecy information with the aid of STAR-RIS against multiple eavesdroppers equipped with multiple antennas. We aim to maximize the secrecy rate by jointly optimizing the active beamforming at the BS and passive beamforming at the STAR-RIS, subject to the hardware constraint for STAR-RIS. To handle the coupling variables, a minimum mean-square error (MMSE) based alternating optimization (AO) algorithm is applied. In particular, the amplitudes and phases of STAR-RIS are divided into two blocks to simplify the algorithm design. Besides, by applying the Majorization-Minimization (MM) method, we derive a closed-form expression of the STAR-RIS's phase shifts. Numerical results show that the proposed scheme significantly outperforms various benchmark schemes, especially as the number of STAR-RIS elements increases."}
{"main_page": "https://arxiv.org/abs/2404.01111", "pdf": "https://arxiv.org/pdf/2404.01111", "title": "The Rate-Distortion-Perception Trade-off: The Role of Private Randomness", "authors": "Yassine Hamdi, Aaron B. Wagner, Deniz Gündüz", "subjects": "Information Theory (cs.IT); Machine Learning (stat.ML)", "abstract": "In image compression, with recent advances in generative modeling, the existence of a trade-off between the rate and the perceptual quality (realism) has been brought to light, where the realism is measured by the closeness of the output distribution to the source. It has been shown that randomized codes can be strictly better under a number of formulations. In particular, the role of common randomness has been well studied. We elucidate the role of private randomness in the compression of a memoryless source $X^n=(X_1,...,X_n)$ under two kinds of realism constraints. The near-perfect realism constraint requires the joint distribution of output symbols $(Y_1,...,Y_n)$ to be arbitrarily close the distribution of the source in total variation distance (TVD). The per-symbol near-perfect realism constraint requires that the TVD between the distribution of output symbol $Y_t$ and the source distribution be arbitrarily small, uniformly in the index $t.$ We characterize the corresponding asymptotic rate-distortion trade-off and show that encoder private randomness is not useful if the compression rate is lower than the entropy of the source, however limited the resources in terms of common randomness and decoder private randomness may be."}
{"main_page": "https://arxiv.org/abs/2404.01136", "pdf": "https://arxiv.org/pdf/2404.01136", "title": "Density Evolution Analysis of Generalized Low-density Parity-check Codes  under a Posteriori Probability Decoder", "authors": "Dongxu Chang, Qingqing Peng, Guanghui Wang, Dawei Yin", "subjects": "Information Theory (cs.IT)", "abstract": "In this study, the performance of generalized low-density parity-check (GLDPC) codes under the a posteriori probability (APP) decoder is analyzed. We explore the concentration, symmetry, and monotonicity properties of GLDPC codes under the APP decoder, extending the applicability of density evolution to GLDPC codes. We demonstrate that with an appropriate proportion of generalized constraint (GC) nodes, GLDPC codes can reduce the original gap to capacity compared to their original LDPC counterparts over the BEC and BI-AWGN channels. Additionally, on the BI-AWGN channel, we adopt Gaussian mixture distributions to approximate the message distributions from variable nodes and Gaussian distributions for those from constraint nodes. This approximation technique significantly enhances the precision of the channel parameter threshold compared to traditional Gaussian approximations while maintaining a low computational complexity similar to that of Gaussian approximations. Our simulation experiments provide empirical evidence that GLDPC codes, when decoded with the APP decoder and equipped with the right fraction of GC nodes, can achieve substantial performance improvements compared to low-density parity-check (LDPC) codes."}
{"main_page": "https://arxiv.org/abs/2404.01148", "pdf": "https://arxiv.org/pdf/2404.01148", "title": "Joint Beam Scheduling and Beamforming Design for Cooperative Positioning  in Multi-beam LEO Satellite Networks", "authors": "Hongtao Xv, Yaohua Sun, Yafei Zhao, Mugen Peng, Shijie Zhang", "subjects": "Information Theory (cs.IT); Signal Processing (eess.SP)", "abstract": "Cooperative positioning with multiple low earth orbit (LEO) satellites is promising in providing location-based services and enhancing satellite-terrestrial communication. However, positioning accuracy is greatly affected by inter-beam interference and satellite-terrestrial topology geometry. To select the best combination of satellites from visible ones and suppress inter-beam interference, this paper explores the utilization of flexible beam scheduling and beamforming of multi-beam LEO satellites that can adjust beam directions toward the same earth-fixed cell to send positioning signals simultaneously. By leveraging Cram\\'{e}r-Rao lower bound (CRLB) to characterize user Time Difference of Arrival (TDOA) positioning accuracy, the concerned problem is formulated, aiming at optimizing user positioning accuracy under beam scheduling and beam transmission power constraints. To deal with the mixed-integer-nonconvex problem, we decompose it into an inner beamforming design problem and an outer beam scheduling problem. For the former, we first prove the monotonic relationship between user positioning accuracy and its perceived signal-to-interference-plus-noise ratio (SINR) to reformulate the problem, and then semidefinite relaxation (SDR) is adopted for beamforming design. For the outer problem, a heuristic low-complexity beam scheduling scheme is proposed, whose core idea is to schedule users with lower channel correlation to mitigate inter-beam interference while seeking a proper satellite-terrestrial topology geometry. Simulation results verify the superior positioning performance of our proposed positioning-oriented beamforming and beam scheduling scheme, and it is shown that average user positioning accuracy is improved by $17.1\\%$ and $55.9\\%$ when the beam transmission power is 20 dBw, compared to conventional beamforming and beam scheduling schemes, respectively."}
{"main_page": "https://arxiv.org/abs/2404.01229", "pdf": "https://arxiv.org/pdf/2404.01229", "title": "Age of Information in a Single-Source Generate-at-Will Dual-Server  Status Update System", "authors": "Nail Akar, Sennur Ulukus", "subjects": "Information Theory (cs.IT); Networking and Internet Architecture (cs.NI); Performance (cs.PF)", "abstract": "We study age of information (AoI) in a single-source dual-server status update system for the generate at will (GAW) scenario, consisting of an information source, dual servers, and a monitor. For this system, the method of stochastic hybrid systems (SHS) was used to obtain the mean AoI for the work-conserving ZW (zero wait) policy with out-of-order packet discarding at the monitor. In this paper, we propose a non-work-conserving F/P (freeze/preempt) policy for which the sampling and transmission process is frozen for an Erlang distributed amount of time upon each transmission, and out-of-order packets are preempted immediately at the source, rather than being discarded at the monitor upon reception. We use the absorbing Markov chain (AMC) method to obtain the exact distributions of AoI and also the peak AoI (PAoI) processes, for both ZW and F/P policies. Numerical results are presented for the validation of the proposed analytical model and a comparative evaluation of ZW and F/P policies."}
{"main_page": "https://arxiv.org/abs/2404.01276", "pdf": "https://arxiv.org/pdf/2404.01276", "title": "Variable-Length Stop-Feedback Coding for Minimum Age of Incorrect  Information", "authors": "Konstantinos Bountrogiannis, Ioannis Papoutsidakis, Anthony Ephremides, Panagiotis Tsakalides, George Tzagkarakis", "subjects": "Information Theory (cs.IT)", "abstract": "We study the average Age of Incorrect Information (AoII) in the context of remote monitoring of a symmetric Markov source using variable-length stop-feedback (VLSF) coding. We consider sources with small cardinality, where feedback is non-instantaneous, as the transmitted information and feedback may have comparable lengths. We leverage recent results on the non-asymptotic achievable channel coding rate to derive optimal feedback sequences, i.e. the times of feedback transmissions, in terms of either AoII or delay. Our results showcase the impact of the feedback sequence and SNR on the AoII, revealing that a lower average delay does not necessarily correspond to a lower average AoII. We discuss implications and suggest directions for efficient coding scheme design."}
