{"main_page": "https://arxiv.org/abs/2404.00904", "pdf": "https://arxiv.org/pdf/2404.00904", "title": "A Fast Percolation-Dijkstra Routing Method for Mega-Constellation  Backbone Network", "authors": "Shenshen Luan, Luyuan Wang, Yepeng Liu, Ninghan Sun", "subjects": "Networking and Internet Architecture (cs.NI)", "abstract": "The real-time routing for satellite communication of the mega-constellations is being challenged due to the large-scale of network nodes, especially on devices with limited computation such as onboard embedded systems. In this paper, a fast routing method is proposed for mega-constellation backbone networks. Firstly, inspired by the regularity and sparse characteristics of mega-constellations, the 4-degree percolation theory is proposed to describe the node search process. Then, dynamic minimum search and mapping methods are used to narrow down the traversal range. The proposed method performs as well as the heap-optimized Dijkstra algorithm with less memory space and dynamic access. The experimental results show that the method proposed in this paper can significantly reduce routing computation time, especially on the onboard, edge-computing or other computation-limited devices."}
{"main_page": "https://arxiv.org/abs/2404.00988", "pdf": "https://arxiv.org/pdf/2404.00988", "title": "Distributed Satellite-Terrestrial Cooperative Routing Strategy Based on  Minimum Hop-Count Analysis in Mega LEO Satellite Constellation", "authors": "Xin'ao Feng, Yaohua Sun, Mugen Peng", "subjects": "Networking and Internet Architecture (cs.NI)", "abstract": "Mega low earth orbit (LEO) satellite constellation is promising in achieving global coverage with high capacity. However, forwarding packets in mega constellation faces long end-to-end delay caused by multi-hop routing and high-complexity routing table construction, which will detrimentally impair the network transmission efficiency. To overcome this issue, a distributed low-complexity satellite-terrestrial cooperative routing approach is proposed in this paper, and its core idea is that each node forwards packets to next-hop node under the constraints of minimum end-to-end hop-count and queuing delay. Particularly, to achieve an accurate and low-complexity minimum end-to-end hop-count estimation in satellite-terrestrial cooperative routing scenario, we first introduce a satellite real-time position based graph (RTPG) to simplify the description of three-dimensional constellation, and further abstract RTPG into a key node based graph (KNBG). Considering the frequent regeneration of KNBG due to satellite movement, a low complexity generation method of KNBG is studied as well. Finally, utilizing KNBG as input, we design the minimum end-to-end hop-count estimation method (KNBG-MHCE). Meanwhile, the computational complexity, routing path survival probability and practical implementation of our proposal are all deeply discussed. Extensive simulations are also conducted in systems with Ka and laser band inter-satellite links to verify the superiority of our proposal."}
