{"main_page": "https://arxiv.org/abs/2404.00154", "pdf": "https://arxiv.org/pdf/2404.00154", "title": "Sampling error mitigation through spectrum smoothing in ensemble data  assimilation", "authors": "Bosu Choi, Yoonsang Lee", "subjects": "Numerical Analysis (math.NA)", "abstract": "In data assimilation, an ensemble provides a nonintrusive way to evolve a probability density described by a nonlinear prediction model. Although a large ensemble size is required for statistical accuracy, the ensemble size is typically limited to a small number due to the computational cost of running the prediction model, which leads to a sampling error. Several methods, such as localization, exist to mitigate the sampling error, often requiring problem-dependent fine-tuning and design. This work introduces another sampling error mitigation method using a smoothness constraint in the Fourier space. In particular, this work smoothes out the spectrum of the system to increase the stability and accuracy even under a small ensemble size. The efficacy of the new idea is validated through a suite of stringent test problems, including Lorenz 96 and Kuramoto-Sivashinsky turbulence models."}
{"main_page": "https://arxiv.org/abs/2404.00248", "pdf": "https://arxiv.org/pdf/2404.00248", "title": "Numerical Simulations for Fractional Differential Equations of Higher  Order and a Wright-Type Transformation", "authors": "M. Nacianceno, T. Oraby, H. Rodrigo, Y. Sepulveda, J. Sifuentes, E. Suazo, T. Stuck, J. Williams", "subjects": "Numerical Analysis (math.NA); Mathematical Physics (math-ph)", "abstract": "In this work, a new relationship is established between the solutions of higher fractional differential equations and a Wright-type transformation. Solutions could be interpreted as expected values of functions in a random time process. As applications, we solve the fractional beam equation, fractional electric circuits with special functions as external sources, and derive dAlemberts formula for the fractional wave equation. Due to this relationship, we present two methods for simulating solutions of fractional differential equations. The two approaches use the interpretation of the Caputo derivative of a function as a Wright-type transformation of the higher derivative of the function. In the first approach, we use the Runge-Kutta method of hybrid orders 4 and 5 to solve ordinary differential equations combined with the Monte Carlo integration to conduct the Wrighttype transformation. The second method uses a feedforward neural network to simulate the fractional differential equation."}
{"main_page": "https://arxiv.org/abs/2404.00255", "pdf": "https://arxiv.org/pdf/2404.00255", "title": "Geometric mean for T-positive definite tensors and associated Riemannian  geometry", "authors": "Jeong-Hoon Ju, Taehyeong Kim, Yeongrak Kim, Hayoung Choi", "subjects": "Numerical Analysis (math.NA); Differential Geometry (math.DG); Functional Analysis (math.FA)", "abstract": "In this paper, we generalize the geometric mean of two positive definite matrices to that of third-order tensors using the notion of T-product. Specifically, we define the geometric mean of two T-positive definite tensors and verify several properties that \"mean\" should satisfy including the idempotence and the commutative property, and so on. Moreover, it is shown that the geometric mean is a unique T-positive definite solution of an algebraic Riccati tensor equation and can be expressed as solutions of algebraic Riccati matrix equations. In addition, we investigate the Riemannian manifold associated with the geometric mean for T-positive definite tensors, considering it as a totally geodesic embedded submanifold of the Riemannian manifold associated with the case of matrices. It is particularly shown that the geometric mean of two T-positive definite tensors is the midpoint of a unique geodesic joining the tensors, and the manifold is a Cartan-Hadamard-Riemannian manifold."}
{"main_page": "https://arxiv.org/abs/2404.00326", "pdf": "https://arxiv.org/pdf/2404.00326", "title": "Implicit-explicit schemes for compressible Cahn-Hilliard-Navier-Stokes  equations", "authors": "Pep Mulet", "subjects": "Numerical Analysis (math.NA)", "abstract": "The isentropic compressible Cahn-Hilliard-Navier-Stokes equations is a system of fourth-order partial differential equations that model the evolution of some binary fluids under convection. The purpose of this paper is the design of efficient numerical schemes to approximate the solution of initial-boundary value problems with these equations. The efficiency stems from the implicit treatment of the high-order terms in the equations. Our proposal is a second-order linearly implicit-explicit time stepping scheme applied in a method of lines approach, in which the convective terms are treated explicitly and only linear systems have to be solved. Some experiments are performed to assess the validity and efficiency of this proposal."}
{"main_page": "https://arxiv.org/abs/2404.00391", "pdf": "https://arxiv.org/pdf/2404.00391", "title": "Robust and structure-preserving time-discretisation and linearisation  schemes for singular and degenerate evolution systems arising in models for  biofilm growth", "authors": "R.K.H. Smeets, K. Mitra, I.S. Pop, S. Sonner", "subjects": "Numerical Analysis (math.NA); Analysis of PDEs (math.AP)", "abstract": "We propose and analyse numerical schemes for a system of quasilinear, degenerate evolution equations modelling biofilm growth as well as other processes such as flow through porous media and the spreading of wildfires. The first equation in the system is parabolic and exhibits degenerate and singular diffusion, while the second is either uniformly parabolic or an ordinary differential equation. First, we introduce a semi-implicit time discretisation that has the benefit of decoupling the equations. We prove the positivity, boundedness, and convergence of the time-discrete solutions to the time-continuous solution. Then, we introduce an iterative linearisation scheme to solve the resulting nonlinear time-discrete problems. Under weak assumptions on the time-step size, we prove that the scheme converges irrespective of the space discretisation and mesh. Moreover, if the problem is non-degenerate, the convergence becomes faster as the time-step size decreases. Finally, employing the finite element method for the spatial discretisation, we study the behaviour of the scheme, and compare its performance to other commonly used schemes. These tests confirm that the proposed scheme is robust and fast."}
{"main_page": "https://arxiv.org/abs/2404.00414", "pdf": "https://arxiv.org/pdf/2404.00414", "title": "Chebyshev and The Fast Fourier Transform Methods for Signal  Interpolation", "authors": "Ishmael N. Amartey", "subjects": "Numerical Analysis (math.NA); Signal Processing (eess.SP)", "abstract": "Approximation theorem is one of the most important aspects of numerical analysis that has evolved over the years with many different approaches. Some of the most popular approximation methods include the Lebesgue approximation theorem, the Weierstrass approximation, and the Fourier approximation theorem. The limitations associated with various approximation methods are too crucial to ignore, and thus, the nature of a specific dataset may require using a specific approximation method for such estimates. In this report, we shall delve into Chebyshev's polynomials interpolation in detail as an alternative approach to reconstructing signals and compare the reconstruction to that of the Fourier polynomials. We will also explore the advantages and limitations of the Chebyshev polynomials and discuss in detail their mathematical formulation and equivalence to the cosine function over a given interval [a, b]."}
{"main_page": "https://arxiv.org/abs/2404.00655", "pdf": "https://arxiv.org/pdf/2404.00655", "title": "Characterizing GSVD by singular value expansion of linear operators and  its computation", "authors": "Haibo Li", "subjects": "Numerical Analysis (math.NA)", "abstract": "The generalized singular value decomposition (GSVD) of a matrix pair $\\{A, L\\}$ with $A\\in\\mathbb{R}^{m\\times n}$ and $L\\in\\mathbb{R}^{p\\times n}$ generalizes the singular value decomposition (SVD) of a single matrix. In this paper, we provide a new understanding of GSVD from the viewpoint of SVD, based on which we propose a new iterative method for computing nontrivial GSVD components of a large-scale matrix pair. By introducing two linear operators $\\mathcal{A}$ and $\\mathcal{L}$ induced by $\\{A, L\\}$ between two finite-dimensional Hilbert spaces and applying the theory of singular value expansion (SVE) for linear compact operators, we show that the GSVD of $\\{A, L\\}$ is nothing but the SVEs of $\\mathcal{A}$ and $\\mathcal{L}$. This result characterizes completely the structure of GSVD for any matrix pair with the same number of columns. As a direct application of this result, we generalize the standard Golub-Kahan bidiagonalization (GKB) that is a basic routine for large-scale SVD computation such that the resulting generalized GKB (gGKB) process can be used to approximate nontrivial extreme GSVD components of $\\{A, L\\}$, which is named the gGKB\\_GSVD algorithm. We use the GSVD of $\\{A, L\\}$ to study several basic properties of gGKB and also provide preliminary results about convergence and accuracy of gGKB\\_GSVD for GSVD computation. Numerical experiments are presented to demonstrate the effectiveness of this method."}
{"main_page": "https://arxiv.org/abs/2404.00810", "pdf": "https://arxiv.org/pdf/2404.00810", "title": "Off-the-grid regularisation for Poisson inverse problems", "authors": "Marta Lazzaretti, Claudio Estatico, Alejandro Melero Carrillo, Luca Calatroni", "subjects": "Numerical Analysis (math.NA); Optimization and Control (math.OC)", "abstract": "Off-the-grid regularisation has been extensively employed over the last decade in the context of ill-posed inverse problems formulated in the continuous setting of the space of Radon measures $\\mathcal{M}(\\mathcal{X})$. These approaches enjoy convexity and counteract the discretisation biases as well the numerical instabilities typical of their discrete counterparts. In the framework of sparse reconstruction of discrete point measures (sum of weighted Diracs), a Total Variation regularisation norm in $\\mathcal{M}(\\mathcal{X})$ is typically combined with an $L^2$ data term modelling additive Gaussian noise. To asses the framework of off-the-grid regularisation in the presence of signal-dependent Poisson noise, we consider in this work a variational model coupling the Total Variation regularisation with a Kullback-Leibler data term under a non-negativity constraint. Analytically, we study the optimality conditions of the composite functional and analyse its dual problem. Then, we consider an homotopy strategy to select an optimal regularisation parameter and use it within a Sliding Frank-Wolfe algorithm. Several numerical experiments on both 1D/2D simulated and real 3D fluorescent microscopy data are reported."}
{"main_page": "https://arxiv.org/abs/2404.00960", "pdf": "https://arxiv.org/pdf/2404.00960", "title": "Randomized Nyström approximation of non-negative self-adjoint  operators", "authors": "David Persson, Nicolas Boullé, Daniel Kressner", "subjects": "Numerical Analysis (math.NA)", "abstract": "The randomized singular value decomposition (SVD) has become a popular approach to computing cheap, yet accurate, low-rank approximations to matrices due to its efficiency and strong theoretical guarantees. Recent work by Boull\\'e and Townsend (FoCM, 2023) presents an infinite-dimensional analog of the randomized SVD to approximate Hilbert-Schmidt operators. However, many applications involve computing low-rank approximations to symmetric positive semi-definite matrices. In this setting, it is well-established that the randomized Nystr{\\\"o}m approximation is usually preferred over the randomized SVD. This paper explores an infinite-dimensional analog of the Nystr{\\\"o}m approximation to compute low-rank approximations to non-negative self-adjoint trace-class operators. We present an analysis of the method and, along the way, improve the existing infinite-dimensional bounds for the randomized SVD. Our analysis yields bounds on the expected value and tail bounds for the Nystr{\\\"o}m approximation error in the operator, trace, and Hilbert-Schmidt norms. Numerical experiments for simple integral operators validate the proposed framework."}
{"main_page": "https://arxiv.org/abs/2404.01145", "pdf": "https://arxiv.org/pdf/2404.01145", "title": "Sequential-in-time training of nonlinear parametrizations for solving  time-dependent partial differential equations", "authors": "Huan Zhang, Yifan Chen, Eric Vanden-Eijnden, Benjamin Peherstorfer", "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG)", "abstract": "Sequential-in-time methods solve a sequence of training problems to fit nonlinear parametrizations such as neural networks to approximate solution trajectories of partial differential equations over time. This work shows that sequential-in-time training methods can be understood broadly as either optimize-then-discretize (OtD) or discretize-then-optimize (DtO) schemes, which are well known concepts in numerical analysis. The unifying perspective leads to novel stability and a posteriori error analysis results that provide insights into theoretical and numerical aspects that are inherent to either OtD or DtO schemes such as the tangent space collapse phenomenon, which is a form of over-fitting. Additionally, the unified perspective facilitates establishing connections between variants of sequential-in-time training methods, which is demonstrated by identifying natural gradient descent methods on energy functionals as OtD schemes applied to the corresponding gradient flows."}
{"main_page": "https://arxiv.org/abs/2404.01163", "pdf": "https://arxiv.org/pdf/2404.01163", "title": "Capturing Shock Waves by Relaxation Neural Networks", "authors": "Nan Zhou, Zheng Ma", "subjects": "Numerical Analysis (math.NA); Artificial Intelligence (cs.AI)", "abstract": "In this paper, we put forward a neural network framework to solve the nonlinear hyperbolic systems. This framework, named relaxation neural networks(RelaxNN), is a simple and scalable extension of physics-informed neural networks(PINN). It is shown later that a typical PINN framework struggles to handle shock waves that arise in hyperbolic systems' solutions. This ultimately results in the failure of optimization that is based on gradient descent in the training process. Relaxation systems provide a smooth asymptotic to the discontinuity solution, under the expectation that macroscopic problems can be solved from a microscopic perspective. Based on relaxation systems, the RelaxNN framework alleviates the conflict of losses in the training process of the PINN framework. In addition to the remarkable results demonstrated in numerical simulations, most of the acceleration techniques and improvement strategies aimed at the standard PINN framework can also be applied to the RelaxNN framework."}
{"main_page": "https://arxiv.org/abs/2404.01228", "pdf": "https://arxiv.org/pdf/2404.01228", "title": "Adaptive hybrid high-order method for guaranteed lower eigenvalue bounds", "authors": "Carsten Carstensen, Benedikt Gräßle, Ngoc Tien Tran", "subjects": "Numerical Analysis (math.NA)", "abstract": "The higher-order guaranteed lower eigenvalue bounds of the Laplacian in the recent work by Carstensen, Ern, and Puttkammer [Numer. Math. 149, 2021] require a parameter $C_{\\mathrm{st},1}$ that is found $\\textit{not}$ robust as the polynomial degree $p$ increases. This is related to the $H^1$ stability bound of the $L^2$ projection onto polynomials of degree at most $p$ and its growth $C_{\\rm st, 1}\\propto (p+1)^{1/2}$ as $p \\to \\infty$. A similar estimate for the Galerkin projection holds with a $p$-robust constant $C_{\\mathrm{st},2}$ and $C_{\\mathrm{st},2} \\le 2$ for right-isosceles triangles. This paper utilizes the new inequality with the constant $C_{\\mathrm{st},2}$ to design a modified hybrid high-order (HHO) eigensolver that directly computes guaranteed lower eigenvalue bounds under the idealized hypothesis of exact solve of the generalized algebraic eigenvalue problem and a mild explicit condition on the maximal mesh-size in the simplicial mesh. A key advance is a $p$-robust parameter selection. The analysis of the new method with a different fine-tuned volume stabilization allows for a priori quasi-best approximation and improved $L^2$ error estimates as well as a stabilization-free reliable and efficient a posteriori error control. The associated adaptive mesh-refining algorithm performs superior in computer benchmarks with striking numerical evidence for optimal higher empirical convergence rates."}
{"main_page": "https://arxiv.org/abs/2404.01251", "pdf": "https://arxiv.org/pdf/2404.01251", "title": "Duality based error control for the Signorini problem", "authors": "Ben S. Ashby, Tristan Pryer", "subjects": "Numerical Analysis (math.NA)", "abstract": "In this paper we study the a posteriori bounds for a conforming piecewise linear finite element approximation of the Signorini problem. We prove new rigorous a posteriori estimates of residual type in $L^{p}$, for $p \\in (4,\\infty)$ in two spatial dimensions. This new analysis treats the positive and negative parts of the discretisation error separately, requiring a novel sign- and bound-preserving interpolant, which is shown to have optimal approximation properties. The estimates rely on the sharp dual stability results on the problem in $W^{2,(4 - \\varepsilon)/3}$ for any $\\varepsilon \\ll 1$. We summarise extensive numerical experiments aimed at testing the robustness of the estimator to validate the theory."}
