{"main_page": "https://arxiv.org/abs/2404.00208", "pdf": "https://arxiv.org/pdf/2404.00208", "title": "Discrete Natural Evolution Strategies", "authors": "Ahmad Ayaz Amin", "subjects": "Neural and Evolutionary Computing (cs.NE); Optimization and Control (math.OC)", "abstract": "Natural evolution strategies are a class of approximate-gradient black-box optimizers that have been successfully used for continuous parameter spaces. In this paper, we derive NES algorithms for discrete parameter spaces and demonstrate their effectiveness in tasks involving discrete parameters."}
{"main_page": "https://arxiv.org/abs/2404.00251", "pdf": "https://arxiv.org/pdf/2404.00251", "title": "Approximation of a Pareto Set Segment Using a Linear Model with Sharing  Variables", "authors": "Ping Guo, Qingfu Zhang, Xi Lin", "subjects": "Neural and Evolutionary Computing (cs.NE)", "abstract": "In many real-world applications, the Pareto Set (PS) of a continuous multiobjective optimization problem can be a piecewise continuous manifold. A decision maker may want to find a solution set that approximates a small part of the PS and requires the solutions in this set share some similarities. This paper makes a first attempt to address this issue. We first develop a performance metric that considers both optimality and variable sharing. Then we design an algorithm for finding the model that minimizes the metric to meet the user's requirements. Experimental results illustrate that we can obtain a linear model that approximates the mapping from the preference vectors to solutions in a local area well."}
{"main_page": "https://arxiv.org/abs/2404.00383", "pdf": "https://arxiv.org/pdf/2404.00383", "title": "SpikingJET: Enhancing Fault Injection for Fully and Convolutional  Spiking Neural Networks", "authors": "Anil Bayram Gogebakan, Enrico Magliano, Alessio Carpegna, Annachiara Ruospo, Alessandro Savino, Stefano Di Carlo", "subjects": "Neural and Evolutionary Computing (cs.NE); Artificial Intelligence (cs.AI)", "abstract": "As artificial neural networks become increasingly integrated into safety-critical systems such as autonomous vehicles, devices for medical diagnosis, and industrial automation, ensuring their reliability in the face of random hardware faults becomes paramount. This paper introduces SpikingJET, a novel fault injector designed specifically for fully connected and convolutional Spiking Neural Networks (SNNs). Our work underscores the critical need to evaluate the resilience of SNNs to hardware faults, considering their growing prominence in real-world applications. SpikingJET provides a comprehensive platform for assessing the resilience of SNNs by inducing errors and injecting faults into critical components such as synaptic weights, neuron model parameters, internal states, and activation functions. This paper demonstrates the effectiveness of Spiking-JET through extensive software-level experiments on various SNN architectures, revealing insights into their vulnerability and resilience to hardware faults. Moreover, highlighting the importance of fault resilience in SNNs contributes to the ongoing effort to enhance the reliability and safety of Neural Network (NN)-powered systems in diverse domains."}
{"main_page": "https://arxiv.org/abs/2404.01159", "pdf": "https://arxiv.org/pdf/2404.01159", "title": "GPU-accelerated Evolutionary Multiobjective Optimization Using  Tensorized RVEA", "authors": "Zhenyu Liang, Tao Jiang, Kebin Sun, Ran Cheng", "subjects": "Neural and Evolutionary Computing (cs.NE)", "abstract": "Evolutionary multiobjective optimization has witnessed remarkable progress during the past decades. However, existing algorithms often encounter computational challenges in large-scale scenarios, primarily attributed to the absence of hardware acceleration. In response, we introduce a Tensorized Reference Vector Guided Evolutionary Algorithm (TensorRVEA) for harnessing the advancements of GPU acceleration. In TensorRVEA, the key data structures and operators are fully transformed into tensor forms for leveraging GPU-based parallel computing. In numerical benchmark tests involving large-scale populations and problem dimensions, TensorRVEA consistently demonstrates high computational performance, achieving up to over 1000$\\times$ speedups. Then, we applied TensorRVEA to the domain of multiobjective neuroevolution for addressing complex challenges in robotic control tasks. Furthermore, we assessed TensorRVEA's extensibility by altering several tensorized reproduction operators. Experimental results demonstrate promising scalability and robustness of TensorRVEA. Source codes are available at https://github.com/EMI-Group/tensorrvea."}
