{"main_page": "https://arxiv.org/abs/2403.18882", "pdf": "https://arxiv.org/pdf/2403.18882", "title": "Towards a Cost-Benefit Analysis of Additive Manufacturing as a Service", "authors": "Igor Ivkić, Tobias Buhmann, Burkhard List, Clemens Gnauer", "subjects": "Other Computer Science (cs.OH)", "abstract": "The landscape of traditional industrial manufacturing is undergoing a pivotal shift from resource-intensive production and long supply chains to more sustainable and regionally focused economies. In this evolving scenario, the move towards local, on-demand manufacturing is emerging as a remedy to the environmentally damaging practice of mass-producing products in distant countries and then transporting them over long distances to customers. This paradigm shift significantly empowers customers, giving them greater control over the manufacturing process by enabling on-demand production and favouring local production sites over traditional mass production and extensive shipping practices. In this position paper we propose a cloud-native Manufacturing as a Service (MaaS) platform that integrates advances in three-dimensional (3D) printing technology into a responsive and eco-conscious manufacturing ecosystem. In this context, we propose a high-level architectural design for a cloud-based MaaS platform that connects web shops of local stores with small and medium-sized enterprises (SMEs) operating 3D printers. Furthermore, we outline an experimental design, including a cost-benefit analysis, to empirically evaluate the operational effectiveness and economic feasibility in a cloud-based additive manufacturing ecosystem. The proposed cloud-based MaaS platform enables on-demand additive manufacturing and opens up a profit sharing opportunity between different stakeholders."}
{"main_page": "https://arxiv.org/abs/2403.18883", "pdf": "https://arxiv.org/pdf/2403.18883", "title": "Towards a Cloud-based Smart Office Solution for Shared Workplace  Individualization", "authors": "Dominik Hasiwar, Andreas Gruber, Christian Dragschitz, Igor Ivkić", "subjects": "Other Computer Science (cs.OH)", "abstract": "In the evolving landscape of workplace dynamics, the shift towards hybrid working models has highlighted inefficiencies in the use of traditional office space and the need for an improved employee experience. In this position paper we propose a Smart Office solution that addresses these challenges by integrating a microservice architecture with Internet of Things (IoT) technologies to provide a flexible, personalized workspace environment. The position paper focuses on the technical implementation of this solution, including the design of a Workplace Environment Index (WEI) to monitor and improve office conditions. By using cloud technology, IoT devices with sensors, and following a user-centred design, the proposed solution shows how Shared Open Workspaces can be transformed into adaptive, efficient environments that support the diverse needs of the modern workforce. This position paper paves the way for future experimentation in real-world office environments to validate the effectiveness of the Smart Office solution and provide insights into its potential to redefine the workplace for improved productivity and employee satisfaction."}
{"main_page": "https://arxiv.org/abs/2403.18949", "pdf": "https://arxiv.org/pdf/2403.18949", "title": "An IoT Based Water-Logging Detection System: A Case Study of Dhaka", "authors": "Md Manirul Islam, Md. Sadad Mahamud, Umme Salsabil, A.A.M. Mazharul Amin, Samiul Haque Suman", "subjects": "Other Computer Science (cs.OH)", "abstract": "With a large number of populations, many problems are rising rapidly in Dhaka, the capital city of Bangladesh. Water-logging is one of the major issues among them. Heavy rainfall, lack of awareness and poor maintenance causes bad sewerage system in the city. As a result, water is overflowed on the roads and sometimes it gets mixed with the drinking water. To overcome this problem, this paper realizes the potential of using Internet of Things to combat water-logging in drainage pipes which are used to move wastes as well as rainwater away from the city. The proposed system will continuously monitor real time water level, water flow and gas level inside the drainage pipe. Moreover, all the monitoring data will be stored in the central database for graphical representation and further analysis. In addition to that if any emergency arises in the drainage system, an alert will be sent directly to the nearest maintenance office."}
