{"main_page": "https://arxiv.org/abs/2404.00164", "pdf": "https://arxiv.org/pdf/2404.00164", "title": "Sequential Synthetic Difference in Differences", "authors": "Dmitry Arkhangelsky, Aleksei Samkov", "subjects": "Econometrics (econ.EM)", "abstract": "We study the estimation of treatment effects of a binary policy in environments with a staggered treatment rollout. We propose a new estimator -- Sequential Synthetic Difference in Difference (Sequential SDiD) -- and establish its theoretical properties in a linear model with interactive fixed effects. Our estimator is based on sequentially applying the original SDiD estimator proposed in Arkhangelsky et al. (2021) to appropriately aggregated data. To establish the theoretical properties of our method, we compare it to an infeasible OLS estimator based on the knowledge of the subspaces spanned by the interactive fixed effects. We show that this OLS estimator has a sequential representation and use this result to show that it is asymptotically equivalent to the Sequential SDiD estimator. This result implies the asymptotic normality of our estimator along with corresponding efficiency guarantees. The method developed in this paper presents a natural alternative to the conventional DiD strategies in staggered adoption designs."}
{"main_page": "https://arxiv.org/abs/2404.00864", "pdf": "https://arxiv.org/pdf/2404.00864", "title": "Convolution-t Distributions", "authors": "Peter Reinhard Hansen, Chen Tong", "subjects": "Econometrics (econ.EM); Statistics Theory (math.ST)", "abstract": "We introduce a new class of multivariate heavy-tailed distributions that are convolutions of heterogeneous multivariate t-distributions. Unlike commonly used heavy-tailed distributions, the multivariate convolution-t distributions embody cluster structures with flexible nonlinear dependencies and heterogeneous marginal distributions. Importantly, convolution-t distributions have simple density functions that facilitate estimation and likelihood-based inference. The characteristic features of convolution-t distributions are found to be important in an empirical analysis of realized volatility measures and help identify their underlying factor structure."}
