{"main_page": "https://arxiv.org/abs/2404.00036", "pdf": "https://arxiv.org/pdf/2404.00036", "title": "A Fast Convergence Algorithm for Iterative Adaptation of Feedforward  Controller Parameters", "authors": "Eloy Serrano-Seco (1), Eduardo Moya-Lasheras (1), Edgar Ramirez-Laboreo (1) ((1) Universidad de Zaragoza)", "subjects": "Systems and Control (eess.SY)", "abstract": "Feedforward control is a viable option for enhancing the response time and control accuracy of a wide variety of systems. Nevertheless, it is not able to compensate for the effects produced by modeling errors or disturbances. A solution to improve the feedforward performance is the use of an adaptation law that modifies the parameters of the feedforward control. In the case where real-time feedback is not possible, a solution is a run-to-run numerical optimization method that is fed with a cost based on a measured signal. Although the effectiveness of this approach has been demonstrated, its performance is hindered by slow convergence. In this paper, we present an algorithm based on Pattern Search and Adaptive Coordinate Descent methods that makes use of the sensitivity of the feedforward controller to its parameters so that the convergence speed improves significantly. Like many algorithms, this is a local strategy so the algorithm might converge to a local minimum. Therefore, we present two versions, one without a learning rate and one with it. To compare them and to demonstrate the effectiveness of the algorithm, simulated results are shown on a well-known control problem in electromechanics: the soft-landing control of electromechanical switching devices."}
{"main_page": "https://arxiv.org/abs/2404.00040", "pdf": "https://arxiv.org/pdf/2404.00040", "title": "Stationary and Dynamic Reference Frame Comparison Based Microgrid  Application", "authors": "Ilyas Bennia, Yacine Daili, Abdelghani Harrag, Walid Issa", "subjects": "Systems and Control (eess.SY)", "abstract": "This paper presents a brief comparison for voltage and current controllers implementation in both stationary and dynamic reference frame for a microgrid (MG) application. Diagrams of implementations are reviewed and the simulation results are presented to show the performance of each topology"}
{"main_page": "https://arxiv.org/abs/2404.00066", "pdf": "https://arxiv.org/pdf/2404.00066", "title": "Local Observability of VINS and LINS", "authors": "Xinran Li", "subjects": "Systems and Control (eess.SY); Robotics (cs.RO)", "abstract": "This work analyzes unobservable directions of Vision-aided Inertial Navigation System (VINS) and Lidar-aided Inertial Navigation System (LINS) nonlinear model. Under the assumption that there exist two features observed by the camera without occlusion, the unobservable directions of VINS are uniformly globally translation and global rotations about the gravity vector. The unobservable directions of LINS are same as VINS, while only one feature need to be observed."}
{"main_page": "https://arxiv.org/abs/2404.00067", "pdf": "https://arxiv.org/pdf/2404.00067", "title": "Boosting Cardiac Color Doppler Frame Rates with Deep Learning", "authors": "Julia Puig (CREATIS), Denis Friboulet (CREATIS), Hang Jung Ling (CREATIS), François Varray (CREATIS), Jonathan Porée, Jean Provost, Damien Garcia (CREATIS), Fabien Millioz (CREATIS)", "subjects": "Image and Video Processing (eess.IV)", "abstract": "Color Doppler echocardiography enables visualization of blood flow within the heart. However, the limited frame rate impedes the quantitative assessment of blood velocity throughout the cardiac cycle, thereby compromising a comprehensive analysis of ventricular filling. Concurrently, deep learning is demonstrating promising outcomes in post-processing of echocardiographic data for various applications. This work explores the use of deep learning models for intracardiac Doppler velocity estimation from a reduced number of filtered I/Q signals. We used a supervised learning approach by simulating patient-based cardiac color Doppler acquisitions and proposed data augmentation strategies to enlarge the training dataset. We implemented architectures based on convolutional neural networks. In particular, we focused on comparing the U-Net model and the recent ConvNeXt models, alongside assessing real-valued versus complex-valued representations. We found that both models outperformed the state-of-the-art autocorrelator method, effectively mitigating aliasing and noise. We did not observe significant differences between the use of real and complex data. Finally, we validated the models on in vitro and in vivo experiments. All models produced quantitatively comparable results to the baseline and were more robust to noise. ConvNeXt emerged as the sole model to achieve high-quality results on in vivo aliased samples. These results demonstrate the interest of supervised deep learning methods for Doppler velocity estimation from a reduced number of acquisitions."}
{"main_page": "https://arxiv.org/abs/2404.00082", "pdf": "https://arxiv.org/pdf/2404.00082", "title": "Data-Driven Room Acoustic Modeling Via Differentiable Feedback Delay  Networks With Learnable Delay Lines", "authors": "Alessandro Ilic Mezza, Riccardo Giampiccolo, Enzo De Sena, Alberto Bernardini", "subjects": "Audio and Speech Processing (eess.AS); Machine Learning (cs.LG); Sound (cs.SD)", "abstract": "Over the past few decades, extensive research has been devoted to the design of artificial reverberation algorithms aimed at emulating the room acoustics of physical environments. Despite significant advancements, automatic parameter tuning of delay-network models remains an open challenge. We introduce a novel method for finding the parameters of a Feedback Delay Network (FDN) such that its output renders the perceptual qualities of a measured room impulse response. The proposed approach involves the implementation of a differentiable FDN with trainable delay lines, which, for the first time, allows us to simultaneously learn each and every delay-network parameter via backpropagation. The iterative optimization process seeks to minimize a time-domain loss function incorporating differentiable terms accounting for energy decay and echo density. Through experimental validation, we show that the proposed method yields time-invariant frequency-independent FDNs capable of closely matching the desired acoustical characteristics, and outperforms existing methods based on genetic algorithms and analytical filter design."}
{"main_page": "https://arxiv.org/abs/2404.00128", "pdf": "https://arxiv.org/pdf/2404.00128", "title": "A spiking-domain implementation of electronic structure theory", "authors": "Aakash Yadav, Daniel Hedman, Hongsik Jeong", "subjects": "Signal Processing (eess.SP); Materials Science (cond-mat.mtrl-sci); Computational Physics (physics.comp-ph)", "abstract": "Electronic Structure Theory (EST) describes the behavior of electrons in matter and is used to predict material properties. Conventionally, this involves forming a Hamiltonian and solving the Schr\\\"odinger equation through discrete computation. Here, a new perspective to EST is provided by treating a perfectly crystalline material as a Linear Translation Invariant (LTI) system. The validity of this LTI-EST formalism is demonstrated by determining band structures for a one-dimensional chain of atoms, including the phenomenon of band structure folding in super cells. The proposed formalism allows for analytical traceability of band structure folding and offers computational advantage by bypassing the O(N) eigenvalue calculations. The spike-based computing nature of the proposed LTI-EST formalism is highlighted; thereby implying potential for material simulations solely in the spiking domain."}
{"main_page": "https://arxiv.org/abs/2404.00132", "pdf": "https://arxiv.org/pdf/2404.00132", "title": "FetalDiffusion: Pose-Controllable 3D Fetal MRI Synthesis with  Conditional Diffusion Model", "authors": "Molin Zhang, Polina Golland, Patricia Ellen Grant, Elfar Adalsteinsson", "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV)", "abstract": "The quality of fetal MRI is significantly affected by unpredictable and substantial fetal motion, leading to the introduction of artifacts even when fast acquisition sequences are employed. The development of 3D real-time fetal pose estimation approaches on volumetric EPI fetal MRI opens up a promising avenue for fetal motion monitoring and prediction. Challenges arise in fetal pose estimation due to limited number of real scanned fetal MR training images, hindering model generalization when the acquired fetal MRI lacks adequate pose. In this study, we introduce FetalDiffusion, a novel approach utilizing a conditional diffusion model to generate 3D synthetic fetal MRI with controllable pose. Additionally, an auxiliary pose-level loss is adopted to enhance model performance. Our work demonstrates the success of this proposed model by producing high-quality synthetic fetal MRI images with accurate and recognizable fetal poses, comparing favorably with in-vivo real fetal MRI. Furthermore, we show that the integration of synthetic fetal MR images enhances the fetal pose estimation model's performance, particularly when the number of available real scanned data is limited resulting in 15.4% increase in PCK and 50.2% reduced in mean error. All experiments are done on a single 32GB V100 GPU. Our method holds promise for improving real-time tracking models, thereby addressing fetal motion issues more effectively."}
{"main_page": "https://arxiv.org/abs/2404.00144", "pdf": "https://arxiv.org/pdf/2404.00144", "title": "An Interpretable Cross-Attentive Multi-modal MRI Fusion Framework for  Schizophrenia Diagnosis", "authors": "Ziyu Zhou, Anton Orlichenko, Gang Qu, Zening Fu, Vince D Calhoun, Zhengming Ding, Yu-Ping Wang", "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV)", "abstract": "Both functional and structural magnetic resonance imaging (fMRI and sMRI) are widely used for the diagnosis of mental disorder. However, combining complementary information from these two modalities is challenging due to their heterogeneity. Many existing methods fall short of capturing the interaction between these modalities, frequently defaulting to a simple combination of latent features. In this paper, we propose a novel Cross-Attentive Multi-modal Fusion framework (CAMF), which aims to capture both intra-modal and inter-modal relationships between fMRI and sMRI, enhancing multi-modal data representation. Specifically, our CAMF framework employs self-attention modules to identify interactions within each modality while cross-attention modules identify interactions between modalities. Subsequently, our approach optimizes the integration of latent features from both modalities. This approach significantly improves classification accuracy, as demonstrated by our evaluations on two extensive multi-modal brain imaging datasets, where CAMF consistently outperforms existing methods. Furthermore, the gradient-guided Score-CAM is applied to interpret critical functional networks and brain regions involved in schizophrenia. The bio-markers identified by CAMF align with established research, potentially offering new insights into the diagnosis and pathological endophenotypes of schizophrenia."}
{"main_page": "https://arxiv.org/abs/2404.00200", "pdf": "https://arxiv.org/pdf/2404.00200", "title": "Managing power balance and reserve feasibility in the AC unit commitment  problem", "authors": "Robert Parker, Carleton Coffrin", "subjects": "Systems and Control (eess.SY); Optimization and Control (math.OC)", "abstract": "Incorporating the AC power flow equations into unit commitment models has the potential to avoid costly corrective actions required by less accurate power flow approximations. However, research on unit commitment with AC power flow constraints has been limited to a few relatively small test networks. This work investigates large-scale AC unit commitment problems for the day-ahead market and develops decomposition algorithms capable of obtaining high-quality solutions at industry-relevant scales. The results illustrate that a simple algorithm that only seeks to satisfy unit commitment, reserve, and AC power balance constraints can obtain surprisingly high-quality solutions to this AC unit commitment problem. However, a naive strategy that prioritizes reserve feasibility leads to AC infeasibility, motivating the need to design heuristics that can effectively balance reserve and AC feasibility. Finally, this work explores a parallel decomposition strategy that allows the proposed algorithm to obtain feasible solutions on large cases within the two hour time limit required by typical day-ahead market operations."}
{"main_page": "https://arxiv.org/abs/2404.00247", "pdf": "https://arxiv.org/pdf/2404.00247", "title": "Facilitating Reinforcement Learning for Process Control Using Transfer  Learning: Perspectives", "authors": "Runze Lin, Junghui Chen, Lei Xie, Hongye Su, Biao Huang", "subjects": "Systems and Control (eess.SY); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)", "abstract": "This paper provides insights into deep reinforcement learning (DRL) for process control from the perspective of transfer learning. We analyze the challenges of applying DRL in the field of process industries and the necessity of introducing transfer learning. Furthermore, recommendations and prospects are provided for future research directions on how transfer learning can be integrated with DRL to empower process control."}
{"main_page": "https://arxiv.org/abs/2404.00252", "pdf": "https://arxiv.org/pdf/2404.00252", "title": "Learned Scanpaths Aid Blind Panoramic Video Quality Assessment", "authors": "Kanglong Fan, Wen Wen, Mu Li, Yifan Peng, Kede Ma", "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV)", "abstract": "Panoramic videos have the advantage of providing an immersive and interactive viewing experience. Nevertheless, their spherical nature gives rise to various and uncertain user viewing behaviors, which poses significant challenges for panoramic video quality assessment (PVQA). In this work, we propose an end-to-end optimized, blind PVQA method with explicit modeling of user viewing patterns through visual scanpaths. Our method consists of two modules: a scanpath generator and a quality assessor. The scanpath generator is initially trained to predict future scanpaths by minimizing their expected code length and then jointly optimized with the quality assessor for quality prediction. Our blind PVQA method enables direct quality assessment of panoramic images by treating them as videos composed of identical frames. Experiments on three public panoramic image and video quality datasets, encompassing both synthetic and authentic distortions, validate the superiority of our blind PVQA model over existing methods."}
{"main_page": "https://arxiv.org/abs/2404.00253", "pdf": "https://arxiv.org/pdf/2404.00253", "title": "GreenSaliency: A Lightweight and Efficient Image Saliency Detection  Method", "authors": "Zhanxuan Mei, Yun-Cheng Wang, C.-C. Jay Kuo", "subjects": "Image and Video Processing (eess.IV)", "abstract": "Image saliency detection is crucial in understanding human gaze patterns from visual stimuli. The escalating demand for research in image saliency detection is driven by the growing necessity to incorporate such techniques into various computer vision tasks and to understand human visual systems. Many existing image saliency detection methods rely on deep neural networks (DNNs) to achieve good performance. However, the high computational complexity associated with these approaches impedes their integration with other modules or deployment on resource-constrained platforms, such as mobile devices. To address this need, we propose a novel image saliency detection method named GreenSaliency, which has a small model size, minimal carbon footprint, and low computational complexity. GreenSaliency can be a competitive alternative to the existing deep-learning-based (DL-based) image saliency detection methods with limited computation resources. GreenSaliency comprises two primary steps: 1) multi-layer hybrid feature extraction and 2) multi-path saliency prediction. Experimental results demonstrate that GreenSaliency achieves comparable performance to the state-of-the-art DL-based methods while possessing a considerably smaller model size and significantly reduced computational complexity."}
{"main_page": "https://arxiv.org/abs/2404.00327", "pdf": "https://arxiv.org/pdf/2404.00327", "title": "YNetr: Dual-Encoder architecture on Plain Scan Liver Tumors (PSLT)", "authors": "Wen Sheng, Zhong Zheng, Jiajun Liu, Han Lu, Hanyuan Zhang, Zhengyong Jiang, Zhihong Zhang, Daoping Zhu", "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)", "abstract": "Background: Liver tumors are abnormal growths in the liver that can be either benign or malignant, with liver cancer being a significant health concern worldwide. However, there is no dataset for plain scan segmentation of liver tumors, nor any related algorithms. To fill this gap, we propose Plain Scan Liver Tumors(PSLT) and YNetr. Methods: A collection of 40 liver tumor plain scan segmentation datasets was assembled and annotated. Concurrently, we utilized Dice coefficient as the metric for assessing the segmentation outcomes produced by YNetr, having advantage of capturing different frequency information. Results: The YNetr model achieved a Dice coefficient of 62.63% on the PSLT dataset, surpassing the other publicly available model by an accuracy margin of 1.22%. Comparative evaluations were conducted against a range of models including UNet 3+, XNet, UNetr, Swin UNetr, Trans-BTS, COTr, nnUNetv2 (2D), nnUNetv2 (3D fullres), MedNext (2D) and MedNext(3D fullres). Conclusions: We not only proposed a dataset named PSLT(Plain Scan Liver Tumors), but also explored a structure called YNetr that utilizes wavelet transform to extract different frequency information, which having the SOTA in PSLT by experiments."}
{"main_page": "https://arxiv.org/abs/2404.00352", "pdf": "https://arxiv.org/pdf/2404.00352", "title": "Dependability Evaluation of Stable Diffusion with Soft Errors on the  Model Parameters", "authors": "Zhen Gao, Lini Yuan, Pedro Reviriego, Shanshan Liu, Fabrizio Lombardi", "subjects": "Image and Video Processing (eess.IV)", "abstract": "Stable Diffusion is a popular Transformer-based model for image generation from text; it applies an image information creator to the input text and the visual knowledge is added in a step-by-step fashion to create an image that corresponds to the input text. However, this diffusion process can be corrupted by errors from the underlying hardware, which are especially relevant for implementations at the nanoscales. In this paper, the dependability of Stable Diffusion is studied focusing on soft errors in the memory that stores the model parameters; specifically, errors are injected into some critical layers of the Transformer in different blocks of the image information creator, to evaluate their impact on model performance. The simulations results reveal several conclusions: 1) errors on the down blocks of the creator have a larger impact on the quality of the generated images than those on the up blocks, while the errors on middle block have negligible effect; 2) errors on the self-attention (SA) layers have larger impact on the results than those on the cross-attention (CA) layers; 3) for CA layers, errors on deeper levels result in a larger impact; 4) errors on blocks at the first levels tend to introduce noise in the image, and those on deep layers tend to introduce large colored blocks. These results provide an initial understanding of the impact of errors on Stable Diffusion."}
{"main_page": "https://arxiv.org/abs/2404.00370", "pdf": "https://arxiv.org/pdf/2404.00370", "title": "Inverse Optimal Cardano-Lyapunov Feedback for PDEs with Convection", "authors": "Mohamed Camil Belhadjoudja, Miroslav Krstic, Mohamed Maghenem, Emmanuel Witrant", "subjects": "Systems and Control (eess.SY); Analysis of PDEs (math.AP); Optimization and Control (math.OC)", "abstract": "We consider the problem of inverse optimal control design for systems that are not affine in the control. In particular, we consider some classes of partial differential equations (PDEs) with quadratic convection and counter-convection, for which the L2 norm is a control Lyapunov function (CLF) whose derivative has either a depressed cubic or a quadratic dependence in the boundary control input. We also consider diffusive PDEs with or without linear convection, for which a weighted L2 norm is a CLF whose derivative has a quadratic dependence in the control input. For each structure on the derivative of the CLF, we achieve inverse optimality with respect to a meaningful cost functional. For the case where the derivative of the CLF has a depressed cubic dependence in the control, we construct a cost functional for which the unique minimizer is the unique real root of a cubic polynomial: the Cardano-Lyapunov controller. When the derivative of the CLF is quadratic in the control, we construct a cost functional that is minimized by two distinct feedback laws, that correspond to the two distinct real roots of a quadratic equation. We show how to switch from one root to the other to reduce the control effort."}
{"main_page": "https://arxiv.org/abs/2404.00394", "pdf": "https://arxiv.org/pdf/2404.00394", "title": "Analysis of Fairness-promoting Optimization Schemes of Photovoltaic  Curtailments for Voltage Regulation in Power Distribution Networks", "authors": "Rahul K. Gupta, Daniel K. Molzahn", "subjects": "Systems and Control (eess.SY)", "abstract": "Active power curtailment of photovoltaic (PV) generation is commonly exercised to mitigate over-voltage issues in power distribution networks. However, fairness concerns arise as certain PV plants may experience more significant curtailments than others depending on their locations within the network. Existing literature tackles this issue through fairness-promoting/aware optimization schemes. These schemes can be broadly categorized into two types. The first type maximizes an additional fairness objective along with the main objective of curtailment minimization. The second type is formulated as a feedback controller, where fairness is accounted for by assigning different weights (as feedback) in the curtailment minimization objective for each PV plant based on previous curtailment actions. In this work, we combine these two schemes and provide extensive analyses and comparisons of these two fairness schemes. We compare the performance in terms of fairness and net curtailments for several benchmark test networks."}
{"main_page": "https://arxiv.org/abs/2404.00432", "pdf": "https://arxiv.org/pdf/2404.00432", "title": "Flexible Variable-Rate Image Feature Compression for Edge-Cloud Systems", "authors": "Md Adnan Faisal Hossain, Zhihao Duan, Yuning Huang, Fengqing Zhu", "subjects": "Image and Video Processing (eess.IV)", "abstract": "Feature compression is a promising direction for coding for machines. Existing methods have made substantial progress, but they require designing and training separate neural network models to meet different specifications of compression rate, performance accuracy and computational complexity. In this paper, a flexible variable-rate feature compression method is presented that can operate on a range of rates by introducing a rate control parameter as an input to the neural network model. By compressing different intermediate features of a pre-trained vision task model, the proposed method can scale the encoding complexity without changing the overall size of the model. The proposed method is more flexible than existing baselines, at the same time outperforming them in terms of the three-way trade-off between feature compression rate, vision task accuracy, and encoding complexity. We have made the source code available at https://github.com/adnan-hossain/var_feat_comp.git."}
{"main_page": "https://arxiv.org/abs/2404.00434", "pdf": "https://arxiv.org/pdf/2404.00434", "title": "On Accessibility Fairness in Intermodal Autonomous Mobility-on-Demand  Systems", "authors": "Mauro Salazar, Sara Betancour Giraldo, Fabio Paparella, Leonardo Pedroso", "subjects": "Systems and Control (eess.SY)", "abstract": "Research on the operation of mobility systems so far has mostly focused on minimizing cost-centered metrics such as average travel time, distance driven, and operational costs. Whilst capturing economic indicators, such metrics do not account for transportation justice aspects. In this paper, we present an optimization model to plan the operation of Intermodal Autonomous Mobility-on-Demand (I-AMoD) systems, where self-driving vehicles provide on-demand mobility jointly with public transit and active modes, with the goal to minimize the accessibility unfairness experienced by the population. Specifically, we first leverage a previously developed network flow model to compute the I-AMoD system operation in a minimum-time manner. Second, we formally define accessibility unfairness, and use it to frame the maximum-accessibility-fairness problem and cast it as a linear program. We showcase our framework for a real-world case-study in the city of Eindhoven, NL. Our results show that it is possible to reach an operation that is on average fully fair at the cost of a slight travel time increase compared to a minimum-travel-time solution. Thereby we observe that the accessibility fairness of individual paths is, on average, worse than the average values obtained from flows, setting the stage for a discussion on the definition of accessibility fairness itself."}
{"main_page": "https://arxiv.org/abs/2404.00549", "pdf": "https://arxiv.org/pdf/2404.00549", "title": "Pneumonia App: a mobile application for efficient pediatric pneumonia  diagnosis using explainable convolutional neural networks (CNN)", "authors": "Jiaming Deng, Zhenglin Chen, Minjiang Chen, Lulu Xu, Jiaqi Yang, Zhendong Luo, Peiwu Qin", "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV)", "abstract": "Mycoplasma pneumoniae pneumonia (MPP) poses significant diagnostic challenges in pediatric healthcare, especially in regions like China where it's prevalent. We introduce PneumoniaAPP, a mobile application leveraging deep learning techniques for rapid MPP detection. Our approach capitalizes on convolutional neural networks (CNNs) trained on a comprehensive dataset comprising 3345 chest X-ray (CXR) images, which includes 833 CXR images revealing MPP and additionally augmented with samples from a public dataset. The CNN model achieved an accuracy of 88.20% and an AUROC of 0.9218 across all classes, with a specific accuracy of 97.64% for the mycoplasma class, as demonstrated on the testing dataset. Furthermore, we integrated explainability techniques into PneumoniaAPP to aid respiratory physicians in lung opacity localization. Our contribution extends beyond existing research by targeting pediatric MPP, emphasizing the age group of 0-12 years, and prioritizing deployment on mobile devices. This work signifies a significant advancement in pediatric pneumonia diagnosis, offering a reliable and accessible tool to alleviate diagnostic burdens in healthcare settings."}
{"main_page": "https://arxiv.org/abs/2404.00553", "pdf": "https://arxiv.org/pdf/2404.00553", "title": "Reduced-order Koopman modeling and predictive control of nonlinear  processes", "authors": "Xuewen Zhang, Minghao Han, Xunyuan Yin", "subjects": "Systems and Control (eess.SY)", "abstract": "In this paper, we propose an efficient data-driven predictive control approach for general nonlinear processes based on a reduced-order Koopman operator. A Kalman-based sparse identification of nonlinear dynamics method is employed to select lifting functions for Koopman identification. The selected lifting functions are used to project the original nonlinear state-space into a higher-dimensional linear function space, in which Koopman-based linear models can be constructed for the underlying nonlinear process. To curb the significant increase in the dimensionality of the resulting full-order Koopman models caused by the use of lifting functions, we propose a reduced-order Koopman modeling approach based on proper orthogonal decomposition. A computationally efficient linear robust predictive control scheme is established based on the reduced-order Koopman model. A case study on a benchmark chemical process is conducted to illustrate the effectiveness of the proposed method. Comprehensive comparisons are conducted to demonstrate the advantage of the proposed method."}
{"main_page": "https://arxiv.org/abs/2404.00558", "pdf": "https://arxiv.org/pdf/2404.00558", "title": "GAN with Skip Patch Discriminator for Biological Electron Microscopy  Image Generation", "authors": "Nishith Ranjon Roy, Nailah Rawnaq, Tulin Kaman", "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV)", "abstract": "Generating realistic electron microscopy (EM) images has been a challenging problem due to their complex global and local structures. Isola et al. proposed pix2pix, a conditional Generative Adversarial Network (GAN), for the general purpose of image-to-image translation; which fails to generate realistic EM images. We propose a new architecture for the discriminator in the GAN providing access to multiple patch sizes using skip patches and generating realistic EM images."}
{"main_page": "https://arxiv.org/abs/2404.00559", "pdf": "https://arxiv.org/pdf/2404.00559", "title": "Hierarchical Climate Control Strategy for Electric Vehicles with  Door-Opening Consideration", "authors": "Sanghyeon Nam, Hyejin Lee, Youngki Kim, Kyoung hyun Kwak, Kyoungseok Han", "subjects": "Systems and Control (eess.SY)", "abstract": "This study proposes a novel climate control strategy for electric vehicles (EVs) by addressing door-opening interruptions, an overlooked aspect in EV thermal management. We create and validate an EV simulation model that incorporates door-opening scenarios. Three controllers are compared using the simulation model: (i) a hierarchical non-linear model predictive control (NMPC) with a unique coolant dividing layer and a component for cabin air inflow regulation based on door-opening signals; (ii) a single MPC controller; and (iii) a rule-based controller. The hierarchical controller outperforms, reducing door-opening temperature drops by 46.96% and 51.33% compared to single layer MPC and rule-based methods in the relevant section. Additionally, our strategy minimizes the maximum temperature gaps between the sections during recovery by 86.4% and 78.7%, surpassing single layer MPC and rule-based approaches, respectively. We believe that this result opens up future possibilities for incorporating the thermal comfort of passengers across all sections within the vehicle."}
{"main_page": "https://arxiv.org/abs/2404.00582", "pdf": "https://arxiv.org/pdf/2404.00582", "title": "Complex Neural Network based Joint AoA and AoD Estimation for Bistatic  ISAC", "authors": "Salmane Naoumi, Ahmad Bazzi, Roberto Bomfin, Marwa Chafii", "subjects": "Signal Processing (eess.SP)", "abstract": "Integrated sensing and communication (ISAC) in wireless systems has emerged as a promising paradigm, offering the potential for improved performance, efficient resource utilization, and mutually beneficial interactions between radar sensing and wireless communications, thereby shaping the future of wireless technologies. In this work, we present two novel methods to address the joint angle of arrival and angle of departure estimation problem for bistatic ISAC systems. Our proposed methods consist of a deep learning (DL) solution leveraging complex neural networks, in addition to a parameterized algorithm. By exploiting the estimated channel matrix and incorporating a preprocessing step consisting of a coarse timing estimation, we are able to notably reduce the input size and improve the computational efficiency. In our findings, we emphasize the remarkable potential of our DL-based approach, which demonstrates comparable performance to the parameterized method that explicitly exploits the multiple-input multiple-output (MIMO) model, while exhibiting significantly lower computational complexity."}
{"main_page": "https://arxiv.org/abs/2404.00625", "pdf": "https://arxiv.org/pdf/2404.00625", "title": "Scalable second-order consensus of hierarchical groups", "authors": "Jiamin Wang, Jian Liu, Feng Xiao, Ning Xi, Yuanshi Zheng", "subjects": "Systems and Control (eess.SY)", "abstract": "Motivated by widespread dominance hierarchy, growth of group sizes, and feedback mechanisms in social species, we are devoted to exploring the scalable second-order consensus of hierarchical groups. More specifically, a hierarchical group consists of a collection of agents with double-integrator dynamics on a directed acyclic graph with additional reverse edges, which characterize feedback mechanisms across hierarchical layers. As the group size grows and the reverse edges appear, we investigate whether the absolute velocity protocol and the relative velocity protocol can preserve the system consensus property without tuning the control gains. It is rigorously proved that the absolute velocity protocol is able to achieve completely scalable second-order consensus but the relative velocity protocol cannot. This result theoretically reveals how the scalable coordination behavior in hierarchical groups is determined by local interaction rules. Moreover, we develop a hierarchical structure in order to achieve scalable second-order consensus for networks of any size and with any number of reverse edges."}
{"main_page": "https://arxiv.org/abs/2404.00685", "pdf": "https://arxiv.org/pdf/2404.00685", "title": "Scaling Properties of Speech Language Models", "authors": "Santiago Cuervo, Ricard Marxer", "subjects": "Audio and Speech Processing (eess.AS); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Neural and Evolutionary Computing (cs.NE)", "abstract": "Speech Language Models (SLMs) aim to learn language from raw audio, without textual resources. Despite significant advances, our current models exhibit weak syntax and semantic abilities. However, if the scaling properties of neural language models hold for the speech modality, these abilities will improve as the amount of compute used for training increases. In this paper, we use models of this scaling behavior to estimate the scale at which our current methods will yield a SLM with the English proficiency of text-based Large Language Models (LLMs). We establish a strong correlation between pre-training loss and downstream syntactic and semantic performance in SLMs and LLMs, which results in predictable scaling of linguistic performance. We show that the linguistic performance of SLMs scales up to three orders of magnitude more slowly than that of text-based LLMs. Additionally, we study the benefits of synthetic data designed to boost semantic understanding and the effects of coarser speech tokenization."}
{"main_page": "https://arxiv.org/abs/2404.00726", "pdf": "https://arxiv.org/pdf/2404.00726", "title": "MugenNet: A Novel Combined Convolution Neural Network and Transformer  Network with its Application for Colonic Polyp Image Segmentation", "authors": "Chen Peng, Zhiqin Qian, Kunyu Wang, Qi Luo, Zhuming Bi, Wenjun Zhang", "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)", "abstract": "Biomedical image segmentation is a very important part in disease diagnosis. The term \"colonic polyps\" refers to polypoid lesions that occur on the surface of the colonic mucosa within the intestinal lumen. In clinical practice, early detection of polyps is conducted through colonoscopy examinations and biomedical image processing. Therefore, the accurate polyp image segmentation is of great significance in colonoscopy examinations. Convolutional Neural Network (CNN) is a common automatic segmentation method, but its main disadvantage is the long training time. Transformer utilizes a self-attention mechanism, which essentially assigns different importance weights to each piece of information, thus achieving high computational efficiency during segmentation. However, a potential drawback is the risk of information loss. In the study reported in this paper, based on the well-known hybridization principle, we proposed a method to combine CNN and Transformer to retain the strengths of both, and we applied this method to build a system called MugenNet for colonic polyp image segmentation. We conducted a comprehensive experiment to compare MugenNet with other CNN models on five publicly available datasets. The ablation experiment on MugentNet was conducted as well. The experimental results show that MugenNet achieves significantly higher processing speed and accuracy compared with CNN alone. The generalized implication with our work is a method to optimally combine two complimentary methods of machine learning."}
{"main_page": "https://arxiv.org/abs/2404.00729", "pdf": "https://arxiv.org/pdf/2404.00729", "title": "Nonparametric End-to-End Probabilistic Forecasting of Distributed  Generation Outputs Considering Missing Data Imputation", "authors": "Minghui Chen, Zichao Meng, Yanping Liu, Longbo Luo, Ye Guo, Kang Wang", "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG)", "abstract": "In this paper, we introduce a nonparametric end-to-end method for probabilistic forecasting of distributed renewable generation outputs while including missing data imputation. Firstly, we employ a nonparametric probabilistic forecast model utilizing the long short-term memory (LSTM) network to model the probability distributions of distributed renewable generations' outputs. Secondly, we design an end-to-end training process that includes missing data imputation through iterative imputation and iterative loss-based training procedures. This two-step modeling approach effectively combines the strengths of the nonparametric method with the end-to-end approach. Consequently, our approach demonstrates exceptional capabilities in probabilistic forecasting for the outputs of distributed renewable generations while effectively handling missing values. Simulation results confirm the superior performance of our approach compared to existing alternatives."}
{"main_page": "https://arxiv.org/abs/2404.00767", "pdf": "https://arxiv.org/pdf/2404.00767", "title": "Intensity-based 3D motion correction for cardiac MR images", "authors": "Nil Stolt-Ansó, Vasiliki Sideri-Lampretsa, Maik Dannecker, Daniel Rueckert", "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV)", "abstract": "Cardiac magnetic resonance (CMR) image acquisition requires subjects to hold their breath while 2D cine images are acquired. This process assumes that the heart remains in the same position across all slices. However, differences in breathhold positions or patient motion introduce 3D slice misalignments. In this work, we propose an algorithm that simultaneously aligns all SA and LA slices by maximizing the pair-wise intensity agreement between their intersections. Unlike previous works, our approach is formulated as a subject-specific optimization problem and requires no prior knowledge of the underlying anatomy. We quantitatively demonstrate that the proposed method is robust against a large range of rotations and translations by synthetically misaligning 10 motion-free datasets and aligning them back using the proposed method."}
{"main_page": "https://arxiv.org/abs/2404.00780", "pdf": "https://arxiv.org/pdf/2404.00780", "title": "Cooperative Communication Based Gradient Coding for Wireless Federated  Learning", "authors": "Shudi Weng, Chengxi Li, Ming Xiao, Mikael Skoglund", "subjects": "Signal Processing (eess.SP)", "abstract": "We investigate wireless federated learning (FL) in the presence of stragglers, where the power-constrained wireless devices collaboratively train a global model on their local datasets %within a time constraint and transmit local model updates through fading channels. To tackle stragglers resulting from link disruptions without requiring accurate prior information on connectivity or dataset sharing, we propose a gradient coding (GC) scheme based on cooperative communication. Subsequently, we conduct an outage analysis of the proposed scheme, based on which we conduct the convergence analysis. The simulation results reveal the superiority of the proposed strategy in the presence of stragglers, especially in low signal-to-noise ratio (SNR) scenarios."}
{"main_page": "https://arxiv.org/abs/2404.00809", "pdf": "https://arxiv.org/pdf/2404.00809", "title": "Heterogeneity over Homogeneity: Investigating Multilingual Speech  Pre-Trained Models for Detecting Audio Deepfake", "authors": "Orchid Chetia Phukan, Gautam Siddharth Kashyap, Arun Balaji Buduru, Rajesh Sharma", "subjects": "Audio and Speech Processing (eess.AS)", "abstract": "In this work, we investigate multilingual speech Pre-Trained models (PTMs) for Audio deepfake detection (ADD). We hypothesize that multilingual PTMs trained on large-scale diverse multilingual data gain knowledge about diverse pitches, accents, and tones, during their pre-training phase and making them more robust to variations. As a result, they will be more effective for detecting audio deepfakes. To validate our hypothesis, we extract representations from state-of-the-art (SOTA) PTMs including monolingual, multilingual as well as PTMs trained for speaker and emotion recognition, and evaluated them on ASVSpoof 2019 (ASV), In-the-Wild (ITW), and DECRO benchmark databases. We show that representations from multilingual PTMs, with simple downstream networks, attain the best performance for ADD compared to other PTM representations, which validates our hypothesis. We also explore the possibility of fusion of selected PTM representations for further improvements in ADD, and we propose a framework, MiO (Merge into One) for this purpose. With MiO, we achieve SOTA performance on ASV and ITW and comparable performance on DECRO with current SOTA works."}
{"main_page": "https://arxiv.org/abs/2404.00827", "pdf": "https://arxiv.org/pdf/2404.00827", "title": "SONIC: Synergizing VisiON Foundation Models for Stress RecogNItion from  ECG signals", "authors": "Orchid Chetia Phukan, Ankita Das, Arun Balaji Buduru, Rajesh Sharma", "subjects": "Signal Processing (eess.SP)", "abstract": "Stress recognition through physiological signals such as Electrocardiogram (ECG) signals has garnered significant attention. Traditionally, research in this field predominantly focused on utilizing handcrafted features or raw signals as inputs for learning algorithms. However, there is now a burgeoning interest within the community in leveraging large-scale vision foundation models (VFMs) like ResNet50, VGG19, and others. These VFMs are increasingly preferred due to their ability to capture complex features, enhancing the accuracy and effectiveness of stress recognition systems. However, no particular focus has been given on combining these VFMs. The combination of VFMs offers promising benefits by harnessing their collective knowledge to extract richer representations for improved stress recognition. So, to mitigate this research gap, we focus on combining different VFMs for stress recognition from ECG and propose SONIC, a novel framework that combines VFMs through their logits and training a fully connected network on the combined logits. Through extensive experimentation, SONIC showed the top performance against individual VFMs performance on the WESAD benchmark. With SONIC, we report state-of-the-art (SOTA) performance in WESAD with 99.36% and 99.24% (stress vs non-stress) and 97.66% and 97.10% (amusement vs stress vs baseline) in accuracy and F1 respectively."}
{"main_page": "https://arxiv.org/abs/2404.00837", "pdf": "https://arxiv.org/pdf/2404.00837", "title": "Automated HER2 Scoring in Breast Cancer Images Using Deep Learning and  Pyramid Sampling", "authors": "Sahan Yoruc Selcuk, Xilin Yang, Bijie Bai, Yijie Zhang, Yuzhu Li, Musa Aydin, Aras Firat Unal, Aditya Gomatam, Zhen Guo, Darrow Morgan Angus, Goren Kolodney, Karine Atlan, Tal Keidar Haran, Nir Pillar, Aydogan Ozcan", "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Medical Physics (physics.med-ph)", "abstract": "Human epidermal growth factor receptor 2 (HER2) is a critical protein in cancer cell growth that signifies the aggressiveness of breast cancer (BC) and helps predict its prognosis. Accurate assessment of immunohistochemically (IHC) stained tissue slides for HER2 expression levels is essential for both treatment guidance and understanding of cancer mechanisms. Nevertheless, the traditional workflow of manual examination by board-certified pathologists encounters challenges, including inter- and intra-observer inconsistency and extended turnaround times. Here, we introduce a deep learning-based approach utilizing pyramid sampling for the automated classification of HER2 status in IHC-stained BC tissue images. Our approach analyzes morphological features at various spatial scales, efficiently managing the computational load and facilitating a detailed examination of cellular and larger-scale tissue-level details. This method addresses the tissue heterogeneity of HER2 expression by providing a comprehensive view, leading to a blind testing classification accuracy of 84.70%, on a dataset of 523 core images from tissue microarrays. Our automated system, proving reliable as an adjunct pathology tool, has the potential to enhance diagnostic precision and evaluation speed, and might significantly impact cancer treatment planning."}
{"main_page": "https://arxiv.org/abs/2404.00850", "pdf": "https://arxiv.org/pdf/2404.00850", "title": "Delay-Induced Watermarking for Detection of Replay Attacks in Linear  Systems", "authors": "Christoforos Somarakis, Raman Goyal, Erfaun Noorani, Shantanu Rane", "subjects": "Systems and Control (eess.SY); Cryptography and Security (cs.CR)", "abstract": "A state-feedback watermarking signal design for the detection of replay attacks in linear systems is proposed. The control input is augmented with a random time-delayed term of the system state estimate, in order to secure the system against attacks of replay type. We outline the basic analysis of the closed-loop response of the state-feedback watermarking in a LQG controlled system. Our theoretical results are applied on a temperature process control example. While the proposed secure control scheme requires very involved analysis, it, nevertheless, holds promise of being superior to conventional, feed-forward, watermarking schemes, in both its ability to detect attacks as well as the secured system performance."}
{"main_page": "https://arxiv.org/abs/2404.00861", "pdf": "https://arxiv.org/pdf/2404.00861", "title": "Enhancing Real-World Active Speaker Detection with Multi-Modal  Extraction Pre-Training", "authors": "Ruijie Tao, Xinyuan Qian, Rohan Kumar Das, Xiaoxue Gao, Jiadong Wang, Haizhou Li", "subjects": "Audio and Speech Processing (eess.AS); Image and Video Processing (eess.IV)", "abstract": "Audio-visual active speaker detection (AV-ASD) aims to identify which visible face is speaking in a scene with one or more persons. Most existing AV-ASD methods prioritize capturing speech-lip correspondence. However, there is a noticeable gap in addressing the challenges from real-world AV-ASD scenarios. Due to the presence of low-quality noisy videos in such cases, AV-ASD systems without a selective listening ability are short of effectively filtering out disruptive voice components from mixed audio inputs. In this paper, we propose a Multi-modal Speaker Extraction-to-Detection framework named `MuSED', which is pre-trained with audio-visual target speaker extraction to learn the denoising ability, then it is fine-tuned with the AV-ASD task. Meanwhile, to better capture the multi-modal information and deal with real-world problems such as missing modality, MuSED is modelled on the time domain directly and integrates the multi-modal plus-and-minus augmentation strategy. Our experiments demonstrate that MuSED substantially outperforms the state-of-the-art AV-ASD methods and achieves 95.6% mAP on the AVA-ActiveSpeaker dataset, 98.3% AP on the ASW dataset, and 97.9% F1 on the Columbia AV-ASD dataset, respectively. We will publicly release the code in due course."}
{"main_page": "https://arxiv.org/abs/2404.00863", "pdf": "https://arxiv.org/pdf/2404.00863", "title": "Voice Conversion Augmentation for Speaker Recognition on Defective  Datasets", "authors": "Ruijie Tao, Zhan Shi, Yidi Jiang, Tianchi Liu, Haizhou Li", "subjects": "Audio and Speech Processing (eess.AS)", "abstract": "Modern speaker recognition system relies on abundant and balanced datasets for classification training. However, diverse defective datasets, such as partially-labelled, small-scale, and imbalanced datasets, are common in real-world applications. Previous works usually studied specific solutions for each scenario from the algorithm perspective. However, the root cause of these problems lies in dataset imperfections. To address these challenges with a unified solution, we propose the Voice Conversion Augmentation (VCA) strategy to obtain pseudo speech from the training set. Furthermore, to guarantee generation quality, we designed the VCA-NN~(nearest neighbours) strategy to select source speech from utterances that are close to the target speech in the representation space. Our experimental results on three created datasets demonstrated that VCA-NN effectively mitigates these dataset problems, which provides a new direction for handling the speaker recognition problems from the data aspect."}
{"main_page": "https://arxiv.org/abs/2404.00896", "pdf": "https://arxiv.org/pdf/2404.00896", "title": "A Novel Algorithm for Digital Lithological Mapping-Case Studies in Sri  Lanka's Mineral Exploration", "authors": "R.M.L.S. Ramanayake, D. Fernando, D. Wickramasinghe, D.Y.L. Ranasinghe, G.M.R.I. Godaliyadda, H.M.V.R. Herath, M.P.B. Ekanayake, A. Senaratne, Fadi Kizel", "subjects": "Image and Video Processing (eess.IV)", "abstract": "Conventional manual lithological mapping (MLM) through field surveys are resource-extensive and time-consuming. Digital lithological mapping (DLM), harnessing remotely sensed spectral imaging techniques, provides an effective strategy to streamline target locations for MLM or an efficient alternative to MLM. DLM relies on laboratory-generated generic end-member signatures of minerals for spectral analysis. Thus, the accuracy of DLM may be limited due to the presence of site-specific impurities. A strategy, based on a hybrid machine-learning and signal-processing algorithm, is proposed in this paper to tackle this problem of site-specific impurities. In addition, a soil pixel alignment strategy is proposed here to visualize the relative purity of the target minerals. The proposed methodologies are validated via case studies for mapping of Limestone deposits in Jaffna, Ilmenite deposits in Pulmoddai and Mannar, and Montmorillonite deposits in Murunkan, Sri Lanka. The results of satellite-based spectral imaging analysis were corroborated with X-ray diffraction (XRD) and Magnetic Separation (MS) analysis of soil samples collected from those sites via field surveys. There exists a good correspondence between the relative availability of the minerals with the XRD and MS results. In particular, correlation coefficients of 0.8115 and 0.9853 were found for the sites in Pulmoddai and Jaffna respectively."}
{"main_page": "https://arxiv.org/abs/2404.00951", "pdf": "https://arxiv.org/pdf/2404.00951", "title": "Adapting CSI-Guided Imaging Across Diverse Environments: An Experimental  Study Leveraging Continuous Learning", "authors": "Cheng Chen, Shoki Ohta, Takayuki Nishio, Mohamed Wahib", "subjects": "Image and Video Processing (eess.IV)", "abstract": "This study explores the feasibility of adapting CSI-guided imaging across varied environments. Focusing on continuous model learning through continuous updates, we investigate CSI-Imager's adaptability in dynamically changing settings, specifically transitioning from an office to an industrial environment. Unlike traditional approaches that may require retraining for new environments, our experimental study aims to validate the potential of CSI-guided imaging to maintain accurate imaging performance through Continuous Learning (CL). By conducting experiments across different scenarios and settings, this work contributes to understanding the limitations and capabilities of existing CSI-guided imaging systems in adapting to new environmental contexts."}
{"main_page": "https://arxiv.org/abs/2404.00954", "pdf": "https://arxiv.org/pdf/2404.00954", "title": "Digital Twins for Supporting AI Research with Autonomous Vehicle  Networks", "authors": "Anıl Gürses, Gautham Reddy, Saad Masrur, Özgür Özdemir, İsmail Güvenç, Mihail L. Sichitiu, Alphan Şahin, Ahmed Alkhateeb, Rudra Dutta", "subjects": "Signal Processing (eess.SP); Networking and Internet Architecture (cs.NI)", "abstract": "Digital twins (DTs), which are virtual environments that simulate, predict, and optimize the performance of their physical counterparts, are envisioned to be essential technologies for advancing next-generation wireless networks. While DTs have been studied extensively for wireless networks, their use in conjunction with autonomous vehicles with programmable mobility remains relatively under-explored. In this paper, we study DTs used as a development environment to design, deploy, and test artificial intelligence (AI) techniques that use real-time observations, e.g. radio key performance indicators, for vehicle trajectory and network optimization decisions in an autonomous vehicle networks (AVN). We first compare and contrast the use of simulation, digital twin (software in the loop (SITL)), sandbox (hardware-in-the-loop (HITL)), and physical testbed environments for their suitability in developing and testing AI algorithms for AVNs. We then review various representative use cases of DTs for AVN scenarios. Finally, we provide an example from the NSF AERPAW platform where a DT is used to develop and test AI-aided solutions for autonomous unmanned aerial vehicles for localizing a signal source based solely on link quality measurements. Our results in the physical testbed show that SITL DTs, when supplemented with data from real-world (RW) measurements and simulations, can serve as an ideal environment for developing and testing innovative AI solutions for AVNs."}
{"main_page": "https://arxiv.org/abs/2404.00961", "pdf": "https://arxiv.org/pdf/2404.00961", "title": "Orchestrating UAVs for Prioritized Data Harvesting: A Cross-Layer  Optimization Perspective", "authors": "Bharath Keshavamurthy, Nicolo Michelusi", "subjects": "Systems and Control (eess.SY)", "abstract": "This work describes the orchestration of a fleet of rotary-wing Unmanned Aerial Vehicles (UAVs) for harvesting prioritized traffic from random distributions of heterogeneous users with Multiple Input Multiple Output (MIMO) capabilities. In a finite-horizon offline setting, the goal is to optimize the beam-forming design, the 3D UAV positioning and trajectory solution, and the user association/scheduling policy, to maximize the cumulative fleet-wide reward obtained by satisfying the quality-of-service mandates imposed on each user uplink request, subject to an average per-UAV mobility power constraint. With a probabilistic air-to-ground channel model, a multi-user MIMO uplink communication model with prioritized traffic, and a novel 3D mobility model for rotary-wing UAVs, the fleet-wide reward maximization problem is solved via a cross-layer optimization framework: first, K-means clustering is employed to obtain user clusters; then, equipped with a zero-forcing beam-forming design, the positions of the UAVs are optimized via two-stage grid search; next, treating these optimal positions as the graph vertices of a fully-connected mesh, the 3D UAV trajectories (i.e., graph edges) are designed via a learning based competitive swarm optimization algorithm, under an average UAV power consumption constraint, coupled with projected subgradient ascent for dual optimization; consequently, the user association/scheduling strategy is solved via a graphical branch-and-bound method on the underlying multiple traveling salesman problem. Numerical evaluations demonstrate that the proposed solution outperforms static UAV deployments, adaptive Voronoi decomposition techniques, and state-of-the-art iterative fleet control algorithms, with respect to user quality-of-service and per-UAV average power consumption."}
{"main_page": "https://arxiv.org/abs/2404.00968", "pdf": "https://arxiv.org/pdf/2404.00968", "title": "Optimal Bidding Strategies in Network-Constrained Demand Response: A  Distributed Aggregative Game Theoretic Approach", "authors": "Xiupeng Chen, Jacquelien M. A. Scherpen, Nima Monshizadeh", "subjects": "Systems and Control (eess.SY)", "abstract": "Demand response has been a promising solution for accommodating renewable energy in power systems. In this study, we consider a demand response scheme within a distribution network facing an energy supply deficit. The utility company incentivizes load aggregators to adjust their pre-scheduled energy consumption and generation to match the supply. Each aggregator, which represents a group of prosumers, aims to maximize its revenue by bidding strategically in the demand response scheme. Since aggregators act in their own self-interest and their revenues and feasible bids influence one another, we model their competition as a network-constrained aggregative game. This model incorporates power flow constraints to prevent potential line congestion. Given that there are no coordinators and aggregators can only communicate with their neighbours, we introduce a fully distributed generalized Nash equilibrium seeking algorithm to determine the optimal bidding strategies for aggregators in this game. Within this algorithm, only estimates of the aggregate and certain auxiliary variables are communicated among neighbouring aggregators. We demonstrate the convergence of this algorithm by constructing an equivalent iteration using the forward-backward splitting technique."}
{"main_page": "https://arxiv.org/abs/2404.00982", "pdf": "https://arxiv.org/pdf/2404.00982", "title": "Wideband Channel Capacity Maximization With Beyond Diagonal RIS  Reflection Matrices", "authors": "Özlem Tuğfe Demir, Emil Björnson", "subjects": "Signal Processing (eess.SP); Information Theory (cs.IT)", "abstract": "Following the promising beamforming gains offered by reconfigurable intelligent surfaces (RISs), a new hardware architecture, known as \\emph{beyond diagonal RIS (BD-RIS)}, has recently been proposed. This architecture enables controllable signal flows between the RIS elements, thereby providing greater design flexibility. However, the physics-imposed symmetry and orthogonality conditions on the non-diagonal reflection matrix make the design challenging. In this letter, we analyze how a BD-RIS can improve a wideband channel, starting from fundamental principles and deriving the capacity. Our analysis considers the effects of various channel taps and their frequency-domain characteristics. We introduce a new algorithm designed to optimize the configuration of the BD-RIS to maximize wideband capacity. The proposed algorithm has better performance than the benchmarks. A BD-RIS is beneficial compared to a conventional RIS in the absence of static path or when the Rician $\\kappa$-factor is smaller than $10$."}
{"main_page": "https://arxiv.org/abs/2404.01033", "pdf": "https://arxiv.org/pdf/2404.01033", "title": "KazEmoTTS: A Dataset for Kazakh Emotional Text-to-Speech Synthesis", "authors": "Adal Abilbekov, Saida Mussakhojayeva, Rustem Yeshpanov, Huseyin Atakan Varol", "subjects": "Audio and Speech Processing (eess.AS)", "abstract": "This study focuses on the creation of the KazEmoTTS dataset, designed for emotional Kazakh text-to-speech (TTS) applications. KazEmoTTS is a collection of 54,760 audio-text pairs, with a total duration of 74.85 hours, featuring 34.23 hours delivered by a female narrator and 40.62 hours by two male narrators. The list of the emotions considered include \"neutral\", \"angry\", \"happy\", \"sad\", \"scared\", and \"surprised\". We also developed a TTS model trained on the KazEmoTTS dataset. Objective and subjective evaluations were employed to assess the quality of synthesized speech, yielding an MCD score within the range of 6.02 to 7.67, alongside a MOS that spanned from 3.51 to 3.57. To facilitate reproducibility and inspire further research, we have made our code, pre-trained model, and dataset accessible in our GitHub repository."}
{"main_page": "https://arxiv.org/abs/2404.01066", "pdf": "https://arxiv.org/pdf/2404.01066", "title": "Steering game dynamics towards desired outcomes", "authors": "Ilayda Canyakmaz, Iosif Sakos, Wayne Lin, Antonios Varvitsiotis, Georgios Piliouras", "subjects": "Systems and Control (eess.SY); Computer Science and Game Theory (cs.GT)", "abstract": "The dynamic behavior of agents in games, which captures how their strategies evolve over time based on past interactions, can lead to a spectrum of undesirable behaviors, ranging from non-convergence to Nash equilibria to the emergence of limit cycles and chaos. To mitigate the effects of selfish behavior, central planners can use dynamic payments to guide strategic multi-agent systems toward stability and socially optimal outcomes. However, the effectiveness of such interventions critically relies on accurately predicting agents' responses to incentives and dynamically adjusting payments so that the system is guided towards the desired outcomes. These challenges are further amplified in real-time applications where the dynamics are unknown and only scarce data is available. To tackle this challenge, in this work we introduce the SIAR-MPC method, combining the recently introduced Side Information Assisted Regression (SIAR) method for system identification with Model Predictive Control (MPC). SIAR utilizes side-information constraints inherent to game theoretic applications to model agent responses to payments from scarce data, while MPC uses this model to facilitate dynamic payment adjustments. Our experiments demonstrate the efficiency of SIAR-MPC in guiding the system towards socially optimal equilibria, stabilizing chaotic behaviors, and avoiding specified regions of the state space. Comparative analyses in data-scarce settings show SIAR-MPC's superior performance over pairing MPC with Physics Informed Neural Networks (PINNs), a powerful system identification method that finds models satisfying specific constraints."}
{"main_page": "https://arxiv.org/abs/2404.01082", "pdf": "https://arxiv.org/pdf/2404.01082", "title": "The state-of-the-art in Cardiac MRI Reconstruction: Results of the  CMRxRecon Challenge in MICCAI 2023", "authors": "Jun Lyu, Chen Qin, Shuo Wang, Fanwen Wang, Yan Li, Zi Wang, Kunyuan Guo, Cheng Ouyang, Michael Tänzer, Meng Liu, Longyu Sun, Mengting Sun, Qin Li, Zhang Shi, Sha Hua, Hao Li, Zhensen Chen, Zhenlin Zhang, Bingyu Xin, Dimitris N. Metaxas, George Yiasemis, Jonas Teuwen, Liping Zhang, Weitian Chen, Yanwei Pang, Xiaohan Liu, Artem Razumov, Dmitry V. Dylov, Quan Dou, Kang Yan, Yuyang Xue, Yuning Du, Julia Dietlmeier, Carles Garcia-Cabrera, Ziad Al-Haj Hemidi, Nora Vogt, Ziqiang Xu, Yajing Zhang, Ying-Hua Chu, Weibo Chen, Wenjia Bai, Xiahai Zhuang, Jing Qin, Lianmin Wu, Guang Yang, Xiaobo Qu, He Wang, Chengyan Wang", "subjects": "Image and Video Processing (eess.IV)", "abstract": "Cardiac MRI, crucial for evaluating heart structure and function, faces limitations like slow imaging and motion artifacts. Undersampling reconstruction, especially data-driven algorithms, has emerged as a promising solution to accelerate scans and enhance imaging performance using highly under-sampled data. Nevertheless, the scarcity of publicly available cardiac k-space datasets and evaluation platform hinder the development of data-driven reconstruction algorithms. To address this issue, we organized the Cardiac MRI Reconstruction Challenge (CMRxRecon) in 2023, in collaboration with the 26th International Conference on MICCAI. CMRxRecon presented an extensive k-space dataset comprising cine and mapping raw data, accompanied by detailed annotations of cardiac anatomical structures. With overwhelming participation, the challenge attracted more than 285 teams and over 600 participants. Among them, 22 teams successfully submitted Docker containers for the testing phase, with 7 teams submitted for both cine and mapping tasks. All teams use deep learning based approaches, indicating that deep learning has predominately become a promising solution for the problem. The first-place winner of both tasks utilizes the E2E-VarNet architecture as backbones. In contrast, U-Net is still the most popular backbone for both multi-coil and single-coil reconstructions. This paper provides a comprehensive overview of the challenge design, presents a summary of the submitted results, reviews the employed methods, and offers an in-depth discussion that aims to inspire future advancements in cardiac MRI reconstruction models. The summary emphasizes the effective strategies observed in Cardiac MRI reconstruction, including backbone architecture, loss function, pre-processing techniques, physical modeling, and model complexity, thereby providing valuable insights for further developments in this field."}
{"main_page": "https://arxiv.org/abs/2404.01088", "pdf": "https://arxiv.org/pdf/2404.01088", "title": "GI-Free Pilot-Aided Channel Estimation for Affine Frequency Division  Multiplexing Systems", "authors": "Yu Zhou, Haoran Yin, Nanhao Zhou, Yanqun Tang, Xiaoying Zhang, Weijie Yuan", "subjects": "Signal Processing (eess.SP)", "abstract": "The recently developed affine frequency division multiplexing (AFDM) can achieve full diversity in doubly selective channels, providing a comprehensive sparse representation of the delay-Doppler domain channel. Thus, accurate channel estimation is feasible by using just one pilot symbol. However, traditional AFDM channel estimation schemes necessitate the use of guard intervals (GI) to mitigate data-pilot interference, leading to spectral efficiency degradation. In this paper, we propose a GI-free pilot-aided channel estimation algorithm for AFDM systems, which improves spectral efficiency significantly. To mitigate the interference between the pilot and data symbols caused by the absence of GI, we perform joint interference cancellation, channel estimation, and signal detection iterately. Simulation results show that the bit error rate (BER) performance of the proposed method can approach the ideal case with perfect channel estimation."}
{"main_page": "https://arxiv.org/abs/2404.01100", "pdf": "https://arxiv.org/pdf/2404.01100", "title": "Finite Sample Frequency Domain Identification", "authors": "Anastasios Tsiamis, Mohamed Abdalmoaty, Roy S. Smith, John Lygeros", "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG); Optimization and Control (math.OC); Machine Learning (stat.ML)", "abstract": "We study non-parametric frequency-domain system identification from a finite-sample perspective. We assume an open loop scenario where the excitation input is periodic and consider the Empirical Transfer Function Estimate (ETFE), where the goal is to estimate the frequency response at certain desired (evenly-spaced) frequencies, given input-output samples. We show that under sub-Gaussian colored noise (in time-domain) and stability assumptions, the ETFE estimates are concentrated around the true values. The error rate is of the order of $\\mathcal{O}((d_{\\mathrm{u}}+\\sqrt{d_{\\mathrm{u}}d_{\\mathrm{y}}})\\sqrt{M/N_{\\mathrm{tot}}})$, where $N_{\\mathrm{tot}}$ is the total number of samples, $M$ is the number of desired frequencies, and $d_{\\mathrm{u}},\\,d_{\\mathrm{y}}$ are the dimensions of the input and output signals respectively. This rate remains valid for general irrational transfer functions and does not require a finite order state-space representation. By tuning $M$, we obtain a $N_{\\mathrm{tot}}^{-1/3}$ finite-sample rate for learning the frequency response over all frequencies in the $ \\mathcal{H}_{\\infty}$ norm. Our result draws upon an extension of the Hanson-Wright inequality to semi-infinite matrices. We study the finite-sample behavior of ETFE in simulations."}
{"main_page": "https://arxiv.org/abs/2404.01102", "pdf": "https://arxiv.org/pdf/2404.01102", "title": "Diffusion based Zero-shot Medical Image-to-Image Translation for Cross  Modality Segmentation", "authors": "Zihao Wang, Yingyu Yang, Yuzhou Chen, Tingting Yuan, Maxime Sermesant, Herve Delingette", "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)", "abstract": "Cross-modality image segmentation aims to segment the target modalities using a method designed in the source modality. Deep generative models can translate the target modality images into the source modality, thus enabling cross-modality segmentation. However, a vast body of existing cross-modality image translation methods relies on supervised learning. In this work, we aim to address the challenge of zero-shot learning-based image translation tasks (extreme scenarios in the target modality is unseen in the training phase). To leverage generative learning for zero-shot cross-modality image segmentation, we propose a novel unsupervised image translation method. The framework learns to translate the unseen source image to the target modality for image segmentation by leveraging the inherent statistical consistency between different modalities for diffusion guidance. Our framework captures identical cross-modality features in the statistical domain, offering diffusion guidance without relying on direct mappings between the source and target domains. This advantage allows our method to adapt to changing source domains without the need for retraining, making it highly practical when sufficient labeled source domain data is not available. The proposed framework is validated in zero-shot cross-modality image segmentation tasks through empirical comparisons with influential generative models, including adversarial-based and diffusion-based models."}
{"main_page": "https://arxiv.org/abs/2404.01103", "pdf": "https://arxiv.org/pdf/2404.01103", "title": "Second-Order Newton-Based Extremum Seeking for Multivariable Static Maps", "authors": "Azad Ghaffari, Tiago Roux Oliveira", "subjects": "Systems and Control (eess.SY)", "abstract": "A second-order Newton-based extremum seeking (SONES) algorithm is presented to estimate directional inflection points for multivariable static maps. The design extends the first-order Newton-based extremum seeking algorithm that drives the system toward its peak point. This work provides perturbation matrices to estimate the second- and third-order derivatives necessary for implementation of the SONES. A set of conditions are provided for the probing frequencies that ensure accurate estimation of the derivatives. A differential Riccati filter is used to calculate the inverse of the third-order derivative. The local stability of the new algorithm is proven for general multivariable static maps using averaging analysis. The proposed algorithm ensures uniform convergence toward directional inflection point without requiring information about the curvature of the map and its gradient. Simulation results show the effectiveness of the proposed algorithm."}
{"main_page": "https://arxiv.org/abs/2404.01119", "pdf": "https://arxiv.org/pdf/2404.01119", "title": "Automatic Modulation Classification using a Waveform Signature", "authors": "William H. Clark IV, Joseph M. Ernst, Robert W. McGwier", "subjects": "Signal Processing (eess.SP)", "abstract": "Cognitive Radios (CRs) build upon Software Defined Radios (SDRs) to allow for autonomous reconfiguration of communication architectures. In recent years, CRs have been identified as an enabler for Dynamic Spectrum Access (DSA) applications in which secondary users opportunistically share licensed spectrum. A major challenge for DSA is accurately characterizing the spectral environment, which requires blind signal classification. Existing work in this area has focused on simplistic channel models; however, more challenging fading channels (e.g., frequency selective fading channels) cause existing methods to be computationally complex or insufficient. This paper develops a novel blind modulation classification algorithm, which uses a set of higher order statistics to overcome these challenges. The set of statistics forms a signature, which can either be used directly for classification or can be processed using big data analytical techniques, such as principle component analysis (PCA), to learn the environment. The algorithm is tested in simulation on both flat fading and selective fading channel models. Results of this blind classification algorithm are shown to improve upon those which use single value higher order statistical methods."}
{"main_page": "https://arxiv.org/abs/2404.01125", "pdf": "https://arxiv.org/pdf/2404.01125", "title": "Probability-Based Optimal Control Design for Soft Landing of  Short-Stroke Actuators", "authors": "Eduardo Moya-Lasheras (1), Edgar Ramirez-Laboreo (1), Carlos Sagues (1) ((1) Universidad de Zaragoza)", "subjects": "Systems and Control (eess.SY)", "abstract": "The impact forces during switching operations of short-stroke actuators may cause bouncing, audible noise and mechanical wear. The application of soft-landing control strategies to these devices aims at minimizing the impact velocities of their moving components to ultimately improve their lifetime and performance. In this paper, a novel approach for soft-landing trajectory planning, including probability functions, is proposed for optimal control of the actuators. The main contribution of the proposal is that it considers uncertainty in the contact position and hence the obtained trajectories are more robust against system uncertainties. The problem is formulated as an optimal control problem and transformed into a two-point boundary value problem for its numerical resolution. Simulated and experimental tests have been performed using a dynamic model and a commercial short-stroke solenoid valve. The results show a significant improvement in the expected velocities and accelerations at contact with respect to past solutions in which the contact position is assumed to be perfectly known."}
{"main_page": "https://arxiv.org/abs/2404.01155", "pdf": "https://arxiv.org/pdf/2404.01155", "title": "Research on Mechanism of Voltage Oscillation Caused by Repeated LVRT of  Wind Turbine Based on Switched System Theory", "authors": "Qiping Lai, Chen Shen, Dongsheng Li", "subjects": "Systems and Control (eess.SY)", "abstract": "The electrical distance between the wind power collection sending end grid and the main grid is relatively long, lacking synchronous power supply support, showing the characteristics of weak grid. Therefore, the voltage oscillation phenomenon is easy to happen, threatening the safe and stable operation of the grid. Its dynamic process and evolution mechanism need to be studied urgently. This paper firstly analyzes conditions for voltage oscillations caused by repeated low voltage ride through (LVRT) of wind turbine through steady-state power flow calculation. Then, based on the switched system theory, considering the external connected impedance and internal control dynamics of the wind turbine, the switched system model for the grid-side converter (GSC) of wind turbine is established. After that, the relevant parameters are substituted to analyze the dynamic evolution process of each electrical quantity during the process that wind turbine repeatedly enters and exits LVRT, revealing the evolution mechanism of voltage oscillations. Finally, the voltage oscillation phenomenon of the grid-connected point of wind turbine is reproduced through simulation, verifying the correctness and effectiveness of theoretical analysis results. Furthermore, the main factors which influence characteristics of voltage oscillations are explored as well."}
{"main_page": "https://arxiv.org/abs/2404.01164", "pdf": "https://arxiv.org/pdf/2404.01164", "title": "Unified Predefined-time Stability Conditions of Nonlinear Systems with  Lyapunov Analysis", "authors": "Bing Xiao, Haichao Zhang, Shijie Zhao, Lu Cao", "subjects": "Systems and Control (eess.SY)", "abstract": "This brief gives a set of unified Lyapunov stability conditions to guarantee the predefined-time/finite-time stability of a dynamical systems. The derived Lyapunov theorem for autonomous systems establishes equivalence with existing theorems on predefined-time/finite-time stability. The findings proposed herein develop a nonsingular sliding mode control framework for an Euler-Lagrange system to analyze its stability, and its upper bound for the settling time can be arbitrarily determined a priori through predefined time constant."}
{"main_page": "https://arxiv.org/abs/2404.01192", "pdf": "https://arxiv.org/pdf/2404.01192", "title": "iMD4GC: Incomplete Multimodal Data Integration to Advance Precise  Treatment Response Prediction and Survival Analysis for Gastric Cancer", "authors": "Fengtao Zhou, Yingxue Xu, Yanfen Cui, Shenyan Zhang, Yun Zhu, Weiyang He, Jiguang Wang, Xin Wang, Ronald Chan, Louis Ho Shing Lau, Chu Han, Dafu Zhang, Zhenhui Li, Hao Chen", "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV)", "abstract": "Gastric cancer (GC) is a prevalent malignancy worldwide, ranking as the fifth most common cancer with over 1 million new cases and 700 thousand deaths in 2020. Locally advanced gastric cancer (LAGC) accounts for approximately two-thirds of GC diagnoses, and neoadjuvant chemotherapy (NACT) has emerged as the standard treatment for LAGC. However, the effectiveness of NACT varies significantly among patients, with a considerable subset displaying treatment resistance. Ineffective NACT not only leads to adverse effects but also misses the optimal therapeutic window, resulting in lower survival rate. However, existing multimodal learning methods assume the availability of all modalities for each patient, which does not align with the reality of clinical practice. The limited availability of modalities for each patient would cause information loss, adversely affecting predictive accuracy. In this study, we propose an incomplete multimodal data integration framework for GC (iMD4GC) to address the challenges posed by incomplete multimodal data, enabling precise response prediction and survival analysis. Specifically, iMD4GC incorporates unimodal attention layers for each modality to capture intra-modal information. Subsequently, the cross-modal interaction layers explore potential inter-modal interactions and capture complementary information across modalities, thereby enabling information compensation for missing modalities. To evaluate iMD4GC, we collected three multimodal datasets for GC study: GastricRes (698 cases) for response prediction, GastricSur (801 cases) for survival analysis, and TCGA-STAD (400 cases) for survival analysis. The scale of our datasets is significantly larger than previous studies. The iMD4GC achieved impressive performance with an 80.2% AUC on GastricRes, 71.4% C-index on GastricSur, and 66.1% C-index on TCGA-STAD, significantly surpassing other compared methods."}
{"main_page": "https://arxiv.org/abs/2404.01195", "pdf": "https://arxiv.org/pdf/2404.01195", "title": "Robust Trajectory and Resource Optimization for Communication-assisted  UAV SAR Sensing", "authors": "Mohamed-Amine Lahmeri, Walid R. Ghanem, Christina Bonfert, Robert Schober", "subjects": "Signal Processing (eess.SP)", "abstract": "In this paper, we investigate joint 3-dimensional (3D) trajectory planning and resource allocation for rotary-wing unmanned aerial vehicle (UAV) synthetic aperture radar (SAR) sensing. To support emerging real-time SAR applications and enable live mission control, we incorporate real-time communication with a ground station (GS). The UAV's main mission is the mapping of large areas of interest (AoIs) using an onboard SAR system and transferring the unprocessed raw radar data to the ground in real time. We propose a robust trajectory and resource allocation design that takes into account random UAV trajectory deviations. To this end, we model the UAV trajectory deviations and study their effect on the radar coverage. Then, we formulate a robust non-convex mixed-integer non-linear program (MINLP) such that the UAV 3D trajectory and resources are jointly optimized for maximization of the radar ground coverage. A low-complexity sub-optimal solution for the formulated problem is presented. Furthermore, to assess the performance of the sub-optimal algorithm, we derive an upper bound on the optimal solution based on monotonic optimization theory. Simulation results show that the proposed sub-optimal algorithm achieves close-to-optimal performance and not only outperforms several benchmark schemes but is also robust with respect to UAV trajectory deviations."}
{"main_page": "https://arxiv.org/abs/2404.01205", "pdf": "https://arxiv.org/pdf/2404.01205", "title": "Foundations of Cyber Resilience: The Confluence of Game, Control, and  Learning Theories", "authors": "Quanyan Zhu", "subjects": "Systems and Control (eess.SY); Cryptography and Security (cs.CR); Computer Science and Game Theory (cs.GT)", "abstract": "Cyber resilience is a complementary concept to cybersecurity, focusing on the preparation, response, and recovery from cyber threats that are challenging to prevent. Organizations increasingly face such threats in an evolving cyber threat landscape. Understanding and establishing foundations for cyber resilience provide a quantitative and systematic approach to cyber risk assessment, mitigation policy evaluation, and risk-informed defense design. A systems-scientific view toward cyber risks provides holistic and system-level solutions. This chapter starts with a systemic view toward cyber risks and presents the confluence of game theory, control theory, and learning theories, which are three major pillars for the design of cyber resilience mechanisms to counteract increasingly sophisticated and evolving threats in our networks and organizations. Game and control theoretic methods provide a set of modeling frameworks to capture the strategic and dynamic interactions between defenders and attackers. Control and learning frameworks together provide a feedback-driven mechanism that enables autonomous and adaptive responses to threats. Game and learning frameworks offer a data-driven approach to proactively reason about adversarial behaviors and resilient strategies. The confluence of the three lays the theoretical foundations for the analysis and design of cyber resilience. This chapter presents various theoretical paradigms, including dynamic asymmetric games, moving horizon control, conjectural learning, and meta-learning, as recent advances at the intersection. This chapter concludes with future directions and discussions of the role of neurosymbolic learning and the synergy between foundation models and game models in cyber resilience."}
