{"main_page": "https://arxiv.org/abs/2404.00128", "pdf": "https://arxiv.org/pdf/2404.00128", "title": "A spiking-domain implementation of electronic structure theory", "authors": "Aakash Yadav, Daniel Hedman, Hongsik Jeong", "subjects": "Signal Processing (eess.SP); Materials Science (cond-mat.mtrl-sci); Computational Physics (physics.comp-ph)", "abstract": "Electronic Structure Theory (EST) describes the behavior of electrons in matter and is used to predict material properties. Conventionally, this involves forming a Hamiltonian and solving the Schr\\\"odinger equation through discrete computation. Here, a new perspective to EST is provided by treating a perfectly crystalline material as a Linear Translation Invariant (LTI) system. The validity of this LTI-EST formalism is demonstrated by determining band structures for a one-dimensional chain of atoms, including the phenomenon of band structure folding in super cells. The proposed formalism allows for analytical traceability of band structure folding and offers computational advantage by bypassing the O(N) eigenvalue calculations. The spike-based computing nature of the proposed LTI-EST formalism is highlighted; thereby implying potential for material simulations solely in the spiking domain."}
{"main_page": "https://arxiv.org/abs/2404.00582", "pdf": "https://arxiv.org/pdf/2404.00582", "title": "Complex Neural Network based Joint AoA and AoD Estimation for Bistatic  ISAC", "authors": "Salmane Naoumi, Ahmad Bazzi, Roberto Bomfin, Marwa Chafii", "subjects": "Signal Processing (eess.SP)", "abstract": "Integrated sensing and communication (ISAC) in wireless systems has emerged as a promising paradigm, offering the potential for improved performance, efficient resource utilization, and mutually beneficial interactions between radar sensing and wireless communications, thereby shaping the future of wireless technologies. In this work, we present two novel methods to address the joint angle of arrival and angle of departure estimation problem for bistatic ISAC systems. Our proposed methods consist of a deep learning (DL) solution leveraging complex neural networks, in addition to a parameterized algorithm. By exploiting the estimated channel matrix and incorporating a preprocessing step consisting of a coarse timing estimation, we are able to notably reduce the input size and improve the computational efficiency. In our findings, we emphasize the remarkable potential of our DL-based approach, which demonstrates comparable performance to the parameterized method that explicitly exploits the multiple-input multiple-output (MIMO) model, while exhibiting significantly lower computational complexity."}
{"main_page": "https://arxiv.org/abs/2404.00780", "pdf": "https://arxiv.org/pdf/2404.00780", "title": "Cooperative Communication Based Gradient Coding for Wireless Federated  Learning", "authors": "Shudi Weng, Chengxi Li, Ming Xiao, Mikael Skoglund", "subjects": "Signal Processing (eess.SP)", "abstract": "We investigate wireless federated learning (FL) in the presence of stragglers, where the power-constrained wireless devices collaboratively train a global model on their local datasets %within a time constraint and transmit local model updates through fading channels. To tackle stragglers resulting from link disruptions without requiring accurate prior information on connectivity or dataset sharing, we propose a gradient coding (GC) scheme based on cooperative communication. Subsequently, we conduct an outage analysis of the proposed scheme, based on which we conduct the convergence analysis. The simulation results reveal the superiority of the proposed strategy in the presence of stragglers, especially in low signal-to-noise ratio (SNR) scenarios."}
{"main_page": "https://arxiv.org/abs/2404.00827", "pdf": "https://arxiv.org/pdf/2404.00827", "title": "SONIC: Synergizing VisiON Foundation Models for Stress RecogNItion from  ECG signals", "authors": "Orchid Chetia Phukan, Ankita Das, Arun Balaji Buduru, Rajesh Sharma", "subjects": "Signal Processing (eess.SP)", "abstract": "Stress recognition through physiological signals such as Electrocardiogram (ECG) signals has garnered significant attention. Traditionally, research in this field predominantly focused on utilizing handcrafted features or raw signals as inputs for learning algorithms. However, there is now a burgeoning interest within the community in leveraging large-scale vision foundation models (VFMs) like ResNet50, VGG19, and others. These VFMs are increasingly preferred due to their ability to capture complex features, enhancing the accuracy and effectiveness of stress recognition systems. However, no particular focus has been given on combining these VFMs. The combination of VFMs offers promising benefits by harnessing their collective knowledge to extract richer representations for improved stress recognition. So, to mitigate this research gap, we focus on combining different VFMs for stress recognition from ECG and propose SONIC, a novel framework that combines VFMs through their logits and training a fully connected network on the combined logits. Through extensive experimentation, SONIC showed the top performance against individual VFMs performance on the WESAD benchmark. With SONIC, we report state-of-the-art (SOTA) performance in WESAD with 99.36% and 99.24% (stress vs non-stress) and 97.66% and 97.10% (amusement vs stress vs baseline) in accuracy and F1 respectively."}
{"main_page": "https://arxiv.org/abs/2404.00954", "pdf": "https://arxiv.org/pdf/2404.00954", "title": "Digital Twins for Supporting AI Research with Autonomous Vehicle  Networks", "authors": "Anıl Gürses, Gautham Reddy, Saad Masrur, Özgür Özdemir, İsmail Güvenç, Mihail L. Sichitiu, Alphan Şahin, Ahmed Alkhateeb, Rudra Dutta", "subjects": "Signal Processing (eess.SP); Networking and Internet Architecture (cs.NI)", "abstract": "Digital twins (DTs), which are virtual environments that simulate, predict, and optimize the performance of their physical counterparts, are envisioned to be essential technologies for advancing next-generation wireless networks. While DTs have been studied extensively for wireless networks, their use in conjunction with autonomous vehicles with programmable mobility remains relatively under-explored. In this paper, we study DTs used as a development environment to design, deploy, and test artificial intelligence (AI) techniques that use real-time observations, e.g. radio key performance indicators, for vehicle trajectory and network optimization decisions in an autonomous vehicle networks (AVN). We first compare and contrast the use of simulation, digital twin (software in the loop (SITL)), sandbox (hardware-in-the-loop (HITL)), and physical testbed environments for their suitability in developing and testing AI algorithms for AVNs. We then review various representative use cases of DTs for AVN scenarios. Finally, we provide an example from the NSF AERPAW platform where a DT is used to develop and test AI-aided solutions for autonomous unmanned aerial vehicles for localizing a signal source based solely on link quality measurements. Our results in the physical testbed show that SITL DTs, when supplemented with data from real-world (RW) measurements and simulations, can serve as an ideal environment for developing and testing innovative AI solutions for AVNs."}
{"main_page": "https://arxiv.org/abs/2404.00982", "pdf": "https://arxiv.org/pdf/2404.00982", "title": "Wideband Channel Capacity Maximization With Beyond Diagonal RIS  Reflection Matrices", "authors": "Özlem Tuğfe Demir, Emil Björnson", "subjects": "Signal Processing (eess.SP); Information Theory (cs.IT)", "abstract": "Following the promising beamforming gains offered by reconfigurable intelligent surfaces (RISs), a new hardware architecture, known as \\emph{beyond diagonal RIS (BD-RIS)}, has recently been proposed. This architecture enables controllable signal flows between the RIS elements, thereby providing greater design flexibility. However, the physics-imposed symmetry and orthogonality conditions on the non-diagonal reflection matrix make the design challenging. In this letter, we analyze how a BD-RIS can improve a wideband channel, starting from fundamental principles and deriving the capacity. Our analysis considers the effects of various channel taps and their frequency-domain characteristics. We introduce a new algorithm designed to optimize the configuration of the BD-RIS to maximize wideband capacity. The proposed algorithm has better performance than the benchmarks. A BD-RIS is beneficial compared to a conventional RIS in the absence of static path or when the Rician $\\kappa$-factor is smaller than $10$."}
{"main_page": "https://arxiv.org/abs/2404.01088", "pdf": "https://arxiv.org/pdf/2404.01088", "title": "GI-Free Pilot-Aided Channel Estimation for Affine Frequency Division  Multiplexing Systems", "authors": "Yu Zhou, Haoran Yin, Nanhao Zhou, Yanqun Tang, Xiaoying Zhang, Weijie Yuan", "subjects": "Signal Processing (eess.SP)", "abstract": "The recently developed affine frequency division multiplexing (AFDM) can achieve full diversity in doubly selective channels, providing a comprehensive sparse representation of the delay-Doppler domain channel. Thus, accurate channel estimation is feasible by using just one pilot symbol. However, traditional AFDM channel estimation schemes necessitate the use of guard intervals (GI) to mitigate data-pilot interference, leading to spectral efficiency degradation. In this paper, we propose a GI-free pilot-aided channel estimation algorithm for AFDM systems, which improves spectral efficiency significantly. To mitigate the interference between the pilot and data symbols caused by the absence of GI, we perform joint interference cancellation, channel estimation, and signal detection iterately. Simulation results show that the bit error rate (BER) performance of the proposed method can approach the ideal case with perfect channel estimation."}
{"main_page": "https://arxiv.org/abs/2404.01119", "pdf": "https://arxiv.org/pdf/2404.01119", "title": "Automatic Modulation Classification using a Waveform Signature", "authors": "William H. Clark IV, Joseph M. Ernst, Robert W. McGwier", "subjects": "Signal Processing (eess.SP)", "abstract": "Cognitive Radios (CRs) build upon Software Defined Radios (SDRs) to allow for autonomous reconfiguration of communication architectures. In recent years, CRs have been identified as an enabler for Dynamic Spectrum Access (DSA) applications in which secondary users opportunistically share licensed spectrum. A major challenge for DSA is accurately characterizing the spectral environment, which requires blind signal classification. Existing work in this area has focused on simplistic channel models; however, more challenging fading channels (e.g., frequency selective fading channels) cause existing methods to be computationally complex or insufficient. This paper develops a novel blind modulation classification algorithm, which uses a set of higher order statistics to overcome these challenges. The set of statistics forms a signature, which can either be used directly for classification or can be processed using big data analytical techniques, such as principle component analysis (PCA), to learn the environment. The algorithm is tested in simulation on both flat fading and selective fading channel models. Results of this blind classification algorithm are shown to improve upon those which use single value higher order statistical methods."}
{"main_page": "https://arxiv.org/abs/2404.01195", "pdf": "https://arxiv.org/pdf/2404.01195", "title": "Robust Trajectory and Resource Optimization for Communication-assisted  UAV SAR Sensing", "authors": "Mohamed-Amine Lahmeri, Walid R. Ghanem, Christina Bonfert, Robert Schober", "subjects": "Signal Processing (eess.SP)", "abstract": "In this paper, we investigate joint 3-dimensional (3D) trajectory planning and resource allocation for rotary-wing unmanned aerial vehicle (UAV) synthetic aperture radar (SAR) sensing. To support emerging real-time SAR applications and enable live mission control, we incorporate real-time communication with a ground station (GS). The UAV's main mission is the mapping of large areas of interest (AoIs) using an onboard SAR system and transferring the unprocessed raw radar data to the ground in real time. We propose a robust trajectory and resource allocation design that takes into account random UAV trajectory deviations. To this end, we model the UAV trajectory deviations and study their effect on the radar coverage. Then, we formulate a robust non-convex mixed-integer non-linear program (MINLP) such that the UAV 3D trajectory and resources are jointly optimized for maximization of the radar ground coverage. A low-complexity sub-optimal solution for the formulated problem is presented. Furthermore, to assess the performance of the sub-optimal algorithm, we derive an upper bound on the optimal solution based on monotonic optimization theory. Simulation results show that the proposed sub-optimal algorithm achieves close-to-optimal performance and not only outperforms several benchmark schemes but is also robust with respect to UAV trajectory deviations."}
