{"main_page": "https://arxiv.org/abs/2404.00064", "pdf": "https://arxiv.org/pdf/2404.00064", "title": "Confronting CP symmetry of order 4 with experimental data", "authors": "Igor P. Ivanov, Duanyang Zhao", "subjects": "High Energy Physics - Phenomenology (hep-ph)", "abstract": "CP4 3HDM is a three-Higgs-doublet model based on a $CP$ symmetry of order 4 (CP4). It is the minimal model incorporating CP4 without leading to accidental symmetries or running into immediate conflict with experiment. Imposing CP4 on the lagrangian induces remarkably tight connections between the scalar and Yukawa sectors, including the unavoidable tree-level flavor-changing neutral couplings (FCNC). Here, we explore whether it is at all possible in the CP4 3HDM to suppressed FCNC to a level compatible with the neutral meson oscillation constraints. We express the FCNC matrices in terms of physical quark observables and quark rotation parameters, and scan the Yukawa parameter space using the quark masses and mixing parameters as input. With this procedure, we find that only two out of the eight possible CP4 Yukawa sectors are compatible with the $K$, $B$, $B_s$ and, in particular, $D$-meson oscillation constraints. The results clearly indicate a way how to construct phenomenologically viable benchmark CP4 3HDMs."}
{"main_page": "https://arxiv.org/abs/2404.00087", "pdf": "https://arxiv.org/pdf/2404.00087", "title": "Quantum simulation of entanglement and hadronization in jet production:  lessons from the massive Schwinger model", "authors": "Adrien Florio, David Frenklakh, Kazuki Ikeda, Dmitri E. Kharzeev, Vladimir Korepin, Shuzhe Shi, Kwangmin Yu", "subjects": "High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th); Nuclear Theory (nucl-th); Quantum Physics (quant-ph)", "abstract": "The possible link between entanglement and thermalization, and the dynamics of hadronization are addressed by studying the real-time response of the massive Schwinger model coupled to external sources. This setup mimics the production and fragmentation of quark jets, as the Schwinger model and QCD share the properties of confinement and chiral symmetry breaking. By using quantum simulations on classical hardware, we study the entanglement between the produced jets, and observe the growth of the corresponding entanglement entropy in time. This growth arises from the increased number of contributing eigenstates of the reduced density matrix with sufficiently large and close eigenvalues. We also investigate the physical nature of these eigenstates, and find that at early times they correspond to fermionic Fock states. We then observe the transition from these fermionic Fock states to meson-like bound states as a function of time. In other words, we observe how hadronization develops in real time. At late times, the local observables at mid-rapidity (such as the fermion density and the electric field) approach approximately constant values, suggesting the onset of equilibrium and approach to thermalization."}
{"main_page": "https://arxiv.org/abs/2404.00089", "pdf": "https://arxiv.org/pdf/2404.00089", "title": "N$^3$LO soft-gluon corrections in single-particle-inclusive kinematics  and $H^+ H^-$ production", "authors": "Nikolaos Kidonakis, Alberto Tonero", "subjects": "High Energy Physics - Phenomenology (hep-ph)", "abstract": "We calculate the complete soft-gluon corrections for the production of colorless final states through N$^3$LO in single-particle-inclusive kinematics. We present explicit analytical results and use them to study higher-order QCD corrections for the production of a heavy charged Higgs pair ($H^+ H^-$) via quark-antiquark annihilation in the Two-Higgs-Doublet Model at LHC energies. We calculate the NNLO soft-gluon and virtual QCD corrections as well as the N$^3$LO soft-gluon corrections to the total cross section and the charged-Higgs rapidity distribution. This is the first calculation of complete N$^3$LO soft-gluon corrections for a process in single-particle-inclusive kinematics, and the results can be applied to other processes with colorless final states."}
{"main_page": "https://arxiv.org/abs/2404.00241", "pdf": "https://arxiv.org/pdf/2404.00241", "title": "Cosmological mass of the photon related to Stueckelberg and Higgs  mechanisms", "authors": "Lorenzo Gallerani Resca", "subjects": "High Energy Physics - Phenomenology (hep-ph); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "I consider electro-weak (EW) masses and interactions generated for photons by vacuum expectation values of Stueckelberg and Higgs fields. I provide a prescription to relate their parametric values to a cosmological range derived from a fundamental Heisenberg uncertainty principle and Einstein-de Sitter cosmological constant and horizon. This yields qualitative connections between microscopic ranges acquired by $W^{\\pm}$ or $Z^0$ gauge Bosons and the cosmological scale and minimal mass acquired by $g$-photons. I apply that procedure to an established Stueckelberg-Higgs mechanism, while I consider a similar procedure for a pair of Higgs fields that may spontaneously break all U(1)xSU(2) gauge invariances. My estimates of photon masses and their additional parity-breaking interactions with leptons and neutrinos may be detectable in suitable accelerator experiments. Their effects may also be observable astronomically through massive $g$-photon condensates that may contribute to dark matter and dark energy."}
{"main_page": "https://arxiv.org/abs/2404.00298", "pdf": "https://arxiv.org/pdf/2404.00298", "title": "Production and decay of hyperons in transversely polarized  electron-positron collider", "authors": "Xu Cao, Yu-Tie Liang, Rong-Gang Ping", "subjects": "High Energy Physics - Phenomenology (hep-ph)", "abstract": "The self-polarization of relativistic electrons or positrons moving in a magnetic field at a storage ring occurs through the emission of spin-flip synchrotron radiation, known as the Sokolov-Ternov effect. The resulting transverse polarizations of the colliding electrons and positrons, away from the depolarization resonances, allow for precise investigation of the spin entangled hyperon-antihyperon pairs via virtual photon or charmonium decay. The feasibility study reveals a promising increase in the statistical sensitivity of the \\CP violation signal after considering the transverse polarizations of the lepton beams."}
{"main_page": "https://arxiv.org/abs/2404.00334", "pdf": "https://arxiv.org/pdf/2404.00334", "title": "Unitarity constraints and the dispersive matrix", "authors": "Guido Martinelli, Silvano Simula, Ludovico Vittorio", "subjects": "High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Experiment (hep-ex); High Energy Physics - Lattice (hep-lat)", "abstract": "We present updated estimates of $\\vert V_{cb} \\vert$ and $R(D^{(*)})$ based on all the available theoretical and experimental data on semileptonic $B \\to D^{(*)} \\ell \\nu_\\ell$ decays. These values have been obtained by using the Dispersive Matrix method to describe the hadronic form factors. By analysing all the lattice data we get the theoretical values $R^{\\rm th}(D) = 0.296 \\pm 0.008$ and $R^{\\rm th}(D^*) = 0.262 \\pm 0.009$, which are consistent with the corresponding HFLAV averages at the $\\simeq 2.0\\,\\sigma$ and the $\\simeq 1.5\\,\\sigma$ level, respectively. Moreover, from a bin-per-bin study of the experimental data we obtain the values $\\vert V_{cb} \\vert = (41.0 \\pm 1.2) \\cdot10^{-3}$ from $B \\to D$ decay and $\\vert V_{cb} \\vert = (39.92 \\pm 0.64) \\cdot10^{-3}$ from $B \\to D^*$ one, whose differences with the latest inclusive determinations never exceed the $\\simeq 2.5\\,\\sigma$ level."}
{"main_page": "https://arxiv.org/abs/2404.00444", "pdf": "https://arxiv.org/pdf/2404.00444", "title": "A new method for the solution of the two-body Dirac equation: Estimation  of the weights of $C$, $P$ and $CP$ symmetry violating terms in positronium", "authors": "E.M. Tursunov, Sh.G. Norbutaev", "subjects": "High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Experiment (hep-ex); Nuclear Theory (nucl-th); Quantum Physics (quant-ph)", "abstract": "A new theoretical method is developed for the solution of the two-body bound-state Dirac equation for positronium. Only Coulomb potential was included in the Dirac Hamiltonian. It is shown that the two-body Dirac Hamiltonian can be written in the Hermitian matrix form of the $4\\times 4$ size and contains terms, responsible for the violation of the $P$, $C$, and $CP$ symmetries. Numerical results for the energy spectrum of the para- and ortho-positronium ground states performed within the variational method using the harmonic oscillator basis functions are in good agreement with a high-precision finite-element method of T.C. Scott et al. The weights of the $P$ and $CP$ symmetry-violating components in the para-positronium ground state are identical to the weight of the $P$ symmetry-violating component of the ortho-Ps and are estimated to be 6.6E-6. The weights of the $C$ and $CP$ symmetry-violating components of the ortho-Ps are equal to the 2/3 and 1/3 parts of this value, respectively. These numbers are less by two orders of magnitude than the precision limit of current experimental facilities."}
{"main_page": "https://arxiv.org/abs/2404.00448", "pdf": "https://arxiv.org/pdf/2404.00448", "title": "Meson mass and width: Deep learning approach", "authors": "M. Malekhosseini, S. Rostami, A. R. Olamaei, R. Ostovar, K. Azizi", "subjects": "High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Experiment (hep-ex); High Energy Physics - Lattice (hep-lat)", "abstract": "It is fascinating to predict the mass and width of the ordinary and exotic mesons solely based on their quark content and quantum numbers. Such prediction goes beyond conventional methodologies traditionally employed in hadron physics for calculating or estimating these quantities. The relation between the quantum numbers and the properties of the mesons, such as the mass and width, is complicated in the world of particle physics. However, the deep neural network (DNN) as a subfield of machine learning techniques provides a solution to this problem. By analyzing large datasets, deep learning algorithms can automatically identify complex patterns among the particles' quantum numbers, and their mass and width, that would otherwise require complex calculations. In this study, we present two approaches using the DNNs to estimate the mass of some ordinary and exotic mesons. Also for the first time, the DNNs are trained to predict the width of ordinary and exotic mesons, whose widths have not been experimentally known. Our predictions obtained through the DNNs, will be useful for future experimental searches."}
{"main_page": "https://arxiv.org/abs/2404.00483", "pdf": "https://arxiv.org/pdf/2404.00483", "title": "Chromomagnetic dipole moments of light quarks in the Bestest Little  Higgs Model", "authors": "T. Cisneros-Pérez, E. Cruz-Albaro, A. Y. Ojeda-Castañeda, S. E. Solís-Núñez", "subjects": "High Energy Physics - Phenomenology (hep-ph)", "abstract": "In this paper, we research into the anomalous Chromomagnetic Dipole Moment (CMDM), denoted as $\\hat{\\mu}_{q}^{BLHM}$, of the light quarks $q=(u, c, d, s, b)$ within the framework of the Bestest Little Higgs Model (BLHM) as an extension of the Standard Model (SM). Our investigation encompasses novel interactions among the light quarks, the heavy quark $B$, and the heavy bosons $(W^{\\prime\\pm}, H^{\\pm}, \\phi^{\\pm}, \\eta^{\\pm})$, incorporating the extended Cabibbo-Kobayashi-Maskawa (CKM) matrix characteristic of the BLHM. We thoroughly explore the permissible parameter space, yielding a spectrum of CMDM values ranging from $10^{-10}$ to $10^{-3}$."}
{"main_page": "https://arxiv.org/abs/2404.00516", "pdf": "https://arxiv.org/pdf/2404.00516", "title": "Electric Dipole Moments in 5+3 Flavor Weak Effective Theory", "authors": "Jacky Kumar, Emanuele Mereghetti", "subjects": "High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Experiment (hep-ex)", "abstract": "A fully generic treatment of electric dipole moments (EDMs) is presented in the CP-violating and flavor-conserving weak effective field theory (WET) with five flavors of quarks and three flavors of leptons. We systematically analyze leading contributions to EDMs originating from QCD and QED renormalization group running between the electroweak scale and low energy scales of about 2 GeV. We include the full one-loop anomalous dimension and a subset of two-loop corrections, as well as threshold corrections at the bottom, charm and $\\tau$ masses. This allows us to derive master formulae in the space of generic WET for the neutron and proton EDMs, for EDMs of diamagnetic atoms, and the precession frequencies constrained in molecular EDM experiments, from which bounds on the electron EDM are extracted. In particular, our master formulae capture the contributions of WET CP-violating operators with heavy quark and lepton flavors. As an application, we study EDM constraints on the Yukawa couplings of the Higgs boson, in both the linear and non-linear realizations of electroweak symmetry breaking."}
{"main_page": "https://arxiv.org/abs/2404.00554", "pdf": "https://arxiv.org/pdf/2404.00554", "title": "Order of the SU(N_f) x SU(N_f) chiral transition via the functional  renormalization group", "authors": "G. Fejos, T. Hatsuda", "subjects": "High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Lattice (hep-lat); High Energy Physics - Theory (hep-th); Nuclear Theory (nucl-th)", "abstract": "Renormalization group flows of the $SU(N_f)\\times SU(N_f)$ symmetric Ginzburg-Landau potential are calculated for a general number of flavors, $N_f$. Our approach does not rely on the $\\epsilon$ expansion, but uses the functional renormalization group directly formulated in $d=3$ spatial dimensions with the inclusion of all possible (perturbatively) relevant and marginal operators. We find infrared fixed points spanned throughout the entire flavor number range that are inaccessible in the $\\epsilon$ expansion. Stability analyses around the fixed points show that for $N_f\\geq 5$ the chiral transition is of second-order, while for $N_f=2,3,4$, it is of first-order. We argue that the $U_A(1)$ anomaly controls the strength of the first-order transition, which could become almost continuous if the axial symmetry breaking is sufficiently weak at the critical point. This could open up a new strategy to investigate the strength of the $U_{\\rm A}(1)$ symmetry breaking around the critical temperature."}
{"main_page": "https://arxiv.org/abs/2404.00646", "pdf": "https://arxiv.org/pdf/2404.00646", "title": "Primordial black holes from slow phase transitions: a model-building  perspective", "authors": "Shinya Kanemura, Masanori Tanaka, Ke-Pan Xie", "subjects": "High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "We investigate the formation of primordial black holes (PBHs) through delayed vacuum decay during slow cosmic first-order phase transitions. Two specific models, the polynomial potential and the real singlet extension of the Standard Model, are used as illustrative examples. Our findings reveal that models with zero-temperature scalar potential barriers are conducive to the realization of this mechanism, as the phase transition duration is extended by the U-shaped Euclidean action. We find that the resulting PBH density is highly sensitive to the barrier height, with abundant PBH formation observed for sufficiently high barriers. Notably, the phase transition needs NOT to be super-strong, and the commonly used exponential nucleation approximation $\\Gamma(t)\\sim e^{\\beta t}$ fails to capture the PBH formation dynamics in such models."}
{"main_page": "https://arxiv.org/abs/2404.00649", "pdf": "https://arxiv.org/pdf/2404.00649", "title": "Calculation of the total 10-th order QED contribution to the lepton  magnetic moments", "authors": "Sergey Volkov", "subjects": "High Energy Physics - Phenomenology (hep-ph)", "abstract": "The total 5-loop quantum electrodynamics universal contribution to the anomalous magnetic moments of the leptons was calculated by the author. The obtained value $A_1^{(10)}=5.891(61)$ provides the first complete verification of the previously known value obtained by T. Aoyama, M. Hayakawa, T. Kinoshita, M. Nio (AHKN). The discrepancy is $5 \\sigma$. The computation includes the recalculation of the part that the author calculated in 2019 using a slightly different method and the calculation of the remaining part of the coefficient. A comparison with the AHKN values in 32 gauge-invariant classes is provided. In addition, the results are divided into 95 small gauge-invariant classes that subdivide the former ones. Such a detailzation is provided for the first time. The method described in previous works of the author was used in general. However, the Monte Carlo integration method is new and is described in detail. Some useful technical information and information on numerical cancellations is also given."}
{"main_page": "https://arxiv.org/abs/2404.00654", "pdf": "https://arxiv.org/pdf/2404.00654", "title": "Freeze-in sterile neutrino dark matter in feeble gauged $B-L$ model", "authors": "Osamu Seto, Takashi Shimomura, Yoshiki Uchida", "subjects": "High Energy Physics - Phenomenology (hep-ph)", "abstract": "We consider the gauged $U(1)_{B-L}$ model and examine the situation where the sterile neutrino is a dark matter candidate produced by the freeze-in mechanism. In our model, the dark matter $N$ is mainly produced by the decay of a $U(1)_{B-L}$ breaking scalar field $\\phi$. We point out that the on-shell production of $\\phi$ through annihilation of the $U(1)_{B-L}$ gauge field $Z'$ plays an important role. We find that the single production of $Z'$ from the photon bath is one of the main production processes of $Z'$. To prevent $N$ from being overproduced, we show that the $U(1)_{B-L}$ gauge coupling constant $g_{B-L}$ must be as small as $10^{-13}$-$10^{-10}$. We also consider the case where the decay of $\\phi$ into $N$ is kinematically forbidden. In this case, $N$ is generated by the scattering of $Z'$ and the $g_{B-L}$ takes values of $10^{-7}$-$10^{-6}$, which can be explored in collider experiments like FASER."}
{"main_page": "https://arxiv.org/abs/2404.00690", "pdf": "https://arxiv.org/pdf/2404.00690", "title": "Scatophobic Dark Matter", "authors": "Gerald X. Gilbert-Thorple, Jôsé J. Jesus", "subjects": "High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "An outstanding mystery of dark matter physics is the lack of direct detection signals to date. We suggest that dark matter is scatophobic: due to a repulsive long-range interaction, it is repelled by objects with a large net scat charge, such as the Earth, and is therefore not able to reach direct detection experiments. This represents the first step in a broader theoretical paradigm that we dub the \"anti-anthropic principle.\""}
{"main_page": "https://arxiv.org/abs/2404.00693", "pdf": "https://arxiv.org/pdf/2404.00693", "title": "Total Gluon Helicity from Lattice without Effective Theory Matching", "authors": "Zhuoyi Pang, Fei Yao, Jian-Hui Zhang", "subjects": "High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Lattice (hep-lat); Nuclear Experiment (nucl-ex); Nuclear Theory (nucl-th)", "abstract": "We propose two approaches for extracting the total gluon helicity contribution to proton spin from lattice QCD, one from local operator matrix elements in a fixed gauge accessible on lattice with feasible renormalization, and the other from gauge-invariant nonlocal gluon correlators. Neither of these approaches requires a matching procedure when converted to the MS scheme. Our proposal resolves a long-standing inconsistency in the literature regarding lattice calculations of the total gluon helicity, and has the potential to greatly facilitate these calculations."}
{"main_page": "https://arxiv.org/abs/2404.00734", "pdf": "https://arxiv.org/pdf/2404.00734", "title": "Weak decays of $\\pmb{B_c}$ involving vector mesons in self-consistent  covariant light-front approach", "authors": "Thejus Mary S., Avijit Hazra, Neelesh Sharma, Rohit Dhir", "subjects": "High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Experiment (hep-ex)", "abstract": "We present a comprehensive analysis of weak transition form factors, semileptonic decays, and nonleptonic decays of $B_c$ meson involving pseudoscalar ($P$) and vector ($V$) meson for bottom-conserving and bottom-changing decay modes. We employ self-consistent covariant light-front quark model (CLFQM), termed as Type-II correspondence, to calculate the $B_c$ to $P(V)$ transition form factors. The Type-II correspondence in the CLF approach gives self-consistent results associated with the $B^{(i)}_j$ functions, which vanish numerically after the replacement $M^{\\prime(\\prime\\prime)} \\to M_0^{\\prime(\\prime\\prime)}$ in traditional Type-I correspondence, and the covariance of the matrix elements is also restored. We investigate these effects on bottom conserving $B_c \\to P(V)$ form factors that have not yet been studied in CLFQM Type-II correspondence. In addition, we quantify the implications of self-consistency propagating to weak decays involving both bottom-conserving and bottom-changing $B_c$ transition form factors. We use two different parameterizations, the usual three-parameter function of $q^2$ and the model-independent $z$-series expansion, to establish a clear understanding of $q^2$ dependence. Using the numerical values of the form factors, we predict the branching ratios and other physical observables, such as, forward-backward asymmetries, polarization fractions, etc., of the semileptonic $B_c$ decays. We extend our analysis to predict the branching ratios of two-body nonleptonic weak decays using the factorization hypothesis in self-consistent CLFQM. We also compare our results with those of other theoretical studies."}
{"main_page": "https://arxiv.org/abs/2404.00854", "pdf": "https://arxiv.org/pdf/2404.00854", "title": "High-accuracy optical clocks with sensitivity to the fine-structure  constant variation based on Sm$ ^{10+} $", "authors": "Saleh O. Allehabi, V. A. Dzuba, V. V. Flambaum", "subjects": "High Energy Physics - Phenomenology (hep-ph)", "abstract": "We identify two metastable excited states in Sm$ ^{10+} $ highly charged ion as candidates for high accuracy optical clocks. Several atomic properties relevant to optical clock development are calculated using relativistic many-body methods. This includes energy levels, transition amplitudes, lifetimes, scalar polarizabilities, black body radiation shift, and the sensitivity to the fine structure constant variation. We found that the clock transitions are not sensitive to perturbation, e.g., relative black body radiation shifts are $\\sim 10^{-19}$. The enhancement factor for the $\\alpha$ variation is $\\sim$ 0.8 for one clock transition and $\\sim$ 16 for another."}
{"main_page": "https://arxiv.org/abs/2404.00858", "pdf": "https://arxiv.org/pdf/2404.00858", "title": "$A_4$ modular invariance and the strong CP problem", "authors": "S.T. Petcov, M. Tanimoto", "subjects": "High Energy Physics - Phenomenology (hep-ph)", "abstract": "We present simple effective theory of quark masses, mixing and CP violation with level $N=3$ ($A_4$) modular symmetry, which provides solution to the strong CP problem without the need for an axion. The vanishing of the strong CP-violating phase $\\bar \\theta$ is ensured by assuming CP to be a fundamental symmetry of the Lagrangian of the theory. The CP symmetry is broken spontaneously by the vacuum expectation value (VEV) of the modulus $\\tau$. This provides the requisite large value of the CKM CP-violating phase while the strong CP phase $\\bar \\theta$ remains zero or is tiny. Within the considered framework we discuss phenomenologically viable quark mass matrices with three types of texture zeros, which are realized by assigning both the left-handed and right-handed quark fields to $A_4$ singlets ${\\bf 1}$, ${\\bf 1'}$ and ${\\bf 1''}$ with appropriate weights. The VEV of $\\tau$ is restricted to reproduce the observed CKM parameters. We discuss, in particular, cases in which the modulus VEV is close to the fixed points $i$, $\\omega$ and $i\\infty$, which are broadly consistent with the results on modulus stabilisation."}
{"main_page": "https://arxiv.org/abs/2404.00965", "pdf": "https://arxiv.org/pdf/2404.00965", "title": "Inhomogeneous confinement and chiral symmetry breaking induced by  imaginary angular velocity", "authors": "Shi Chen, Kenji Fukushima, Yusuke Shimada", "subjects": "High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th)", "abstract": "We investigate detailed properties of imaginary rotating matter with gluons and quarks at high temperature. Previously, we showed that imaginary rotation induces perturbative confinement of gluons at the rotation center. We perturbatively calculate the Polyakov loop potential and find inhomogeneous confinement above a certain threshold of imaginary angular velocity. We also evaluate the quark contribution to the Polyakov loop potential and confirm that spontaneous chiral symmetry breaking occurs in the perturbatively confined phase."}
{"main_page": "https://arxiv.org/abs/2404.00997", "pdf": "https://arxiv.org/pdf/2404.00997", "title": "Magnetic axion vortex and very light QCD axions", "authors": "Deog Ki Hong, Stephen J. Lonsdale", "subjects": "High Energy Physics - Phenomenology (hep-ph); Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Theory (hep-th)", "abstract": "We show that a stable vortex soliton, carrying a constant magnetic flux, exists in the homogeneous medium of axions with a constant time-derivative. Axions can be bound in the vortex, having energy less than the axion mass. If the observed magnetic fields in galaxies are those of the vortex, the axion-photon coupling has to be smaller than $10^{-17}\\,{\\rm GeV^{-1}}$. Otherwise, axions decay too quickly to constitute dark matter in galaxies."}
{"main_page": "https://arxiv.org/abs/2404.01095", "pdf": "https://arxiv.org/pdf/2404.01095", "title": "Flavour bounds on axions, hidden photons and sterile neutrinos", "authors": "Martin Bauer", "subjects": "High Energy Physics - Phenomenology (hep-ph)", "abstract": "Flavour-violating decays are some of the most sensitive probes for New Physics with masses below the B meson threshold. In this talk I review the sensitivity to axion-like particles, hidden photons and heavy neutral leptons assuming minimal models where these are the only particle in addition to the Standard Model, respectively."}
{"main_page": "https://arxiv.org/abs/2404.01186", "pdf": "https://arxiv.org/pdf/2404.01186", "title": "Optimised observables and new physics prospects in the penguin-mediated  decays $B_{d(s)}\\to K^{(*)0}φ$", "authors": "Aritra Biswas, Sébastien Descotes-Genon, Joaquim Matias, Gilberto Tetlalmatzi-Xolocotzi", "subjects": "High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Experiment (hep-ex); High Energy Physics - Lattice (hep-lat)", "abstract": "We study the penguin-mediated decays $\\bar{B}_{d(s)}\\to\\bar{K}^{*0}(K^{*0})\\phi$ transitions. We propose a new optimised observable $L_{K^*\\phi}$ from the ratio of longitudinal branching ratios of these decays, with limited hadronic uncertainties and enhanced sensitivity to New Physics. It exhibits a deviation at the $1.48\\, \\sigma$ level between its experimental value and its SM determination within QCD factorisation. This result can be accommodated together with the significant deviations found for the $K^{(*)}\\bar{K}^{(*)}$ modes in our earlier works, if New Physics affects either the QCD penguin operator $Q_4$ or the chromomagnetic dipole operator $Q_{8g}$ for both $b\\to d$ and $b\\to s$ transitions. The allowed range for the Wilson coefficients $C_{4s,8gs}$ is narrower compared to $C_{4d,8gd}$ since the $b\\to s$ transition $\\bar{B}_d\\to\\bar{K}^{*0}\\phi$) is in better agreement with the SM. If we add the measured longitudinal branching ratio for the $\\bar{B}_{d}\\to \\bar{K}^{0}\\phi$ to our analysis, the simultaneous explanation of all the experimental data for the $K^{(*)}\\bar{K}^{(*)}$ and the $K^*(\\bar{K}^{(*)})\\phi$ channels in terms of New Physics in $C_{4d,s}$ or $C_{8gd,s}$ operators only becomes very constrained. This set of observables can be explained more easily if we assume New Physics either in $(C_{4f},C_{6f})$ or $C_{6f},C_{8gf}$ in both $f=d,s$. This should provide a strong incentive for the LHCb experiment to perform a new measurement of the longitudinal branching ratio for $\\bar{B}_{d}\\to\\bar{K}^{*0}\\phi$, measured only by BaBar and Belle."}
{"main_page": "https://arxiv.org/abs/2404.01222", "pdf": "https://arxiv.org/pdf/2404.01222", "title": "Nonfactorizable charming-loop contribution to FCNC $B_s\\to γ  l^+l^-$ decay", "authors": "Ilia Belov, Alexander Berezhnoy, Dmitri Melikhov", "subjects": "High Energy Physics - Phenomenology (hep-ph)", "abstract": "We present the first theoretical calculation of nonfactorizable charm-quark loop contributions to the $B_s\\to \\gamma l^+l^-$ amplitude. We calculate the relevant form factors, $H_{A,V}^{\\rm NF}(k'^2,k^2)$, and provide convenient parametrizations of our results in the form of fit functions of two variables, $k'^2$ and $k^2$, applicable in the region below hadron resonances, $k'^2 < M_{J/\\psi}^2$ and $k^2 < M_{\\phi}^2$. We report that factorizable and nonfactorizable charm contributions to the $B_s\\to\\gamma l^+l^-$ amplitude have opposite signs. To compare the charm and the top contributions, it is convenient to express the NF charming loop contribution as a non-universal (i.e., dependent on the reaction) $q^2$-dependent correction $\\Delta^{\\rm NF}C_7(q^2)$ to the Wilson coefficient $C_7$. For the $B_s\\to\\gamma l^+l^-$ amplitude, the correction is found to be positive, $\\Delta^{\\rm NF} C_7(q^2)/C_7 > 0$."}
{"main_page": "https://arxiv.org/abs/2404.01238", "pdf": "https://arxiv.org/pdf/2404.01238", "title": "Mass Spectra of Full-Heavy and Double-Heavy Tetraquark States in the  Conventional Quark Model", "authors": "Qi Meng, Guang-Juan Wang, Makoto Oka", "subjects": "High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Experiment (hep-ex); High Energy Physics - Lattice (hep-lat)", "abstract": "A comprehensive study of the $S$-wave heavy tetraquark states with identical quarks and antiquarks, specifically $QQ{\\bar Q'}\\bar Q'$ ($Q, Q'=c,b$), $QQ\\bar s\\bar s$/$\\bar Q\\bar Q ss$, and $QQ\\bar q\\bar q$/$\\bar Q\\bar Q qq$ ($q=u,d$), are studied in a unified constituent quark model. This model contains the one-gluon exchange and confinement potentials. The latter is modeled as the sum of all two-body linear potentials. We employ the Gaussian expansion method to solve the full four-body Schr\\\"{o}dinger equations, and search bound and resonant states using the complex-scaling method. We then identify $3$ bound and $62$ resonant states. The bound states are all $QQ\\bar q\\bar q$ states with the isospin and spin-parity quantum numbers $I(J^P)=0(1^+)$: two bound $bb\\bar{q}\\bar{q}$ states with the binding energies, 153 MeV and 4 MeV below the $BB^*$ threshold, and a shallow $cc\\bar{q}\\bar{q}$ state at $-15$ MeV from the $DD^*$ threshold. The deeper $bb\\bar q \\bar q$ bound state aligns with the lattice QCD predictions, while $cc\\bar q\\bar q$ bound state, still has a much larger binding energy than the recently observed $T^+_{cc}$ by LHCb collaboration. No bound states are identified for the $QQ\\bar Q'\\bar Q'$, $QQ\\bar s\\bar s$ and $QQ\\bar q\\bar q$ with $I=1$. Our analysis shows that the bound $QQ\\bar Q'\\bar Q'$ states are more probable with a larger mass ratio, $m_Q/m_{Q'}$. Experimental investigation for these states is desired, which will enrich our understanding of hadron spectroscopy and probe insights into the confinement mechanisms within tetraquarks."}
{"main_page": "https://arxiv.org/abs/2404.01244", "pdf": "https://arxiv.org/pdf/2404.01244", "title": "Searching for enhancement in coalescence of in-jet (anti-)deuterons in  proton-proton collisions", "authors": "Yoshini Bailung, Neha Shah, Ankhi Roy", "subjects": "High Energy Physics - Phenomenology (hep-ph)", "abstract": "Recent measurements from ALICE report that $``$in-jet'' nucleons carry a higher probability of forming a deuteron via coalescence than the nucleons from the underlying event (UE). This study makes use of an event shape classifier to separate the $``$in-jet'' deuterons and the deuterons in the UE produced in high multiplicity proton-proton collisions at $\\sqrt{s} = 13$ TeV. Event shape variables such as transverse spherocity allow the categorization of hard and soft components of an event, which can be divided into two respective classes; $``$jetty'' and $``$isotropic''. The $``$jetty'' deuterons minus the contribution of the deuterons from the $``$isotropic'' event are taken as $``$in-jet'' deuterons, and the coalescence mechanism is tested. The coalescence is performed with a Wigner function formalism, augmented as an afterburner to \\textsc{pythia}8. The possible enhancement of the coalescence probability of $``$in-jet'' deuterons is investigated by calculating the coalescence parameter ($B_{2}$) in different spherocity classes in high-multiplicity $pp$ collisions."}
{"main_page": "https://arxiv.org/abs/2404.01290", "pdf": "https://arxiv.org/pdf/2404.01290", "title": "On the potential of Light-Cone Sum Rules without Quark-Hadron Duality", "authors": "A. Carvunis, F. Mahmoudi, Y. Monceaux", "subjects": "High Energy Physics - Phenomenology (hep-ph)", "abstract": "This work addresses the calculation of local form factors involved in the theoretical predictions of semileptonic $B$-meson decays at low-$q^2$. We present a new approach to the method of QCD Light-Cone Sum Rule with $B-$meson Light-Cone Distribution Amplitudes. In our strategy, we bypass the quark-hadron duality (QHD) approximation which usually contributes an unknown and potentially large systematic error to the prediction of form factors. We trade this improvement for an increased reliance on higher-order contributions in perturbation theory. Unlike the systematic error from QHD, truncation errors are assessable and systematically improvable, hence allowing robust predictions of form factors. For the transitions $B\\to \\pi,\\rho,K^{(*)}$, our predictions agree with the literature for all form factors at $q^2=0$."}
