{"main_page": "https://arxiv.org/abs/2404.00070", "pdf": "https://arxiv.org/pdf/2404.00070", "title": "The Canvas of Holography in (A)dS/CFT", "authors": "Vaibhav Kalvakota, Aayush Verma", "subjects": "High Energy Physics - Theory (hep-th); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "The dynamic of holography between anti-de Sitter space holography and de Sitter holography is a very fascinating comparison, which provides many key insights into what we expect from holography in general. In this Essay, we highlight this dynamic with three examples: first, when taking Wheeler-DeWitt states to the asymptotic boundary, the dual interpretation is unclear in de Sitter. Second, what we make of bulk reconstruction and subregion duality in AdS/CFT is not trivially reflected in the dS/CFT scenario. Third, a way of formulating emergence and subregion-subalgebra duality in de Sitter space does not yet exist. With these examples, we provide some musings on this canvas of holography in the settings of (A)dS/CFT."}
{"main_page": "https://arxiv.org/abs/2404.00244", "pdf": "https://arxiv.org/pdf/2404.00244", "title": "General Expressions for On-shell Recursion relations for Tree-level Open  String Amplitudes", "authors": "Pongwit Srisangyingcharoen", "subjects": "High Energy Physics - Theory (hep-th)", "abstract": "In this paper, we present a systematic derivation aimed at obtaining general expressions for on-shell recursion relations for tree-level open string amplitudes. Our approach involves applying the BCFW shift to an open string amplitude written in terms of multiple Gaussian hypergeometric functions. By employing binomial expansions, we demonstrate that the shifted amplitudes manifest simple poles, which correspond to scattering channels of intermediate states. Using the residue theorem, we thereby derive a general expression for these relations."}
{"main_page": "https://arxiv.org/abs/2404.00421", "pdf": "https://arxiv.org/pdf/2404.00421", "title": "Jacobi Sigma Models and Twisted Jacobi Structures", "authors": "Francesco Bascone, Franco Pezzella, Patrizia Vitale", "subjects": "High Energy Physics - Theory (hep-th); Mathematical Physics (math-ph)", "abstract": "Jacobi sigma models are two-dimensional topological non-linear field theories which are associated with Jacobi structures. The latter can be considered as a generalization of Poisson structures. After reviewing the main properties and peculiarities of these models, we focus on the twisted version in which a Wess-Zumino term is included. This modification allows for the target space to be a twisted Jacobi manifold. We discuss in particular the model on the sphere $S^5$."}
{"main_page": "https://arxiv.org/abs/2404.00497", "pdf": "https://arxiv.org/pdf/2404.00497", "title": "Interactions of massless fermionic fields in three dimensions", "authors": "Stefan Fredenhagen, Filipp Lausch, Karapet Mkrtchyan", "subjects": "High Energy Physics - Theory (hep-th)", "abstract": "All independent interaction vertices involving massless (Fang--Fronsdal) fermions in three dimensions are classified, completing the classification of interactions of massless fields of any spin. Similarly to the bosonic case, we get no independent vertices at quartic or higher order in the fields involving fields with spin $s\\geq 3/2$, and cubic vertices only for spins satisfying triangle inequalities, apart from the cases involving (matter) fields with spin $s\\leq 1$. Differently from the bosonic cases, we get only one vertex for each triple of spins with two Majorana fermions and one boson, which is parity even (odd) when the sum of the spins of all fields involved is odd (even). When the two Majorana fermions are identical, their coupling to an odd-spin boson is trivialized. We comment on the non-trivial holographic dictionary relating these vertices to $CFT$ correlators in two dimensions."}
{"main_page": "https://arxiv.org/abs/2404.00698", "pdf": "https://arxiv.org/pdf/2404.00698", "title": "Stringy constraints on primordial electromagnetic fields in axion  inflation", "authors": "Hajime Otsuka, Ryo Yokokura", "subjects": "High Energy Physics - Theory (hep-th); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph)", "abstract": "We study primordial electromagnetic fields in effective actions of string theory. In contrast to a conventional scenario of producing primordial electromagnetic fields induced by the axion inflation, we deal with the Dirac-Born-Infeld action as a non-linear generation of Maxwell theory. It turns out that the intensity of generated electromagnetic fields is bounded from above by the string scale which can also be rewritten in terms of supersymmetry breaking scale in the context of type IIB Large Volume Scenario. The instability parameter $\\xi$ is constrained by the tadpole cancellation condition of D3-branes and a realization of hierarchy between the string scale and the Hubble scale of inflation."}
{"main_page": "https://arxiv.org/abs/2404.00718", "pdf": "https://arxiv.org/pdf/2404.00718", "title": "A local Generalized second law in crossed product constructions", "authors": "Mohd Ali, Vardarajan Suneeta", "subjects": "High Energy Physics - Theory (hep-th)", "abstract": "In this paper, we show a local generalized second law (the generalized entropy is nondecreasing) in crossed product constructions for both asymptotically flat and asymptotically $AdS$ maximally extended static and Kerr black holes, using modular theory. The new ingredient is the use of results from a recent paper discussing the entropy of the algebra of operators in subregions of arbitrary spacetimes. These results rely on an assumption which we show is true in our setting. In the last part of the paper, we look at modular Hamiltonians of deformed half-spaces in a class of static spacetimes, including the Schwarzschild spacetime. These are computed using path integrals, and we primarily compute them to investigate whether these non-local modular Hamiltonians can be made local by subtracting off pieces from the algebra and its commutant, as has been surmised in the literature. Along the way, the averaged null energy condition (ANEC) also follows in this class of spacetimes."}
{"main_page": "https://arxiv.org/abs/2404.00761", "pdf": "https://arxiv.org/pdf/2404.00761", "title": "Cosmological singularities, holographic complexity and entanglement", "authors": "K. Narayan, Hitesh K. Saini, Gopal Yadav", "subjects": "High Energy Physics - Theory (hep-th); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "We study holographic volume complexity for various families of holographic cosmologies with Kasner-like singularities, in particular with $AdS$, hyperscaling violating and Lifshitz asymptotics. We find through extensive numerical studies that the complexity surface always bends in the direction away from the singularity and transitions from spacelike near the boundary to lightlike in the interior. As the boundary anchoring time slice approaches the singularity, the transition to lightlike is more rapid, with the spacelike part shrinking. The complexity functional has vanishing contributions from the lightlike region so in the vicinity of the singularity, complexity is vanishingly small, indicating a dual Kasner state of vanishingly low complexity, suggesting an extreme thinning of the effective degrees of freedom dual to the near singularity region. We also develop further previous studies on extremal surfaces for holographic entanglement entropy, and find that in the IR limit they reveal similar behaviour as complexity."}
{"main_page": "https://arxiv.org/abs/2404.00763", "pdf": "https://arxiv.org/pdf/2404.00763", "title": "Communicating Multiverses in Holographic de-Sitter Braneworld", "authors": "Gopal Yadav", "subjects": "High Energy Physics - Theory (hep-th); General Relativity and Quantum Cosmology (gr-qc)", "abstract": "In this paper, we construct the wedge holography for the de-Sitter space a bulk theory. First, we discuss a more general mathematical construction of wedge holography in parallel with wedge holography construction for the AdS bulk, and then we construct the wedge holography in the extended static patch. In the first case, we prove that one can construct wedge holography for the de-Sitter bulk for the static patch as well as global coordinate metric on end-of-the-world branes. Extended static patch wedge holography is constructed by joining the two copies of double holography in DS/dS correspondence. We find that wedge holography with extended static patch metric leads to the emergence of communicating universes. Further, we propose a model which provides the theoretical evidence of communicating multiverses."}
{"main_page": "https://arxiv.org/abs/2404.00773", "pdf": "https://arxiv.org/pdf/2404.00773", "title": "Half-sided Translations and the Information Recovery from Radiation", "authors": "Krishna Jalan, Roji Pius, Manish Ramchander", "subjects": "High Energy Physics - Theory (hep-th)", "abstract": "The island paradigm asserts that after the Page time the operators in the interior of an AdS2 eternal black hole in equilibrium with a finite temperature non-gravitating bath can not be reconstructed using the operators in the black hole region outside the horizon. In a recent paper, we demonstrated this using the black hole interior reconstruction proposal due to Leutheusser and Liu, based on the half-sided translations. This was done by introducing a notion of the reduced half-sided translations associated with the algebra of operators restricted to the black hole region outside the horizon, and by showing that albeit the reduced half-sided translations translate operators in the black hole region outside the horizon to the black hole interior before the Page time, it fails to do so after the Page time. In this paper, we demonstrate the second assertion of the island paradigm, which states that after the Page time the operators in the black hole interior can be reconstructed using the operators in the bath. We show that even though before the Page time the reduced half-sided translations associated with the algebra of operators restricted to the bath do not translate operators in the bath to the black hole interior, after the Page time they take them to the black hole interior."}
{"main_page": "https://arxiv.org/abs/2404.00803", "pdf": "https://arxiv.org/pdf/2404.00803", "title": "Plumbing the wormholes of string theory flux compactifications", "authors": "Alex Buchel", "subjects": "High Energy Physics - Theory (hep-th)", "abstract": "Thus far, the known wormholes in string theory connecting disjoint boundaries represented by finite volume quotients of hyperbolic spaces leak: they are non-perturbatively unstable towards brane-anti-brane nucleation in the flux backgrounds that support these wormholes. Turning on additional fluxes suppressed this instability, but would not completely eliminate it. We present the first example of a non-perturbatively stable wormhole in type IIB supergravity on a warped squashed conifold with fluxes."}
{"main_page": "https://arxiv.org/abs/2404.00877", "pdf": "https://arxiv.org/pdf/2404.00877", "title": "Building up quantum spacetimes with BCFT Legos", "authors": "Ling-Yan Hung, Yikun Jiang", "subjects": "High Energy Physics - Theory (hep-th); Strongly Correlated Electrons (cond-mat.str-el); General Relativity and Quantum Cosmology (gr-qc); Mathematical Physics (math-ph); Quantum Physics (quant-ph)", "abstract": "Is it possible to read off the quantum gravity dual of a CFT directly from its operator algebra? In this essay, we present a step-by-step recipe synthesizing results and techniques from conformal bootstrap, topological symmetries, tensor networks, a novel symmetry-preserving real-space renormalization algorithm devised originally in lattice models, and the asymptotics of quantum $6j$ symbols, thereby providing an answer in the affirmative. Quantum 2D Liouville theory serves as a simple and explicit example, illustrating how the quantum gravitational path integral can be built up from local pieces of BCFT correlation functions, which we call the ``BCFT Legos''. The constructive map between gravity and CFT naturally and explicitly bridges local geometrical data, algebraic structures, and quantum entanglement, as envisaged by the $\\it{It \\, from \\, Qubit}$ motto."}
{"main_page": "https://arxiv.org/abs/2404.00919", "pdf": "https://arxiv.org/pdf/2404.00919", "title": "Nishimori's self-tuning as evidence for the existence of God", "authors": "John McGreevy, Tarun Grover", "subjects": "High Energy Physics - Theory (hep-th); Quantum Physics (quant-ph)", "abstract": "Apparent violations of Naturalness may be explained by positing the existence of an omniscient but disinterested and possibly fallible Observer who regularly performs von Neumann measurements on us (and everything else). We comment briefly on the implications for the construction of scalable quantum computers."}
{"main_page": "https://arxiv.org/abs/2404.00957", "pdf": "https://arxiv.org/pdf/2404.00957", "title": "Four-Derivative Yang-Mills Couplings in Heterotic Theory through  T-Duality", "authors": "Mohammad R. Garousi", "subjects": "High Energy Physics - Theory (hep-th)", "abstract": "This study delves into the dimensional reduction of the classical effective action of heterotic string theory on a circle, along with its T-duality symmetry, with the aim of identifying the bosonic couplings. To achieve this, we propose a truncation scheme for the generalized Buscher rules and the reduced action, specifically targeting the truncation of the nonlinear appearance of the scalar component of the Yang-Mills field in the base space. By imposing this truncated T-duality on the reduced action, we successfully determine the four-derivative bosonic couplings in the minimal basis, where field redefinition is imposed. Notably, these couplings, which are associated with the Lorentz Chern-Simons coupling $H\\Omega$, exhibit an exact correspondence with the NS-NS couplings found in the Metsaev-Tseytlin action. Furthermore, we investigate the bosonic couplings in the maximal basis, where field redefinition is not imposed. In this scenario, the truncated T-duality fixes the effective action up to 17 arbitrary parameters. By assigning specific values to these parameters, we establish a framework in which the NS-NS couplings align with those in the Meissner action. Remarkably, within this scheme, the Yang-Mills couplings precisely coincide with those obtained through the S-matrix method."}
{"main_page": "https://arxiv.org/abs/2404.01028", "pdf": "https://arxiv.org/pdf/2404.01028", "title": "The energy-frequency diagram of the (1+1)-dimensional $Φ^4$ oscillon", "authors": "N. V. Alexeeva, I. V. Barashenkov, Alain Dika, Raphael De Sousa", "subjects": "High Energy Physics - Theory (hep-th); Pattern Formation and Solitons (nlin.PS)", "abstract": "Two different methods are used to study the existence and stability of the (1+1)-dimensional $\\Phi^4$ oscillon. The variational technique approximates it by a periodic function with a set of adiabatically changing parameters. An alternative approach treats oscillons as standing waves in a finite-size box; these are sought as solutions of a boundary-value problem on a two-dimensional domain. The numerical analysis reveals that the standing wave's energy-frequency diagram is fragmented into disjoint segments with $\\omega_{n-1} < \\omega < \\omega_{n-2}$, where $\\omega_n=\\frac{2}{n+1}$. In the interval $(\\omega_{n-1}, \\omega_{n-2})$, the structure's small-amplitude wings are formed by the $n$-th harmonic radiation ($n=2,3, ...$). All standing waves are practically stable: perturbations may result in the deformation of the wave's radiation wings but do not affect its core. The variational approximation involving the first, zeroth and second harmonic components provides an accurate description of the oscillon with the frequency in $(\\omega_1, \\omega_0)$, but breaks down as $\\omega$ falls out of that interval."}
{"main_page": "https://arxiv.org/abs/2404.01113", "pdf": "https://arxiv.org/pdf/2404.01113", "title": "Holographic reconstruction of flat spacetime", "authors": "Zezhuang Hao", "subjects": "High Energy Physics - Theory (hep-th)", "abstract": "The flat/CFT dictionary between the bulk gravitational theory and boundary conformal field theory is systematically developed in this paper. Asymptotically flat spacetime is built up by asymptotically AdS hyperboloid slices in terms of Fefferman Graham coordinates together with soft modes propagating between different slices near the null boundary. Then we construct the flat holography dictionary based on studying Einstein equation at zero and first order and it turns out that these correspond to the description of hard and soft sector for the field theory from the boundary point of view. The explicit expression for energy-stress tensor is also determined by performing holographic renormalisation on the Einstein Hilbert action. By studying the anomalies of the energy-stress tensor, we obtain the leading and subleading contribution to the central charge. Einstein equations in the bulk are related to the Ward identities of the boundary theory and we find that the boundary CFT energy-stress tensor is not conserved due to the existence of radiative soft modes which will generate the energy flow through the null boundary."}
{"main_page": "https://arxiv.org/abs/2404.01280", "pdf": "https://arxiv.org/pdf/2404.01280", "title": "Is $γ_{KLS}$-generalized statistical field theory complete?", "authors": "P.R.S. Carvalho", "subjects": "High Energy Physics - Theory (hep-th); Statistical Mechanics (cond-mat.stat-mech); Mathematical Physics (math-ph)", "abstract": "In this Letter we introduce some field-theoretic approach for computing the critical properties of $\\gamma_{KLS}$-generalized systems undergoing continuous phase transitions, namely $\\gamma_{KLS}$-statistical field theory. From this new approach emerges the new generalized O($N$)$_{\\gamma_{KLS}}$ universality class, which is capable of encompassing nonconventional critical exponents for real imperfect systems known as manganites not described by standard statistical field theory. We compare the generalized results with those obtained from measurements in manganites. The agreement was satisfactory, where the relative errors are $< 5\\%$ for the most of manganites used. Although the present approach describes the aforementioned nonconventional critical indices, we show that it is not complete. For example, it does not explain the results for some other manganites, being explained only for nonextensive statistical field theory recently introduced in literature. So, $\\gamma_{KLS}$-statistical field theory has to be discarded for statistical mechanics generalization purposes."}
