{"main_page": "https://arxiv.org/abs/2404.01002", "pdf": "https://arxiv.org/pdf/2404.01002", "title": "Study of Curved Domain-wall Fermions on a Lattice", "authors": "Shoto Aoki", "subjects": "High Energy Physics - Lattice (hep-lat); Mesoscale and Nanoscale Physics (cond-mat.mes-hall); High Energy Physics - Theory (hep-th)", "abstract": "In this thesis, we consider fermion systems on square lattice spaces with a curved domain-wall mass term. In a similar way to the flat case, we find massless and chiral states localized at the wall. In the case of $S^1$ and $S^2$ domain-wall embedded into a square lattice, we find that these edge states feel gravity through the induced spin connection. In the conventional continuum limit of the higher dimensional lattice, we find a good consistency with the analytic results in the continuum theory. We also confirm that the rotational symmetry is recovered automatically. We also discuss the effect of a $U(1)$ gauge connection on a two-dimensional lattice fermion with the $S^1$ domain-wall mass term. We find that the gauge field changes the eigenvalue spectrum of the boundary system by the Aharanov-Bohm effect and generates an anomaly of the time-reversal ($T$) symmetry. Our numerical evaluation is consistent with the Atiyah-Patodi-Singer index, which describes the cancellation of the $T$ anomaly by the topological term on the bulk system. When we squeeze the flux inside one plaquette while keeping the total flux unchanged, the anomaly inflow undergoes a drastic change. The intense flux gives rise to an additional domain wall around the flux. We observe a novel localized mode at the flux, canceling the $T$ anomaly on the wall instead of the topological term in the bulk. We apply the study to a problem in condensed matter physics. It is known that inside topological insulators, a vortex or monopole acquires a fractional electric charge and turns into a dyon. Describing the topological insulator as a negative mass region of a Dirac fermion, we provide a microscopic description of this phenomenon in terms of the dynamical domain-wall creation."}
