{"main_page": "https://arxiv.org/abs/2404.00180", "pdf": "https://arxiv.org/pdf/2404.00180", "title": "Differentiable nuclear deexcitation simulation for low energy neutrino  physics", "authors": "Pablo Barham Alzás, Radi Radev", "subjects": "High Energy Physics - Experiment (hep-ex)", "abstract": "Neutrino-nucleus interactions play an important role in present and future neutrino experiments. The accurate simulation of these interactions at low energies ($<$100 MeV) is crucial for the detection and study of supernova, solar and atmospheric neutrinos. In particular, the reconstruction of the incoming neutrino properties depends on the ability to measure the products from the deexcitation of the final state nucleus after the initial neutrino-nucleus scattering reaction. A realistic nuclear deexcitation model that can correctly manage the theoretical uncertainties in the process is key to determine the response of a detector to low energy neutrinos and estimate the overall systematic uncertainties that affect it. Automatic differentiation frameworks like PyTorch or JAX, widely used in the field of Machine Learning, provide us the tools to compute exact gradients of the simulation outputs with respect to the model parameters. Such differentiable simulators can be applied in simulator tuning to match observed data and forward modeling to efficiently infer the impact of parameter distributions to the physics output, or for parameter inference acting as a likelihood estimator. This paradigm can pave the way to a fully differentiable analysis of the whole simulation chain or direct integration with preexisting Machine Learning tools. As a proof of concept, in this work we implement a fully differentiable nuclear deexcitation simulation based on a simplified version of the Hauser-Feshbach statistical emission model."}
{"main_page": "https://arxiv.org/abs/2404.00201", "pdf": "https://arxiv.org/pdf/2404.00201", "title": "Angular analysis of $B \\to K^* e^+ e^-$ in the low-$q^2$ region with new  electron identification at Belle", "authors": "Belle Collaboration: D. Ferlewicz, P. Urquijo, I. Adachi, K. Adamczyk, H. Aihara, D. M. Asner, H. Atmacan, R. Ayad, V. Babu, Sw. Banerjee, P. Behera, K. Belous, J. Bennett, M. Bessner, V. Bhardwaj, B. Bhuyan, T. Bilka, D. Biswas, D. Bodrov, M. Bračko, P. Branchini, T. E. Browder, A. Budano, M. Campajola, L. Cao, D. Červenkov, M.-C. Chang, B. G. Cheon, K. Chilikin, H. E. Cho, K. Cho, S.-K. Choi, Y. Choi, S. Choudhury, S. Das, N. Dash, G. de Marino, G. De Pietro, R. Dhamija, F. Di Capua, J. Dingfelder, Z. Doležal, T. V. Dong, S. Dubey, P. Ecker, D. Epifanov, T. Ferber, B. G. Fulsom, V. Gaur, A. Garmash, A. Giri, P. Goldenzweig, E. Graziani, T. Gu, Y. Guan, K. Gudkova, C. Hadjivasiliou, T. Hara, K. Hayasaka, H. Hayashii, S. Hazra, M. T. Hedges, D. Herrmann, W.-S. Hou, C.-L. Hsu,  et al. (104 additional authors not shown)", "subjects": "High Energy Physics - Experiment (hep-ex)", "abstract": "We perform an angular analysis of the $B\\to K^* e^+ e^-$ decay for the dielectron mass squared, $q^2$, range of $0.0008$ to $1.1200 ~\\text{GeV}^2 /c^4$ using the full Belle data set in the $K^{*0} \\to K^+ \\pi^-$ and $K^{*+} \\to K_S^0 \\pi^+$ channels, incorporating new methods of electron identification to improve the statistical power of the data set. This analysis is sensitive to contributions from right-handed currents from physics beyond the Standard Model by constraining the Wilson coefficients $\\mathcal{C}_7^{(\\prime)}$. We perform a fit to the $B\\to K^* e^+ e^-$ differential decay rate and measure the imaginary component of the transversality amplitude to be $A_T^{\\rm Im} = -1.27 \\pm 0.52 \\pm 0.12$, and the $K^*$ transverse asymmetry to be $A_T^{(2)} = 0.52 \\pm 0.53 \\pm 0.11$. The resulting constraints on the value of $\\mathcal{C}_7^{\\prime}$ are consistent with the Standard Model within a $2\\sigma$ confidence interval."}
{"main_page": "https://arxiv.org/abs/2404.00280", "pdf": "https://arxiv.org/pdf/2404.00280", "title": "$CP$ violation in $D$ meson decays at Belle I/II", "authors": "Michel Bertemes (on behalf of the Belle I/II collaboration)", "subjects": "High Energy Physics - Experiment (hep-ex)", "abstract": "We present recent measurements from the Belle and Belle II experiment related to $CP$ violation in decays of charmed mesons via two complementary approaches. We also propose a new algorithm to determine the flavor of neutral charmed mesons."}
{"main_page": "https://arxiv.org/abs/2404.00592", "pdf": "https://arxiv.org/pdf/2404.00592", "title": "Experimental status of $|V_{cd}|$ and $|V_{cs}|$", "authors": "Tengjiao Wang (on behalf of the BESIII Collaboration)", "subjects": "High Energy Physics - Experiment (hep-ex)", "abstract": "The Cabibbo-Kobayashi-Maskawa (CKM) matrix elements $|V_{cd}|$ and $|V_{cs}|$ are essential to test the unitary of CKM matrix. Before 2014, many results of $|V_{cd}|$ and $|V_{cs}|$ had been reported at BaBar, Belle, and CLEO experiments. The precisions of the most accurate results of $|V_{cd}|$ and $|V_{cs}|$ are 4.4\\% and 3.3\\%, respectively. After that, benefitting from larger data samples collected at BESIII, the precisions of $|V_{cd}|$ and $|V_{cs}|$ are improved to 1.8\\% and 0.9\\%, respectively."}
{"main_page": "https://arxiv.org/abs/2404.00908", "pdf": "https://arxiv.org/pdf/2404.00908", "title": "Dark photon constraints from a 7.139 GHz cavity haloscope experiment", "authors": "Dong He, Jie Fan, Xin Gao, Yu Gao, Nick Houston, Zhongqing Ji, Yirong Jin, Chuang Li, Jinmian Li, Tianjun Li, Shi-hang Liu, Jia-Shu Niu, Zhihui Peng, Liang Sun, Zheng Sun, Jia Wang, Puxian Wei, Lina Wu, Zhongchen Xiang, Qiaoli Yang, Chi Zhang, Wenxing Zhang, Xin Zhang, Dongning Zheng, Ruifeng Zheng, Jian-yong Zhou", "subjects": "High Energy Physics - Experiment (hep-ex); High Energy Physics - Phenomenology (hep-ph)", "abstract": "The dark photon is a promising candidate for the dark matter which comprises most of the matter in our visible Universe. Via kinetic mixing with the Standard Model it can also be resonantly converted to photons in an electromagnetic cavity, offering novel experimental possibilities for the discovery and study of dark matter. We report the results of a pathfinder dark photon dark matter cavity search experiment performed at Hunan Normal University and the Institute of Physics, Chinese Academy of Sciences, representing the first stage of the APEX (Axion and dark Photon EXperiment) program. Finding no statistically significant excess, we place an upper limit on the kinetic mixing parameter $|\\chi|<3.7\\times 10^{-13}$ around $m_A\\simeq 29.5$ $\\mu$eV at 90% confidence level. This result exceeds other constraints on dark photon dark matter in this frequency range by roughly an order of magnitude."}
{"main_page": "https://arxiv.org/abs/2404.01071", "pdf": "https://arxiv.org/pdf/2404.01071", "title": "Machine Learning in High Energy Physics: A review of heavy-flavor jet  tagging at the LHC", "authors": "Spandan Mondal, Luca Mastrolorenzo", "subjects": "High Energy Physics - Experiment (hep-ex); Data Analysis, Statistics and Probability (physics.data-an)", "abstract": "The application of machine learning (ML) in high energy physics (HEP), specifically in heavy-flavor jet tagging at Large Hadron Collider (LHC) experiments, has experienced remarkable growth and innovation in the past decade. This review provides a detailed examination of current and past ML techniques in this domain. It starts by exploring various data representation methods and ML architectures, encompassing traditional ML algorithms and advanced deep learning techniques. Subsequent sections discuss specific instances of successful ML applications in jet flavor tagging in the ATLAS and CMS experiments at the LHC, ranging from basic fully-connected layers to graph neural networks employing attention mechanisms. To systematically categorize the advancements over the LHC's three runs, the paper classifies jet tagging algorithms into three generations, each characterized by specific data representation techniques and ML architectures. This classification aims to provide an overview of the chronological evolution in this field. Finally, a brief discussion about anticipated future developments and potential research directions in the field is presented."}
