{"main_page": "https://arxiv.org/abs/2404.00084", "pdf": "https://arxiv.org/pdf/2404.00084", "title": "KKL theorem for the influence of a set of variables", "authors": "Tomasz Przybyłowski", "subjects": "Combinatorics (math.CO); Discrete Mathematics (cs.DM); Probability (math.PR)", "abstract": "We study the notion of the influence of a set of variables on a Boolean function, which was recently introduced by Tal. We show that for an arbitrary fixed $d$, every Boolean function $f$ on $n$ variables admits a $d$-set of influence at least $\\frac{1}{10} \\mathbf{W}^{\\geq d}(f) (\\frac{\\log n}{n})^d$, which is a direct generalisation of the Kahn-Kalai-Linial theorem. We give an example demonstrating essential sharpness of this result. Further, we generalise a related theorem of Oleszkiewicz regarding influences of pairs of variables."}
{"main_page": "https://arxiv.org/abs/2404.00194", "pdf": "https://arxiv.org/pdf/2404.00194", "title": "A coarse Tutte polynomial for hypermaps", "authors": "Joanna A. Ellis-Monaghan, Iain Moffatt, Steven Noble", "subjects": "Combinatorics (math.CO)", "abstract": "We give an analogue of the Tutte polynomial for hypermaps. This polynomial can be defined as either a sum over subhypermaps, or recursively through deletion-contraction reductions where the terminal forms consist of isolated vertices. Our Tutte polynomial extends the classical Tutte polynomial of a graph as well as the Tutte polynomial of an embedded graph (i.e., the ribbon graph polynomial), and it is a specialization of the transition polynomial via a medial map transformation. We give hypermap duality and partial duality identities for our polynomial, as well as some evaluations, and examine relations between our polynomial and other hypermap polynomials."}
{"main_page": "https://arxiv.org/abs/2404.00222", "pdf": "https://arxiv.org/pdf/2404.00222", "title": "Positivity preservers over finite fields", "authors": "Dominique Guillot, Himanshu Gupta, Prateek Kumar Vishwakarma", "subjects": "Combinatorics (math.CO); Commutative Algebra (math.AC)", "abstract": "We resolve an algebraic version of Schoenberg's celebrated theorem [Duke Math. J.}, 1942] characterizing entrywise matrix transforms that preserve positive definiteness. Compared to the classical real and complex settings, we consider matrices with entries in a finite field and obtain a complete characterization of such preservers for matrices of a fixed dimension. When the dimension of the matrices is at least $3$, we prove that, surprisingly, the positivity preservers are precisely the positive multiples of the field's automorphisms. Our work makes crucial use of the well-known character-sum bound due to Weil, and of a result of Carlitz [Proc. Amer. Math. Soc., 1960] that provides a characterization of the automorphisms of Paley graphs."}
{"main_page": "https://arxiv.org/abs/2404.00263", "pdf": "https://arxiv.org/pdf/2404.00263", "title": "Triangular faces of the order and chain polytope of a maximal ranked  poset", "authors": "Aki Mori", "subjects": "Combinatorics (math.CO)", "abstract": "Let $\\mathscr{O}(P)$ and $\\mathscr{C}(P)$ denote the order polytope and chain polytope, respectively, associated with a finite poset $P$. We prove the following result: if $P$ is a maximal ranked poset, then the number of triangular $2$-faces of $\\mathscr{O}(P)$ is less than or equal to that of $\\mathscr{C}(P)$, with equality holding if and only if $P$ does not contain an $X$-poset as a subposet."}
{"main_page": "https://arxiv.org/abs/2404.00278", "pdf": "https://arxiv.org/pdf/2404.00278", "title": "A classification of generalized root systems", "authors": "Michael Cuntz, Bernhard Mühlherr", "subjects": "Combinatorics (math.CO); Quantum Algebra (math.QA); Representation Theory (math.RT)", "abstract": "Dimitrov and Fioresi introduced an object that they call a generalized root system. This is a finite set of vectors in a euclidean space satisfying certain compatibilities between angles and sums and differences of elements. They conjecture that every generalized root system is equivalent to one associated to a restriction of a Weyl arrangement. In this note we prove the conjecture and provide a complete classification of generalized root systems up to equivalence."}
{"main_page": "https://arxiv.org/abs/2404.00281", "pdf": "https://arxiv.org/pdf/2404.00281", "title": "Non-intersecting path explanation for block Pfaffians and applications  into skew-orthogonal polynomials", "authors": "Zong-Jun Yao, Shi-Hao Li", "subjects": "Combinatorics (math.CO)", "abstract": "In this paper, we mainly consider a combinatoric explanation for block Pfaffians in terms of non-intersecting paths, as a generalization of results obtained by Stembridge. As applications, we demonstrate how are generating functions of non-intersecting paths related to skew orthogonal polynomials and their deformations, including a new concept called multiple partial-skew orthogonal polynomials."}
{"main_page": "https://arxiv.org/abs/2404.00324", "pdf": "https://arxiv.org/pdf/2404.00324", "title": "Sparsity of 3-flow critical graphs", "authors": "Zdeněk Dvořák, Sergey Norin", "subjects": "Combinatorics (math.CO)", "abstract": "A connected graph G is 3-flow-critical if G does not have a nowhere-zero 3-flow, but every proper contraction of G does. We prove that every n-vertex 3-flow-critical graph other than K_2 and K_4 has at least 5n/3 edges. This bound is tight up to lower-order terms, answering a question of Li et al. (2022). It also generalizes the result of Koester (1991) on the maximum average degree of 4-critical planar graphs."}
{"main_page": "https://arxiv.org/abs/2404.00325", "pdf": "https://arxiv.org/pdf/2404.00325", "title": "Bi-eulerian embeddings of graphs and digraphs", "authors": "M. N. Ellinghama, Joanna A. Ellis-Monaghan", "subjects": "Combinatorics (math.CO)", "abstract": "In 1965 Edmonds showed that every eulerian graph has a bi-eulerian embedding, i.e., an embedding with exactly two faces, each bounded by an euler circuit. We refine this result by giving conditions for a graph to have a bi-eulerian embedding that is specifically orientable or nonorientable. We give connections to the maximum genus problem for directed embeddings of digraphs, in which every face is bounded by a directed circuit. Given an eulerian digraph $D$ with all vertices of degree 2 mod 4 and a directed euler circuit $T$ of $D$, we show that $D$ has an orientable bi-eulerian directed embedding with one of the faces bounded by $T$; this is a maximum genus directed embedding. This result also holds when $D$ has exactly two vertices of degree $0$ mod $4$, provided they are interlaced by $T$. More generally, if $D$ has $\\ell$ vertices of degree 0 mod 4, we can find an orientable directed embedding with a face bounded by $T$ and with at most $\\ell+1$ other faces. We show that given an eulerian graph $G$ and a circuit decomposition $C$ of $G$, there is an nonorientable embedding of $G$ with the elements of $C$ bounding faces and with one additional face bounded by an euler circuit, unless every block of $G$ is a cycle and $C$ is the collection of cycles of $G$. In particular, every eulerian graph that is not edgeless or a cycle has a nonorientable bi-eulerian embedding with a given euler circuit $T$ bounding one of the faces. Polynomial-time algorithms giving the specified embeddings are implicit in our proofs."}
{"main_page": "https://arxiv.org/abs/2404.00410", "pdf": "https://arxiv.org/pdf/2404.00410", "title": "Constructing segments of quadratic length in $Spec(T_n)$ through  segments of linear length", "authors": "Artem Kravchuk", "subjects": "Combinatorics (math.CO)", "abstract": "A Transposition graph $T_n$ is defined as a Cayley graph over the symmetric group $Sym_n$ generated by all transpositions. It is known that the spectrum of $T_n$ consists of integers, but it is not known exactly how these numbers are distributed. In this paper we prove that integers from the segment $[-n, n]$ lie in the spectrum of $T_n$ for any $n\\geqslant 31$. Using this fact we also prove the main result of this paper that a segment of quadratic length with respect to $n$ lies in the spectrum of $T_n$."}
{"main_page": "https://arxiv.org/abs/2404.00536", "pdf": "https://arxiv.org/pdf/2404.00536", "title": "Invariant theory for the face algebra of the braid arrangement", "authors": "Patricia Commins", "subjects": "Combinatorics (math.CO); Representation Theory (math.RT)", "abstract": "The faces of the braid arrangement form a monoid. The associated monoid algebra -- the face algebra -- is well-studied, especially in relation to card shuffling and other Markov chains. In this paper, we explore the action of the symmetric group on the face algebra from the perspective of invariant theory. Bidigare proved the invariant subalgebra of the face algebra is (anti)isomorphic to Solomon's descent algebra. We answer the more general question: what is the structure of the face algebra as a simultaneous representation of the symmetric group and Solomon's descent algebra? Special cases of our main theorem recover the Cartan invariants of Solomon's descent algebra discovered by Garsia-Reutenauer and work of Uyemura-Reyes on certain shuffling representations. Our proof techniques involve the homology of intervals in the lattice of set partitions."}
{"main_page": "https://arxiv.org/abs/2404.00567", "pdf": "https://arxiv.org/pdf/2404.00567", "title": "Characterizations of amorphic schemes and fusions of pairs", "authors": "Edwin R. van Dam, Jack H. Koolen, Yanzhen Xiong", "subjects": "Combinatorics (math.CO)", "abstract": "An association scheme is called amorphic if every possible fusion of relations gives rise to a fusion scheme. We call a pair of relations fusing if fusing that pair gives rise to a fusion scheme. We define the fusing-relations graph on the set of relations, where a pair forms an edge if it fuses. We show that if the fusing-relations graph is connected but not a path, then the association scheme is amorphic. As a side result, we show that an association scheme in which at most one relation is not strongly regular of (negative) Latin square type, is amorphic."}
{"main_page": "https://arxiv.org/abs/2404.00607", "pdf": "https://arxiv.org/pdf/2404.00607", "title": "A Refinement of a Theorem of Diaconis-Evans-Graham", "authors": "Lora R. Du, Kathy Q. Ji", "subjects": "Combinatorics (math.CO)", "abstract": "The note is dedicated to refining a theorem by Diaconis, Evans, and Graham concerning successions and fixed points of permutations. This refinement specifically addresses non-adjacent successions, predecessors, excedances, and drops of permutations."}
{"main_page": "https://arxiv.org/abs/2404.00632", "pdf": "https://arxiv.org/pdf/2404.00632", "title": "What happens when we add impartial loopy games and impartial entailing  games?", "authors": "Koki Suetsugu", "subjects": "Combinatorics (math.CO)", "abstract": "The disjunctive sum of impartial games is analyzed by Sprague-Grundy theory. The theory has been extended to loopy games and entailing games by early results. In this study, we consider further extension of this theory and show partial algebraic structure of the sum of loopy positions and entailing positions."}
{"main_page": "https://arxiv.org/abs/2404.00641", "pdf": "https://arxiv.org/pdf/2404.00641", "title": "Polynomial Bogolyubov for special linear groups via tensor rank", "authors": "Shai Evra, Guy Kindler, Noam Lifshitz", "subjects": "Combinatorics (math.CO); Group Theory (math.GR); Representation Theory (math.RT); Spectral Theory (math.SP)", "abstract": "We prove a polynomial Bogolyubov type lemma for the special linear group over finite fields. Specifically, we show that there exists an absolute constant $C>0,$ such that if $A$ is a density $\\alpha$ subset of the special linear group, then the set $AA^{-1}AA^{-1}$ contains a subgroup $H$ of density $\\alpha^C$. Moreover, this subgroup is isomorphic to a special linear group of a smaller rank. We also show that if $A$ is an approximate subgroups then it can be covered by the union of few cosets of $H$. Our proof makes use of the Gurevich--Howe notion of tensor rank, and of a strengthened Bonami type Lemma for global functions on the bilinear scheme. We also present applications to spectral bounds for global convolution operators, global product free sets, and covering numbers corresponding to global sets."}
{"main_page": "https://arxiv.org/abs/2404.00668", "pdf": "https://arxiv.org/pdf/2404.00668", "title": "Connection Heat Kernel On Connection Lattices And Connection Discrete  Torus", "authors": "Yong Lin, Shi Wan", "subjects": "Combinatorics (math.CO)", "abstract": "By the connection graph we mean an underlying weighted graph with a connection which associates edge set with an orthogonal group. This paper centers its investigation on the connection heat kernels on connection lattices and connection discrete torus. For one dimensional connection lattice, we derive the connection heat kernel expression by doing the Taylor expansion on the exponential function involving normalized connection Laplacian. We introduce a novel connection called product connection and prove that the connection heat kernel on arbitrary high dimensional lattice with product connection equals the Kronecker sum of one dimensional connection lattices' connection heat kernels. Furthermore, if the connection graph is consistent, we substantiate the interrelation between its connection heat kernel and its underlying graph's heat kernel. We define a connection called quotient connection such that discrete torus with quotient connection can be considered as a quotient graph of connection lattice, whose connection heat kernel is demonstrated to be the sum of connection lattices' connection heat kernels. In addition, we derive an alternative expression of connection heat kernel on discrete torus whenever its quotient connection is a constant connection, yielding an equation as a connection graph's trace formula."}
{"main_page": "https://arxiv.org/abs/2404.00771", "pdf": "https://arxiv.org/pdf/2404.00771", "title": "Metric dimensions of generalized Sierpiński graphs over squares", "authors": "Savari Prabhu, T. Jenifer Janany, Sandi Klavžar", "subjects": "Combinatorics (math.CO)", "abstract": "Metric dimension is a valuable parameter that helps address problems related to network design, localization, and information retrieval by identifying the minimum number of landmarks required to uniquely determine distances between vertices in a graph. Generalized Sierpi\\'{n}ski graphs represent a captivating class of fractal-inspired networks that have gained prominence in various scientific disciplines and practical applications. Their fractal nature has also found relevance in antenna design, image compression, and the study of porous materials. The hypercube is a prevalent interconnection network architecture known for its symmetry, vertex transitivity, regularity, recursive structure, high connectedness, and simple routing. Various variations of hypercubes have emerged in literature to meet the demands of practical applications. Sometimes, they are the spanning subgraphs of it. This study examines the generalized Sierpi\\'{n}ski graphs over $C_4$, which are spanning subgraphs of hypercubes and determines the metric dimension and their variants. This is in contrast to hypercubes, where these properties are inherently complicated. Along the way, the role of twin vertices in the theory of metric dimensions is further elaborated."}
{"main_page": "https://arxiv.org/abs/2404.00794", "pdf": "https://arxiv.org/pdf/2404.00794", "title": "Optimal bounds on the polynomial Schur's theorem", "authors": "Jaehoon Kim, Hong Liu, Péter Pál Pach", "subjects": "Combinatorics (math.CO)", "abstract": "Liu, Pach and S\\'andor recently characterized all polynomials $p(z)$ such that the equation $x+y=p(z)$ is $2$-Ramsey, that is, any $2$-coloring of $\\mathbb{N}$ contains infinitely many monochromatic solutions for $x+y=p(z)$. In this paper, we find asymptotically tight bounds for the following two quantitative questions. $\\bullet$ For $n\\in \\mathbb{N}$, what is the longest interval $[n,f(n)]$ of natural numbers which admits a $2$-coloring with no monochromatic solutions of $x+y=p(z)$? $\\bullet$ For $n\\in \\mathbb{N}$ and a $2$-coloring of the first $n$ integers $[n]$, what is the smallest possible number $g(n)$ of monochromatic solutions of $x+y=p(z)$? Our theorems determine $f(n)$ up to a multiplicative constant $2+o(1)$, and determine the asymptotics for $g(n)$."}
{"main_page": "https://arxiv.org/abs/2404.00811", "pdf": "https://arxiv.org/pdf/2404.00811", "title": "Ore-type conditions for existence of a jellyfish in a graph", "authors": "Jaehoon Kim, Alexandr Kostochka, Ruth Luo", "subjects": "Combinatorics (math.CO)", "abstract": "The famous Dirac's Theorem states that for each $n\\geq 3$ every $n$-vertex graph $G$ with minimum degree $\\delta(G)\\geq n/2$ has a hamiltonian cycle. When $\\delta(G)< n/2$, this cannot be guaranteed, but the existence of some other specific subgraphs can be provided. Gargano, Hell, Stacho and Vaccaro proved that every connected $n$-vertex graph $G$ with $\\delta(G)\\geq (n-1)/3$ contains a spanning {\\em spider}, i.e., a spanning tree with at most one vertex of degree at least $3$. Later, Chen, Ferrara, Hu, Jacobson and Liu proved the stronger (and exact) result that for $n\\geq 56$ every connected $n$-vertex graph $G$ with $\\delta(G)\\geq (n-2)/3$ contains a spanning {\\em broom}, i.e., a spanning spider obtained by joining the center of a star to an endpoint of a path. They also showed that a $2$-connected graph $G$ with $\\delta(G)\\geq (n-2)/3$ and some additional properties contains a spanning {\\em jellyfish} which is a graph obtained by gluing the center of a star to a vertex in a cycle disjoint from that star. Note that every spanning jellyfish contains a spanning broom. The goal of this paper is to prove an exact Ore-type bound which guarantees the existence of a spanning jellyfish: We prove that if $G$ is a $2$-connected graph on $n$ vertices such that every non-adjacent pair of vertices $(u,v)$ satisfies $d(u) + d(v) \\geq \\frac{2n-3}{3}$, then $G$ has a spanning jellyfish. As corollaries, we obtain strengthenings of two results by Chen et al.: a minimum degree condition guaranteeing the existence of a spanning jellyfish, and an Ore-type sufficient condition for the existence of a spanning broom. The corollaries are sharp for infinitely many $n$. One of the main ingredients of our proof is a modification of the Hopping Lemma due to Woodall."}
{"main_page": "https://arxiv.org/abs/2404.00873", "pdf": "https://arxiv.org/pdf/2404.00873", "title": "Localized Version of Hypergraph Erdos-Gallai Theorem", "authors": "Kai Zhao, Xiao-Dong Zhang", "subjects": "Combinatorics (math.CO)", "abstract": "This paper focuses on extensions of the classic Erd\\H{o}s-Gallai Theorem for the set of weighted function of each edge in a graph. The weighted function of an edge $e$ of an $n$-vertex uniform hypergraph $\\mathcal{H}$ is defined to a special function with respect to the number of edges of the longest Berge path containing $e$. We prove that the summation of the weighted function of all edges is at most $n$ for an $n$-vertex uniform hypergraph $\\mathcal{H}$ and characterize all extremal hypergraphs that attain the value, which strengthens and extends the hypergraph version of the classic Erd\\H{o}s-Gallai Theorem."}
{"main_page": "https://arxiv.org/abs/2404.01057", "pdf": "https://arxiv.org/pdf/2404.01057", "title": "Larger Nearly Orthogonal Sets over Finite Fields", "authors": "Ishay Haviv, Sam Mattheus, Aleksa Milojević, Yuval Wigderson", "subjects": "Combinatorics (math.CO); Computational Geometry (cs.CG); Discrete Mathematics (cs.DM)", "abstract": "For a field $\\mathbb{F}$ and integers $d$ and $k$, a set ${\\cal A} \\subseteq \\mathbb{F}^d$ is called $k$-nearly orthogonal if its members are non-self-orthogonal and every $k+1$ vectors of ${\\cal A}$ include an orthogonal pair. We prove that for every prime $p$ there exists some $\\delta = \\delta(p)>0$, such that for every field $\\mathbb{F}$ of characteristic $p$ and for all integers $k \\geq 2$ and $d \\geq k$, there exists a $k$-nearly orthogonal set of at least $d^{\\delta \\cdot k/\\log k}$ vectors of $\\mathbb{F}^d$. The size of the set is optimal up to the $\\log k$ term in the exponent. We further prove two extensions of this result. In the first, we provide a large set ${\\cal A}$ of non-self-orthogonal vectors of $\\mathbb{F}^d$ such that for every two subsets of ${\\cal A}$ of size $k+1$ each, some vector of one of the subsets is orthogonal to some vector of the other. In the second extension, every $k+1$ vectors of the produced set ${\\cal A}$ include $\\ell+1$ pairwise orthogonal vectors for an arbitrary fixed integer $1 \\leq \\ell \\leq k$. The proofs involve probabilistic and spectral arguments and the hypergraph container method."}
{"main_page": "https://arxiv.org/abs/2404.01134", "pdf": "https://arxiv.org/pdf/2404.01134", "title": "Towards a classification of $1$-homogeneous distance-regular graphs with  positive intersection number $a_1$", "authors": "Jack H. Koolen, Mamoon Abdullah, Brhane Gebremichel, Jae-Ho Lee", "subjects": "Combinatorics (math.CO)", "abstract": "Let $\\Gamma$ be a graph with diameter at least two. Then $\\Gamma$ is said to be $1$-homogeneous (in the sense of Nomura) whenever for every pair of adjacent vertices $x$ and $y$ in $\\Gamma$, the distance partition of the vertex set of $\\Gamma$ with respect to both $x$ and $y$ is equitable, and the parameters corresponding to equitable partitions are independent of the choice of $x$ and $y$. Assume $\\Gamma$ is $1$-homogeneous distance-regular with intersection number $a_1>0$ and $D\\geqslant 5$. Define $b=b_1/(\\theta_1+1)$, where $b_1$ is the intersection number and $\\theta_1$ is the second largest eigenvalue of $\\Gamma$. We show that if intersection number $c_2\\geqslant 2$, then $b\\geqslant 1$ and one of the following (i)--(vi) holds: (i) $\\Gamma$ is a regular near $2D$-gon, (ii) $\\Gamma$ is a Johnson graph $J(2D,D)$, (iii) $\\Gamma$ is a halved $\\ell$-cube where $\\ell \\in \\{2D,2D+1\\}$, (iv) $\\Gamma$ is a folded Johnson graph $\\bar{J}(4D,2D)$, (v) $\\Gamma$ is a folded halved $(4D)$-cube, (vi) the valency of $\\Gamma$ is bounded by a function of $b$. Using this result, we characterize $1$-homogeneous graphs with classical parameters and $a_1>0$, as well as tight distance-regular graphs."}
{"main_page": "https://arxiv.org/abs/2404.01274", "pdf": "https://arxiv.org/pdf/2404.01274", "title": "Growth of regular partitions 1: Improved bounds for small slicewise  VC-dimension", "authors": "C. Terry", "subjects": "Combinatorics (math.CO); Logic (math.LO)", "abstract": "This is Part 1 in a series of papers about sizes of regular partitions of $3$-uniform hypergraphs. Previous work of the author and Wolf, and independently Chernikov and Towsner, showed that $3$-uniform hypergraphs of small slicewise VC-dimension admit homogeneous partitions. The results of Chernikov and Towsner did not produce explicit bounds, while the work of the author and Wolf relied on a strong version of hypergraph regularity, and consequently produced a Wowzer type bound on the size of the partition. This paper gives a new proof of this result, yielding $\\e$-homogeneous partitions of size at most $2^{2^{\\epsilon^{-K}}}$, where $K$ is a constant depending on the slicewise VC-dimension. This result is a crucial ingredient in Part 2 of the series, which investigates the growth of weak regular partitions in hereditary properties of $3$-uniform hypergraphs."}
{"main_page": "https://arxiv.org/abs/2404.01293", "pdf": "https://arxiv.org/pdf/2404.01293", "title": "Growth of regular partitions 2: Weak regularity", "authors": "C. Terry", "subjects": "Combinatorics (math.CO); Logic (math.LO)", "abstract": "This is Part 2 in a series of papers about the growth of regular partitions in hereditary properties $3$-uniform hypergraphs. The focus of this paper is the notion of weak hypergraph regularity, first developed by Chung, Chung-Graham, and Haviland-Thomason. Given a hereditary property of $3$-uniform hypergraphs $\\mathcal{H}$, we define a function $M_{\\mathcal{H}}:(0,1)\\rightarrow \\mathbb{N}$ by letting $M_{\\mathcal{H}}(\\epsilon)$ be the smallest integer $M$ such that all sufficiently large elements of $\\mathcal{H}$ admit weak regular partitions of size at most $M$. We show the asymptotic growth rate of such a function falls into one of four categories: constant, polynomial, between single and double exponentials, or tower. These results are a crucial component in Part 3 of the series, which considers vertex partitions associated to a stronger notion of hypergraph regularity."}
