{"main_page": "https://arxiv.org/abs/2404.00156", "pdf": "https://arxiv.org/pdf/2404.00156", "title": "Gluing formulae for heat kernels", "authors": "Pavel Mnev, Konstantin Wernli", "subjects": "Mathematical Physics (math-ph); Analysis of PDEs (math.AP); Differential Geometry (math.DG)", "abstract": "We state and prove two gluing formulae for the heat kernel of the Laplacian on a Riemannian manifold of the form $M_1 \\cup_\\gamma M_2$. We present several examples."}
{"main_page": "https://arxiv.org/abs/2404.00314", "pdf": "https://arxiv.org/pdf/2404.00314", "title": "Cell Escape Probabilities for Markov Processes on a Grid", "authors": "Toon Ingelaere, Vince Maes, Giovanni Samaey", "subjects": "Mathematical Physics (math-ph); Probability (math.PR)", "abstract": "Kinetic equations describe physical processes in a high-dimensional phase space and are often simulated using Markov process-based Monte Carlo routines. The quantities of interest are typically defined on the lower-dimensional position space and estimated on a grid (histogram). In several applications, such as the construction of diffusion Monte Carlo-like techniques and variance prediction for particle tracing Monte Carlo methods, the cell escape probabilities, i.e., the probabilities with which particles escape a grid cell during one step of the Markov process, are of interest. In this paper, we derive formulas to calculate the cell escape probabilities for common mesh elements in one, two, and three dimensions. Deterministic calculation of cell escape probabilities in higher dimensions becomes expensive and prone to quadrature errors due to the involved high-dimensional integrals. We therefore also introduce a stochastic Monte Carlo algorithm to calculate the escape probabilities, which is more robust at the cost of a statistical error. The code used to perform the numerical experiments and accompanying GeoGebra tutorials are openly available at https://gitlab.kuleuven.be/numa/public/escape-probabilities-markov-processes."}
{"main_page": "https://arxiv.org/abs/2404.00499", "pdf": "https://arxiv.org/pdf/2404.00499", "title": "On Faddeev's Equation", "authors": "Sergey Sergeev", "subjects": "Mathematical Physics (math-ph)", "abstract": "Faddeev' equations are a set-theoretical and an operator forms of the star-triangle equation. Known solutions of the quantum star-triangle equation, related to the Faddeev equations, are based on various forms of the modular double of the Weyl algebra including its cyclic representation. We show in this paper that Fadeev's equation also leads to a solution of the quantum star-triangle equation even in the case of a simple Weyl algebra with $|q|<1$. This paper can be seen as an addendum to the recent paper \"V. Bazhanov and S. Sergeev, A distant descendant of the six-vertex model, arXiv:2310.08427\"."}
{"main_page": "https://arxiv.org/abs/2404.00503", "pdf": "https://arxiv.org/pdf/2404.00503", "title": "Functional Bethe Ansatz for a $\\sinh$-Gordon model with real $q$", "authors": "Sergey Sergeev", "subjects": "Mathematical Physics (math-ph)", "abstract": "Recently, Bazhanov and Sergeev have described an Ising-type integrable model which can be identified as a $\\sinh$-Gordon-type model with an infinite number of states but with a real parameter $q$. This model is the subject of Sklyanin's Functional Bethe Ansatz. We develop in this paper the whole technique of the FBA which includes: 1. Construction of eigenstates of an off-diagonal element of a monodromy matrix. Most important ingredients of these eigenstates are the Clebsh-Gordan coefficients of the corresponding representation. 2. Separately, we discuss the Clebsh-Gordan coefficients, as well as the Wigner's 6j symbols, in details. The later are rather well known in the theory of $3D$ indices. Thus, the Sklyanin basis of the quantum separation of variables is constructed. The matrix elements of an eigenstate of the auxiliary transfer matrix in this basis are products of functions satisfying the Baxter equation. Such functions are called usually the $Q$-operators. We investigate the Baxter equation and $Q$-operators from two points of view. 3. In the model considered the most convenient Bethe-type variables are the zeros of a Wronskian of two well defined particular solutions of the Baxter equation. This approach works perfectly in the thermodynamic limit. We calculate the distribution of these roots in the thermodynamic limit, and so we reproduce in this way the partition function of the model. 4. The real parameter $q$, which is the standard quantum group parameter, plays the role of the absolute temperature in the model considered. Expansion with respect to $q$ (tropical expansion) gives an alternative way to establish the structure of the eigenstates. In this way we classify the elementary excitations over the ground state."}
{"main_page": "https://arxiv.org/abs/2404.00844", "pdf": "https://arxiv.org/pdf/2404.00844", "title": "Nonlinear ensemble filtering with diffusion models: Application to the  surface quasi-geostrophic dynamics", "authors": "Feng Bao, Hristo G. Chipilski, Siming Liang, Guannan Zhang, Jeffrey S.Whitaker", "subjects": "Mathematical Physics (math-ph)", "abstract": "The intersection between classical data assimilation methods and novel machine learning techniques has attracted significant interest in recent years. Here we explore another promising solution in which diffusion models are used to formulate a robust nonlinear ensemble filter for sequential data assimilation. Unlike standard machine learning methods, the proposed \\textit{Ensemble Score Filter (EnSF)} is completely training-free and can efficiently generate a set of analysis ensemble members. In this study, we apply the EnSF to a surface quasi-geostrophic model and compare its performance against the popular Local Ensemble Transform Kalman Filter (LETKF), which makes Gaussian assumptions on the posterior distribution. Numerical tests demonstrate that EnSF maintains stable performance in the absence of localization and for a variety of experimental settings. We find that EnSF achieves competitive performance relative to LETKF in the case of linear observations, but leads to significant advantages when the state is nonlinearly observed and the numerical model is subject to unexpected shocks. A spectral decomposition of the analysis results shows that the largest improvements over LETKF occur at large scales (small wavenumbers) where LETKF lacks sufficient ensemble spread. Overall, this initial application of EnSF to a geophysical model of intermediate complexity is very encouraging, and motivates further developments of the algorithm for more realistic problems."}
{"main_page": "https://arxiv.org/abs/2404.01038", "pdf": "https://arxiv.org/pdf/2404.01038", "title": "The split 5-Casimir operator and the structure of $\\wedge  \\mathfrak{ad}^{\\otimes 5}$", "authors": "Alexey P. Isaev, Sergey O. Krivonos", "subjects": "Mathematical Physics (math-ph)", "abstract": "In the present paper, using the split Casimir generators we have found the decomposition of the antisymmetric part of $\\mathfrak{ad}^{\\otimes 5}$. This decomposition contains the representations that appeared in the decomposition of $\\mathfrak{ad}^{\\otimes 4}$ and only one new representation $X_5$. The dimension of this representation has been proposed in [A.J.Macfarlane, H.Pfeiffer, J.Phys.A: Math. Gen. 36 (2003) 2305]. Our decomposition is valid for all Lie algebras."}
{"main_page": "https://arxiv.org/abs/2404.01108", "pdf": "https://arxiv.org/pdf/2404.01108", "title": "Norms of wave functions for FQHE models on a torus", "authors": "Igor Burban, Semyon Klevtsov", "subjects": "Mathematical Physics (math-ph); Algebraic Geometry (math.AG)", "abstract": "The goal of this paper is to give an explicit computation of the curvature of the magnetic vector bundle of the multi-layer model of the fractional quantum Hall effect on a torus. We also obtain concrete formulae for the norms of the corresponding wave functions arising in such models."}
