{"main_page": "https://arxiv.org/abs/2404.00249", "pdf": "https://arxiv.org/pdf/2404.00249", "title": "Functor String Diagrams: A Novel Approach to Flexible Diagrams for  Applied Category Theory", "authors": "Vincent Abbott, Gioele Zardini", "subjects": "Category Theory (math.CT)", "abstract": "The study of abstraction and composition - the focus of category theory - naturally leads to sophisticated diagrams which can encode complex algebraic semantics. Consequently, these diagrams facilitate a clearer visual comprehension of diverse theoretical and applied systems. Complex algebraic structures - otherwise represented by a forest of symbols - can be encoded into diagrams with intuitive graphical rules. The prevailing paradigm for diagrammatic category theory are monoidal string diagrams whose specification reflects the axioms of monoidal categories. However, such diagrams struggle in accurately portraying crucial categorical constructs such as functors or natural transformations, obscuring central concepts such as the Yoneda lemma or the simultaneous consideration of hom-functors and products. In this work, we introduce functor string diagrams, a systematic approach for the development of categorical diagrams which allows functors, natural transformations, and products to be clearly represented. We validate their practicality in multiple dimensions. We show their usefulness for theoretical manipulations by proving the Yoneda lemma, show that they encompass monoidal string diagrams and hence their helpful properties, and end by showing their exceptional applied utility by leveraging them to underpin neural circuit diagrams, a method which, at last, allows deep learning architectures to be comprehensively and rigorously expressed."}
{"main_page": "https://arxiv.org/abs/2404.00868", "pdf": "https://arxiv.org/pdf/2404.00868", "title": "On the Bénabou-Roubaud theorem", "authors": "Bruno Kahn", "subjects": "Category Theory (math.CT)", "abstract": "We give a detailed proof of the B\\'enabou-Roubaud theorem. As a byproduct it yields a weakening of its hypotheses: the base category does not need fibre products and the Beck-Chevalley condition, in the form of a natural transformation, can be weakened by only requiring the latter to be epi."}
{"main_page": "https://arxiv.org/abs/2404.00900", "pdf": "https://arxiv.org/pdf/2404.00900", "title": "Abstract Kleisli structures on 2-categories", "authors": "Adrian Miranda", "subjects": "Category Theory (math.CT)", "abstract": "F\\\"uhrmann introduced Abstract Kleisli structures to model call-by-value programming languages with side effects, and showed that they correspond to monads satisfying a certain equalising condition on the unit. We first extend this theory to non-strict morphisms of monads, and to incorporate $2$-cells of monads. We then further extend this to a theory of abstract Kleisli structures on $2$-categories, characterising when the original pseudomonad can be recovered by the abstract Kleisli structure on its $2$-category of free-pseudoalgebras."}
{"main_page": "https://arxiv.org/abs/2404.01025", "pdf": "https://arxiv.org/pdf/2404.01025", "title": "The Grothendieck Construction for $\\infty$-Categories Fibered over  Categorical Patterns", "authors": "Kensuke Arakawa", "subjects": "Category Theory (math.CT); Algebraic Topology (math.AT)", "abstract": "We show how to treat families of $\\infty$-categories fibered in categorical patterns (e.g., $\\infty$-operads and monoidal $\\infty$-categories) in terms of fibrations by relativizing the Grothendieck construction. As applications, we construct an analog of the universal cocartesian fibration and explain how to compute limits and colimits of $\\infty$-categories fibered in categorical patterns."}
{"main_page": "https://arxiv.org/abs/2404.01031", "pdf": "https://arxiv.org/pdf/2404.01031", "title": "An $\\mathcal{O}$-monoidal Grothendieck construction", "authors": "Redi Haderi, Walker H. Stern", "subjects": "Category Theory (math.CT)", "abstract": "Given an operad $\\mathcal{O}$, we define a notion of weak $\\mathcal{O}$-monoids -- which we term $\\mathcal{O}$-pseudomonoids -- in a 2-category. In the special case with the 2-category in question is the 2-category $\\mathsf{Cat}$ of categories, this yields a notion of $\\mathcal{O}$-monoidal category, which in the case of the associative and commutative operads retrieves unbiased notions of monoidal and symmetric monoidal categories, respectively. We carefully unpack the definition of $\\mathcal{O}$-monoids in the 2-categories of discrete fibrations and of category-indexed sets. Using the classical Grothendieck construction, we thereby obtain an $\\mathcal{O}$-monoidal Grothendieck construction relating lax $\\mathcal{O}$-monoidal functors into Set to strict $\\mathcal{O}$-monoidal functors which are also discrete fibrations."}
{"main_page": "https://arxiv.org/abs/2404.01281", "pdf": "https://arxiv.org/pdf/2404.01281", "title": "The pullback theorem for relative monads", "authors": "Nathanael Arkor, Dylan McDermott", "subjects": "Category Theory (math.CT)", "abstract": "A fundamental result in the theory of monads is the characterisation of the category of algebras for a monad in terms of a pullback of the category of presheaves on the category of free algebras: intuitively, this expresses that every algebra is a colimit of free algebras. We establish an analogous result for enriched relative monads with dense roots, and explain how it generalises the nerve theorems for monads with arities and nervous monads. As an application, we derive sufficient conditions for the existence of algebraic colimits of relative monads. More generally, we show that the pullback theorem for relative monads holds in any exact virtual equipment. In doing so, we are led to study the relationship between a $j$-relative monad $T$ and its associated loose-monad $E(j, T)$, and consequently show that the opalgebra object and the algebra object for $T$ may be constructed from certain double categorical limits and colimits associated to $E(j, T)$."}
