{"main_page": "https://arxiv.org/abs/2404.00468", "pdf": "https://arxiv.org/pdf/2404.00468", "title": "On P=NP Either False or Independent of ZFC", "authors": "S Gill Williamson", "subjects": "Logic (math.LO); Combinatorics (math.CO)", "abstract": "Our main result, Theorem 3.3, uses Friedman's Jump Free Theorem, Theorem 2.7, which he has shown to be independent of ZFC, the usual axioms of set theory. We conjecture that Theorem 3.3, a straight forward translation of the statement of Theorem 2.7 into sets and functions, is also independent of ZFC as is its immediate Corollary 3.4. It is easy to show that a proof that P=NP will also prove Corollary 3.4. If Corollary 3.4 is in fact independent of ZFC then a ZFC proof of P=NP is impossible, perhaps because it is false."}
{"main_page": "https://arxiv.org/abs/2404.00853", "pdf": "https://arxiv.org/pdf/2404.00853", "title": "$G$-invariant definable Tietze extension theorem", "authors": "Masato Fujita, Tomohiro Kawakami", "subjects": "Logic (math.LO)", "abstract": "A $G$-invariant version of definable Tietze extension theorem for definably complete structures is proved when a definably compact definable topological group $G$ acts definably and continuously on the definable set."}
{"main_page": "https://arxiv.org/abs/2404.01011", "pdf": "https://arxiv.org/pdf/2404.01011", "title": "Primitive Recursive Dependent Type Theory", "authors": "Ulrik Buchholtz, Johannes Schipp von Branitz", "subjects": "Logic (math.LO); Logic in Computer Science (cs.LO)", "abstract": "We show that restricting the elimination principle of the natural numbers type in Martin-L\\\"of Type Theory (MLTT) to a universe of types not containing $\\Pi$-types ensures that all definable functions are primitive recursive. This extends the concept of primitive recursiveness to general types. We discuss extensions to univalent type theories and other notions of computability. We are inspired by earlier work by Martin Hofmann, work on Joyal's arithmetic universes, and Hugo Herbelin and Ludovic Patey's sketched Calculus of Primitive Recursive Constructions. We define a theory Tpr that is a subtheory of MLTT with two universes, such that all inductive types are finitary and the lowest universe is restricted to not contain $\\Pi$-types. We prove soundness such that all functions $\\mathbb{N}\\to\\mathbb{N}$ are primitive recursive. The proof requires that Tpr satisfies canonicity, which we easily prove using synthetic Tait computability."}
{"main_page": "https://arxiv.org/abs/2404.01026", "pdf": "https://arxiv.org/pdf/2404.01026", "title": "Modelling Multiplicative Linear Logic via Deep Inference", "authors": "Tomer Galor, Andrea Schalk", "subjects": "Logic (math.LO)", "abstract": "Multiplicative linear logic is a very well studied formal system, and most such studies are concerned with the one-sided sequent calculus. In this paper we look in detail at existing translations between a deep inference system and the standard sequent calculus one, provide a simplified translation, and provide a formal proof that a standard approach to modelling is indeed invariant to all these translations. En route we establish a necessary condition for provable sequents related to the number of pars and tensors in a formula that seems to be missing from the literature."}
{"main_page": "https://arxiv.org/abs/2404.01256", "pdf": "https://arxiv.org/pdf/2404.01256", "title": "The Countable Reals", "authors": "Andrej Bauer, James E. Hanson", "subjects": "Logic (math.LO)", "abstract": "We construct a topos in which the Dedekind reals are countable. To accomplish this, we first define a new kind of toposes that we call parameterized realizability toposes. They are built from partial combinatory algebras whose application operation depends on a parameter, and in which realizers operate uniformly with respect to a given parameter set. Our topos is the parameterized realizability topos whose realizers are oracle-computable partial maps, with oracles serving as parameters and ranging over the representations of a non-diagonalizable sequence, discovered by Joseph Miller. It is a sequence of reals in $[0,1]$ that is non-diagonalizable in the sense that any real in $[0,1]$ that is oracle-computable, uniformly in oracles representing the sequence, must already appear in the sequence. The Dedekind reals are countable in the topos because the non-diagonalizable sequence appears in it as an epimorphism. The topos is intuitionistic, as it invalidates both the law of excluded middle and the axiom of countable choice. The Cauchy reals are uncountable. The Hilbert cube is countable, from which Brouwer's fixed-point theorem follows as an easy corollary of Lawvere's fixed-point theorem. From the 1-dimensional Brouwer's fixed-point theorem we obtain the intermediate value theorem and the lesser limited principle of omniscience. The Kreisel-Lacombe-Shoenfield-Tseitin theorem stating that all real-valued maps are continuous is valid, because the usual proof is uniform with respect to oracles. Lastly, the closed interval $[0,1]$, being countable, can trivially be covered by a sequence of open intervals whose lengths add up to any prescribed $0 < \\epsilon < 1$, and such a cover has no finite subcover. However, we show that any sequence of open intervals with rational endpoints covering $[0,1]$ must has a finite subcover."}
