{"main_page": "https://arxiv.org/abs/2404.00736", "pdf": "https://arxiv.org/pdf/2404.00736", "title": "Embeddings into de Branges-Rovnyak spaces", "authors": "Bartosz Malman, Daniel Seco", "subjects": "Complex Variables (math.CV)", "abstract": "We study conditions for containment of a given space $X$ of analytic functions on the unit disk $\\mathbb{D}$ in the de Branges-Rovnyak space $\\mathcal{H}(b)$. We deal with the non-extreme case in which $b$ admits a Pythagorean mate $a$, and derive a multiplier boundedness criterion on the function $\\phi = b/a$ which implies the containment $X \\subset \\mathcal{H}(b)$. With our criterion, we are able to characterize the containment of the Hardy space $\\mathcal{H}^p$ inside $\\mathcal{H}(b)$, for $p \\in [2, \\infty]$. The end-point cases have previously been considered by Sarason, and we show that in his result, stating that $\\phi \\in \\mathcal{H}^2$ is equivalent to $\\mathcal{H}^\\infty \\subset \\mathcal{H}(b)$, one can in fact replace $\\mathcal{H}^\\infty$ by BMOA. We establish various other containment results, and study in particular the case of the Dirichlet space $\\mathcal{D}$, containment of which is characterized by a Carleson measure condition. In this context, we show that matters are not as simple as in the case of the Hardy spaces, and we carefully work out an example."}
{"main_page": "https://arxiv.org/abs/2404.01126", "pdf": "https://arxiv.org/pdf/2404.01126", "title": "Hermitian null loci", "authors": "Quang-Tuan Dang", "subjects": "Complex Variables (math.CV); Differential Geometry (math.DG)", "abstract": "We establish a transcendental generalization of Nakamaye's theorem to compact complex manifolds when the form is not assumed to be closed. We apply the recent analytic technique developed by Collins--Tosatti to show that the non-Hermitian locus of a nef and big $(1,1)$-form, which is not necessarily closed, on a compact complex manifold equals the union of all positive-dimensional analytic subvarieties where the restriction of the form is not big (null locus). As an application, we can give an alternative proof of the Nakai--Moishezon criterion of Buchdahl and Lamari for complex surfaces and generalize this result in higher dimensions. This is also used for studying degenerate complex Monge--Amp\\`ere equations on compact Hermitian manifolds. Finally, we investigate finite time non-collapsing singularities of the Chern--Ricci flow, partially answering a question raised by Tosatti and Weinkove."}
{"main_page": "https://arxiv.org/abs/2404.01152", "pdf": "https://arxiv.org/pdf/2404.01152", "title": "Applications of the Stone-Weierstrass theorem in the Calderón problem", "authors": "Tony Liimatainen, Mikko Salo", "subjects": "Complex Variables (math.CV); Analysis of PDEs (math.AP); Differential Geometry (math.DG)", "abstract": "We give examples on the use of the Stone-Weierstrass theorem in inverse problems. We show uniqueness in the linearized Calder\\'on problem on holomorphically separable K\\\"ahler manifolds, and in the Calder\\'on problem for nonlinear equations on conformally transversally anisotropic manifolds. We also study the holomorphic separability condition in terms of plurisubharmonic functions. The Stone-Weierstrass theorem allows us to generalize and simplify earlier results. It also makes it possible to circumvent the use of complex geometrical optics solutions and inversion of explicit transforms in certain cases."}
