{"main_page": "https://arxiv.org/abs/2404.00035", "pdf": "https://arxiv.org/pdf/2404.00035", "title": "Fractional Calculus Operator Emerging from the 2D Biorthogonal Hermite  Konhauser Polynomials", "authors": "Mehmet Ali Ozarslan, İlkay Onbasi Elidemir", "subjects": "General Mathematics (math.GM)", "abstract": "In the present paper, we introduce a method to construct two variable biorthogonal polynomial families with the help of one variable biorthogonal and orthogonal polynomial families. By using this new technique, we define 2D Hermite Konhauser polynomials and we investigate several properties of them such as biorthogonality property, operational formula and integral representation. We further inverstigate their images under the Laplace transformations, fractional integral and derivative operators. Corresponding to these polynomials, we define the new type bivariate Hermite Konhauser Mittag Leffler function and obtain the similar properties for them. In order to establish new fractional calculus, we add two new parameters and consider 2D Hermite Konhauser polynomials and bivariate Hermite Konhauser Mittag Leffler function. We introduce an integral operator containing the modified bivariate Hermite Konhauser Mittag Leffler function in the kernel. We show that it satisify the semigroup property and obtain its left inverse operator, which corresponds to its fractional derivative operator."}
{"main_page": "https://arxiv.org/abs/2404.00332", "pdf": "https://arxiv.org/pdf/2404.00332", "title": "Polynomial Quotient Rings and Kronecker Substitution for Deriving  Combinatorial Identities", "authors": "Joseph M. Shunia", "subjects": "General Mathematics (math.GM)", "abstract": "We establish a new connection between combinatorial number theory and polynomial ring theory by applying Kronecker substitution and related polynomial encoding techniques to polynomial expansions within quotient rings. We prove a new theorem which provides a general framework for generating combinatorial identities using polynomial quotient rings in conjunction with Kronecker substitution. We demonstrate the theorem's utility by deriving explicit formulas for famous integer sequences, such as the Fibonacci sequence, Pell sequence, and the central binomial coefficients. To give an example, we present a formula for the $n$-th Fibonacci number, valid for $n > 1$, given by: $F_n = (2^{n (n - 1)} \\bmod{(4^n-2^n-1)}) \\bmod{(2^n-1)}$. Additionally, we find a new formula for square roots using our approach. This work builds upon our previous results on binomial and multinomial coefficients, extending the application of Kronecker substitution beyond its traditional use in improving the efficiency of integer and polynomial multiplication algorithms."}
{"main_page": "https://arxiv.org/abs/2404.00428", "pdf": "https://arxiv.org/pdf/2404.00428", "title": "Second $α$-Order Fractal Differential Equations", "authors": "Alireza Khalili Golmankhaneh, Donatella Bongiorno", "subjects": "General Mathematics (math.GM)", "abstract": "In this research paper, we provide a concise overview of fractal calculus applied to fractal sets. We introduce and solve a second $\\alpha$-order fractal differential equation with constant coefficients across different scenarios. We propose a uniqueness theorem for second $\\alpha$-order fractal linear differential equations. We define the solution space as a vector space with non-integer orders. We establish precise conditions for second $\\alpha$-order fractal linear differential equations and derive the corresponding fractal adjoint differential equation."}
{"main_page": "https://arxiv.org/abs/2404.00445", "pdf": "https://arxiv.org/pdf/2404.00445", "title": "On Homogeneous System of Fractal Differential Equations", "authors": "Alireza Khalili Golmankhaneh, Donatella Bongiorno", "subjects": "General Mathematics (math.GM)", "abstract": "In this paper, a homogeneous system of n $\\alpha$-order linear fractal differential equation is defined and the set of its fundamental solutions through the corresponding Wronskian matrix is described. Finally, the solutions of some assigned autonomous homogeneous system are plotted to show the details previously proved."}
{"main_page": "https://arxiv.org/abs/2404.00452", "pdf": "https://arxiv.org/pdf/2404.00452", "title": "Higher Order Fractal Differential Equations", "authors": "Alireza Khalili Golmankhaneh, Claude Depollier, Diana Pham", "subjects": "General Mathematics (math.GM)", "abstract": "This paper provides a summary of the fractal calculus framework. It presents higher-order homogeneous and nonhomogeneous linear fractal differential equations with $\\alpha$-order. Solutions for these equations with constant coefficients are obtained through the method of variation of parameters and the method of undetermined coefficients. The solution space for higher $\\alpha$-order linear fractal differential equations is defined, showcasing its non-integer dimensionality. The solutions to $\\alpha$-order linear fractal differential equations are graphically depicted to illustrate their non-differentiability. Additionally, equations of motion governing the behavior of two masses in fractal time are proposed and solved."}
{"main_page": "https://arxiv.org/abs/2404.00583", "pdf": "https://arxiv.org/pdf/2404.00583", "title": "If our chaotic operator is derived correctly, then the Riemann  hypothesis holds true", "authors": "Zeraoulia Rafik", "subjects": "General Mathematics (math.GM); Chaotic Dynamics (nlin.CD)", "abstract": "In this paper, we explore novel chaotic dynamics derived from the Riemann and von Mangoldt function formula regarding the distribution of nontrivial zeros of the Riemann zeta function. By computing Lyapunov exponents, we demonstrate that the derived dynamics exhibit chaotic behavior when the gaps between zeros are within a certain bound, specifically up to 2.4. Beyond this threshold, the dynamics do not display chaotic behavior. Furthermore, we derive a chaotic operator for the Riemann zeta function within the critical strip, utilizing the correction term from the Riemann-von Mangoldt formula. We establish the chaotic nature and Hermiticity of this operator, and discuss its diagonalization properties. Moreover, our study reveals a remarkable compatibility between our derived chaotic operator and the quantum hydrogen model, as evidenced by the analysis of its eigenvalues resembling the energy levels of hydrogen. Numerical evidence, including Lyapunov exponents, bifurcation analysis, and entropy computation, underscores the unpredictability of the system. Additionally, we establish a connection between our chaotic operator and the prime number theorem regarding the density of primes. Furthermore, our investigation suggests that this chaotic operator strongly supports the validity of the Riemann hypothesis, as proposed by Hilbert and Polya. These findings shed light on the intricate relationship between chaotic dynamics, number theory, and quantum mechanics, offering new perspectives on the behavior of the Riemann zeta function and its zeros. Finally, we demonstrate the Hermiticity and diagonalization properties of our operator using the spectral theorem, further elucidating its mathematical properties and unboundedness."}
