{"main_page": "https://arxiv.org/abs/2404.00174", "pdf": "https://arxiv.org/pdf/2404.00174", "title": "On the weak-fragmentability index of some Lipschitz-free spaces", "authors": "Estelle Basset", "subjects": "Functional Analysis (math.FA)", "abstract": "We show the existence of Lipschitz-free spaces verifying the Point of Continuity Property with arbitrarily high weak-fragmentability index. For this purpose, we use a generalized construction of the countably branching diamond graphs. As a consequence, we deduce that to be Lipschitz-universal for countable complete metric spaces, a separable complete metric space cannot be purely 1-unrectifiable. Another corollary is the existence of an uncountable family of pairwise non-isomorphic Lipschitz-free spaces over purely 1-unrectifiable metric spaces. Some results on compact reduction are also obtained."}
{"main_page": "https://arxiv.org/abs/2404.00296", "pdf": "https://arxiv.org/pdf/2404.00296", "title": "Arens regularity and irregularity of ideals in Fourier and group  algebras", "authors": "Reza Esmailvandi, Mahmoud Filali, Jorge Galindo", "subjects": "Functional Analysis (math.FA)", "abstract": "Let $\\mathcal{A}$ be a weakly sequentially complete Banach algebra containing a bounded approximate identity that is an ideal in its second dual $\\mathcal{A}^{\\ast\\ast}$, we call such an algebra a Wesebai algebra. In the present paper we examine the Arens regularity properties of closed ideals of algebras in the Wesebai class. We observe that, although Wesebai algebras are always strongly Arens irregular, a variety of Arens regularity properties can be observed within their closed ideals. After characterizing Arens regular ideals and strongly Arens irregular ideals, we proceed to particularize to the main examples of Wesebai algebras, the convolution group algebras $L^1(G)$, $G$ compact, and the Fourier algebras $A(\\Gamma)$, $\\Gamma$ discrete and amenable. We find examples of Arens regular ideals in $L^1(G)$ and $A(\\Gamma)$, both reflexive and nonreflexive and examples of strongly Arens irregular ideals that are not in the Wesebai class. In finding these examples, we prove that every infinite Abelian group contains a Rosenthal set that is not $\\Lambda(p)$, for any $p>0$, a result that could be of independent interest."}
{"main_page": "https://arxiv.org/abs/2404.00310", "pdf": "https://arxiv.org/pdf/2404.00310", "title": "On adjoint invariant classes of shift operators", "authors": "F. Ayatollah Zadeh Shirazi, E. Hakimi, A. Hosseini, R. Rezavand", "subjects": "Functional Analysis (math.FA)", "abstract": "In the following text we compute the adjoint of weighted generalized shift operators over Hilbert spaces. We show for a conjugate invariant subset $A$ of $\\mathbb C$, the additive semigroup generated by $A\\cup\\{0\\}-$weighted generalized shifts over Hilbert space $\\mathcal H$ is adjoint invariant if and only if $\\mathcal H$ is a finite dimensional Hilbert space or $0$ is not a limit point of $A$."}
{"main_page": "https://arxiv.org/abs/2404.00523", "pdf": "https://arxiv.org/pdf/2404.00523", "title": "The algebra of hyperinterpolation-class on the sphere", "authors": "Congpei An, Jiashu Ran", "subjects": "Functional Analysis (math.FA); Numerical Analysis (math.NA)", "abstract": "This paper considers the so-called concept of hyperinterpolation-class, i.e., the set of all operators derived from the hyperinterpolation operator on the unit sphere. Concretely, we select four different elements in the hyperinterpolation-class, namely filtered hyperinterpolation, Lasso hyperinterpolation, hard thresholding hyperinterpolation and generalized hyperinterpolation introduced by Dai [10], to explore their algebraic properties on the sphere. Based on the idea of a discrete (semi) inner product, we propose the concepts of hyper self-adjoint operator, hyper projection operator and hyper algebra. Next, we prove generalized hyperinterpolation is hyper self-adjoint and commutative with hyperinterpolation. Then we establish corresponding results of the product, sum and difference of hyper projection operators. Last but not least, we present the results of ideals between hard thresholding hyperinterpolation and hyperinterpolation. We also give a preliminary result of involutions, and also introduce the concepts of hyper $C^{\\ast}$-algebra and hyper homomorphism."}
{"main_page": "https://arxiv.org/abs/2404.00550", "pdf": "https://arxiv.org/pdf/2404.00550", "title": "Uniformly nonsquare Banach spaces have the Fixed Point Property 2", "authors": "Tim Dalby", "subjects": "Functional Analysis (math.FA)", "abstract": "Another proof that uniformly nonsquare Banach spaces have the fixed point property is presented."}
{"main_page": "https://arxiv.org/abs/2404.00574", "pdf": "https://arxiv.org/pdf/2404.00574", "title": "Hankel Operators Defined Between Köthe Spaces", "authors": "Nazlı Doğan", "subjects": "Functional Analysis (math.FA)", "abstract": "This paper is about the operators defined between K\\\"othe spaces whose associated matrix is a Hankel matrix. After demonstrating how these operators are defined, the conditions for continuity and compactness of these operators are constructed."}
{"main_page": "https://arxiv.org/abs/2404.00585", "pdf": "https://arxiv.org/pdf/2404.00585", "title": "Openness of the frame set on the hyperbolas", "authors": "Aleksei Kulikov", "subjects": "Functional Analysis (math.FA)", "abstract": "We prove that for the functions of the form $g(x) = h(x) + \\frac{C}{x+i}$, where $h$ belongs to the continuous Wiener algebra $W_0$, the intersection of the frame set $\\mathcal{F}_g$ with every hyperbola $\\{\\alpha, \\beta > 0 \\mid \\alpha\\beta = c\\}$ is open in the relative topology. In particular, this applies to all rational functions $g$."}
{"main_page": "https://arxiv.org/abs/2404.00707", "pdf": "https://arxiv.org/pdf/2404.00707", "title": "On the properties of rearrangement-invariant quasi-Banach function  spaces", "authors": "Anna Musilová, Aleš Nekvinda, Dalimil Peša, Hana Turčinová", "subjects": "Functional Analysis (math.FA)", "abstract": "This paper explores some important aspects of the theory of rearrangement-invariant quasi-Banach function spaces. We focus on two main topics. Firstly, we prove an analogue of the Luxemburg representation theorem for rearrangement-invariant quasi-Banach function spaces over resonant measure spaces. Secondly, we develop the theory of fundamental functions and endpoint spaces."}
{"main_page": "https://arxiv.org/abs/2404.00910", "pdf": "https://arxiv.org/pdf/2404.00910", "title": "Unexpected Uncertainty Principle for Disc Banach Spaces", "authors": "K. Mahesh Krishna", "subjects": "Functional Analysis (math.FA); Information Theory (cs.IT); Mathematical Physics (math-ph)", "abstract": "Let $(\\{f_n\\}_{n=1}^\\infty, \\{\\tau_n\\}_{n=1}^\\infty)$ and $(\\{g_n\\}_{n=1}^\\infty, \\{\\omega_n\\}_{n=1}^\\infty)$ be unbounded continuous p-Schauder frames ($0<p<1$) for a disc Banach space $\\mathcal{X}$. Then for every $x \\in ( \\mathcal{D}(\\theta_f) \\cap\\mathcal{D}(\\theta_g))\\setminus\\{0\\}$, we show that \\begin{align}\\label{UB} (1) \\quad \\quad \\quad \\quad \\|\\theta_f x\\|_0\\|\\theta_g x\\|_0 \\geq \\frac{1}{\\left(\\displaystyle\\sup_{n,m \\in \\mathbb{N} }|f_n(\\omega_m)|\\right)^p\\left(\\displaystyle\\sup_{n, m \\in \\mathbb{N}}|g_m(\\tau_n)|\\right)^p}, \\end{align} where \\begin{align*} & \\theta_f: \\mathcal{D}(\\theta_f) \\ni x \\mapsto \\theta_fx := \\{f_n(x)\\}_{n=1}^\\infty\\in \\ell^p(\\mathbb{N}), \\quad \\theta_g: \\mathcal{D}(\\theta_g) \\ni x \\mapsto \\theta_gx := \\{g_n(x)\\}_{n=1}^\\infty\\in \\ell^p(\\mathbb{N}). \\end{align*} Inequality (1) is unexpectedly different from both bounded uncertainty principle \\textit{[arXiv:2308.00312v1]} and unbounded uncertainty principle \\textit{[arXiv:2312.00366v1]} for Banach spaces."}
{"main_page": "https://arxiv.org/abs/2404.01227", "pdf": "https://arxiv.org/pdf/2404.01227", "title": "Method of similar operators in harmonious Banach spaces", "authors": "Anatoly G. Baskakov, Ilya A. Krishtal, Natalia B. Uskova", "subjects": "Functional Analysis (math.FA); Spectral Theory (math.SP)", "abstract": "We consider similarity transformations of a perturbed linear operator $A-B$ in a complex Banach space $\\mathcal{X}$, where the unperturbed operator $A$ is a generator of a Banach $L_1(\\mathbb{R})$-module and the perturbation operator $B$ is a bounded linear operator. The result of the transformation is a simpler operator $A-B_0$. For example, if $A$ is a differentiation operator and $B$ is an operator of multiplication by an operator-valued function, then $B_0$ is an operator of multiplication by a function that is a restriction of an entire function of exponential type and could be $0$ in some cases. As a consequence, we derive the spectral invariance of the operator $A-B$ in a large class of spaces. The study is based on a widely applicable modification of the method of similar operators that is also presented in the paper. This non-traditional modification is rooted in the spectral theory of Banach $L_1(\\mathbb{R})$-modules."}
{"main_page": "https://arxiv.org/abs/2404.01275", "pdf": "https://arxiv.org/pdf/2404.01275", "title": "Limit-case admissibility for positive infinite-dimensional systems", "authors": "Sahiba Arora, Jochen Glück, Lassi Paunonen, Felix L. Schwenninger", "subjects": "Functional Analysis (math.FA)", "abstract": "In the context of positive infinite-dimensional linear systems, we systematically study $L^p$-admissible control and observation operators with respect to the limit-cases $p=\\infty$ and $p=1$, respectively. This requires an in-depth understanding of the order structure on the extrapolation space $X_{-1}$, which we provide. These properties of $X_{-1}$ also enable us to discuss when zero-class admissibility is automatic. While those limit-cases are the weakest form of admissibility on the $L^p$-scale, it is remarkable that they sometimes follow from order theoretic and geometric assumptions. Our assumptions on the geometries of the involved spaces are minimal."}
