{"main_page": "https://arxiv.org/abs/2404.00641", "pdf": "https://arxiv.org/pdf/2404.00641", "title": "Polynomial Bogolyubov for special linear groups via tensor rank", "authors": "Shai Evra, Guy Kindler, Noam Lifshitz", "subjects": "Combinatorics (math.CO); Group Theory (math.GR); Representation Theory (math.RT); Spectral Theory (math.SP)", "abstract": "We prove a polynomial Bogolyubov type lemma for the special linear group over finite fields. Specifically, we show that there exists an absolute constant $C>0,$ such that if $A$ is a density $\\alpha$ subset of the special linear group, then the set $AA^{-1}AA^{-1}$ contains a subgroup $H$ of density $\\alpha^C$. Moreover, this subgroup is isomorphic to a special linear group of a smaller rank. We also show that if $A$ is an approximate subgroups then it can be covered by the union of few cosets of $H$. Our proof makes use of the Gurevich--Howe notion of tensor rank, and of a strengthened Bonami type Lemma for global functions on the bilinear scheme. We also present applications to spectral bounds for global convolution operators, global product free sets, and covering numbers corresponding to global sets."}
{"main_page": "https://arxiv.org/abs/2404.01227", "pdf": "https://arxiv.org/pdf/2404.01227", "title": "Method of similar operators in harmonious Banach spaces", "authors": "Anatoly G. Baskakov, Ilya A. Krishtal, Natalia B. Uskova", "subjects": "Functional Analysis (math.FA); Spectral Theory (math.SP)", "abstract": "We consider similarity transformations of a perturbed linear operator $A-B$ in a complex Banach space $\\mathcal{X}$, where the unperturbed operator $A$ is a generator of a Banach $L_1(\\mathbb{R})$-module and the perturbation operator $B$ is a bounded linear operator. The result of the transformation is a simpler operator $A-B_0$. For example, if $A$ is a differentiation operator and $B$ is an operator of multiplication by an operator-valued function, then $B_0$ is an operator of multiplication by a function that is a restriction of an entire function of exponential type and could be $0$ in some cases. As a consequence, we derive the spectral invariance of the operator $A-B$ in a large class of spaces. The study is based on a widely applicable modification of the method of similar operators that is also presented in the paper. This non-traditional modification is rooted in the spectral theory of Banach $L_1(\\mathbb{R})$-modules."}
