{"main_page": "https://arxiv.org/abs/2404.00233", "pdf": "https://arxiv.org/pdf/2404.00233", "title": "On a stability of higher level Coxeter unipotent representations", "authors": "Zhe Chen", "subjects": "Representation Theory (math.RT)", "abstract": "Let $\\mathbb{G}$ be a connected reductive group over $\\mathcal{O}$, a complete discrete valuation ring with finite residue field $\\mathbb{F}_q$. Let $R_{T_r,U_r}^{\\theta}$ be a level $r$ Deligne--Lusztig representation of $\\mathbb{G}(\\mathcal{O})$. We show that, if $q$ is not small, the Coxeter unipotent $R_{T_r,U_r}^1$ degenerates to the $r=1$ case. For $\\mathbb{G}=\\mathrm{GL}_2$ (or $\\mathrm{SL}_2$), as an application we give the dimensions and decompositions of all Coxeter $R_{T_r,U_r}^{\\theta}$. For general $\\mathbb{G}$ we state a conjectural sign formula for $R_{T_r,U_r}^{\\theta}$."}
{"main_page": "https://arxiv.org/abs/2404.00266", "pdf": "https://arxiv.org/pdf/2404.00266", "title": "On tensor products of representations of Lie superalgebras", "authors": "Abhishek Das, Santosha Pattanayak", "subjects": "Representation Theory (math.RT)", "abstract": "We consider typical finite dimensional complex irreducible representations of a basic classical simple Lie superalgebra, and give a sufficient condition on when unique factorization of finite tensor products of such representations hold. We also prove unique factorization of tensor products of singly atypical finite dimensional irreducible modules for $\\mathfrak{sl}(m+1,n+1)$, $\\mathfrak{osp}(2,2n)$, $G(3)$ and $F(4)$ under an additional assumption. This result is a Lie superalgebra analogue of Rajan's fundamental result \\cite{MR2123935} on unique factorization of tensor products for finite dimensional complex simple Lie algebras."}
{"main_page": "https://arxiv.org/abs/2404.00515", "pdf": "https://arxiv.org/pdf/2404.00515", "title": "Polar Brauer categories, infinitesimal braids and Lie superalgebra  representations", "authors": "Gustav Lehrer, Ruibin Zhang", "subjects": "Representation Theory (math.RT)", "abstract": "We define a class of monoidal categories whose morphisms are diagrams, and which are enhancements and generalisations of the Brauer category obtained by adjoining infinitesimal braids, \"coupons\" and poles. Properties of these categories are explored, particularly diagrammatic equations. We construct functors from certain of them to categories of representations of Lie algebras and superalgebras. Applications include a diagrammatic construction of the centre of the universal enveloping superalgebra and certain \"characteristic identities\", as well as an analysis of certain tensor representations. We show how classical diagram categories arising in invariant theory are special cases of our constructions, placing them in a single unified framework."}
{"main_page": "https://arxiv.org/abs/2404.00663", "pdf": "https://arxiv.org/pdf/2404.00663", "title": "Geometrizations of quantum groups and dual semicanonical bases", "authors": "Yingjin Bi", "subjects": "Representation Theory (math.RT); Algebraic Geometry (math.AG); Quantum Algebra (math.QA); Rings and Algebras (math.RA)", "abstract": "In this paper, we give a geometrization of semicanonical bases of quantum groups via Grothendieck groups of the derived categories of Lusztig's nilpotent varieties. Meanwhile, we describe the dual semicanonical bases in terms of Serre polynomials of Grassmannians of modules over preprojective algebras."}
{"main_page": "https://arxiv.org/abs/2404.00759", "pdf": "https://arxiv.org/pdf/2404.00759", "title": "Some geometric consequences of the symmetric reduction", "authors": "Taiwang Deng", "subjects": "Representation Theory (math.RT); Algebraic Geometry (math.AG); Combinatorics (math.CO)", "abstract": "In this article, we derived some consequences to the symmetrization process developed in \\cite{Deng23}. This consists a geometric derivation of part of the properties which uniquely determines the Kazhdan-Lusztig polynomials of type $A_n$ as well as an interpretations of the last property by the decomposition theorem of \\cite{BBD}. Finally, the relation of geometry of graded nilpotent classes to Parabolic Kazhdan-Lusztig polynomials is discussed for the purpose of later applications to Zelevinsky's derivatives."}
{"main_page": "https://arxiv.org/abs/2404.00760", "pdf": "https://arxiv.org/pdf/2404.00760", "title": "Modularity for $\\mathcal{W}$-algebras and affine Springer fibres", "authors": "Peng Shan, Dan Xie, Wenbin Yan", "subjects": "Representation Theory (math.RT); Mathematical Physics (math-ph); Quantum Algebra (math.QA)", "abstract": "We construct a bijection between admissible representations for an affine Lie algebra $\\mathfrak{g}$ at boundary admissible levels and $\\mathbb{C}^\\times$ fixed points in homogeneous elliptic affine Springer fibres for the Langlands dual affine Lie algebra $\\mathfrak{g}^\\vee$. Using this bijection, we relate the modularity of the characters of admissible representations to Cherednik's Verlinde algebra construction coming from double affine Hecke algebras. Finally, we show that the expected behaviors of simple modules under quantized Drinfeld-Sokolov reductions are compatible with the reductions from affine Springer fibres to affine Spaltenstein varieties. This yields (modulo some conjectures) a similar bijection for irreducible representations of $\\mathcal{W}$-algebras, as well as an interpretation for their modularity properties."}
{"main_page": "https://arxiv.org/abs/2404.01162", "pdf": "https://arxiv.org/pdf/2404.01162", "title": "The 2-character theory for finite 2-groups", "authors": "Mo Huang, Hao Xu, Zhi-Hao Zhang", "subjects": "Representation Theory (math.RT); Category Theory (math.CT); Quantum Algebra (math.QA)", "abstract": "In this work, we generalize the notion of character for 2-representations of finite 2-groups. The properties of 2-characters bear strong similarities to those classical characters of finite groups, including conjugation invariance, additivity, multiplicativity and orthogonality. With a careful analysis using homotopy fixed points and quotients for categories with 2-group actions, we prove that the category of class functors on a 2-group $\\mathcal G$ is equivalent to the Drinfeld center of the 2-group algebra $\\mathrm{Vec}_{\\mathcal G}$, which categorifies the Fourier transform on finite abelian groups. After transferring the canonical nondegenerate braided monoidal structure from $\\mathfrak Z_1(\\mathrm{Vec}_{\\mathcal G})$, we discover that irreducible 2-characters of $\\mathcal G$ coincide with full centers of the corresponding 2-representations, which are in a one-to-one correspondence with Lagrangian algebras in the category of class functors on $\\mathcal G$. In particular, the fusion rule of $2\\mathrm{Rep}(\\mathcal G)$ can be calculated from the pointwise product of Lagrangian algebras as class functors. From a topological quantum field theory (TQFT) point of view, the commutative Frobenius algebra structure on a 2-character is induced from a 2D topological sigma-model with target space $\\lvert \\mathrm{B} \\mathcal G \\rvert$."}
{"main_page": "https://arxiv.org/abs/2404.01171", "pdf": "https://arxiv.org/pdf/2404.01171", "title": "Singularity categories via McKay quivers with potential", "authors": "Junyang Liu", "subjects": "Representation Theory (math.RT); Algebraic Geometry (math.AG); Category Theory (math.CT)", "abstract": "In 2018, Kalck-Yang showed that the singularity categories associated with 3-dimensional Gorenstein quotient singularities are (up to direct summands) triangle equivalent to small cluster categories associated with McKay quivers with potential. We introduce (graded) McKay quivers with potential and generalize Kalck-Yang's theorem to arbitrary dimensions. Moreover, we characterize the singularity categories in the non-Gorenstein case. More generally, singularity categories have a relative variant known as categories of Cohen-Macaulay modules. We also prove the relative variant of the structure theorem."}
