{"main_page": "https://arxiv.org/abs/2404.00804", "pdf": "https://arxiv.org/pdf/2404.00804", "title": "Higher Dimensional Birkhoff attractors", "authors": "Marie-Claude Arnaud, Vincent Humilière, Claude Viterbo", "subjects": "Symplectic Geometry (math.SG); Dynamical Systems (math.DS)", "abstract": "We extend to higher dimensions the notion of Birkhoff attractor of a dissipative map. We prove that this notion coincides with the classical Birkhoff attractor. We prove that for the dissipative system associated to the discounted Hamilton-Jacobi equation the graph of a solution is contained in the Birkhoff attractor. We also study what happens when we perturb a Hamiltonian system to make it dissipative and let the perturbation go to zero. The paper contains two important results on $\\gamma$-supports and elements of the $\\gamma$-completion of the space of exact Lagrangians. Firstly the $\\gamma$-support of a Lagrangian in a cotangent bundle carries the cohomology of the base and secondly given an exact Lagrangian $L$, any Floer theoretic equivalent Lagrangian is the $\\gamma$-limit of Hamiltonian images of $L$."}
{"main_page": "https://arxiv.org/abs/2404.01052", "pdf": "https://arxiv.org/pdf/2404.01052", "title": "Hofer Energy and Link Preserving Diffeomorphisms in Higher Genus", "authors": "Francesco Morabito, Ibrahim Trifa", "subjects": "Symplectic Geometry (math.SG)", "abstract": "Given a pre-monotone Lagrangian link, we obtain Hofer energy estimates for Hamiltonian diffeomorphisms preserving it. Such estimates depend on the braid type of the Hamiltonian diffeomorphism only, and the natural language to talk about this phenomenon is provided by a family of norms on braid groups for surfaces with boundary. This generalises the results obtained by the first author to higher genus surfaces with boundary."}
{"main_page": "https://arxiv.org/abs/2404.01091", "pdf": "https://arxiv.org/pdf/2404.01091", "title": "Symplectic Geometry for Engineers, Fundamentals", "authors": "Stefan Goessner", "subjects": "Symplectic Geometry (math.SG)", "abstract": "The mathematical theory underlying Hamiltonian mechanics is called symplectic geometry. So symplectic geometry arose from the roots of mechanics and is seen as one of the most valuable links between physics and mathematics today. Symplectic geometry in its simplest possible case is the geometry of the plane. Surprise is, we can hardly find relevant publications regarding that simple 2D case. Primary goal of this paper is to discuss the suitability of symplectic geometry in the plane for solving standard geometric and mechanical problems in physics and engineering education."}
{"main_page": "https://arxiv.org/abs/2404.01105", "pdf": "https://arxiv.org/pdf/2404.01105", "title": "On aspherical symplectic fillings with finite capacities of the  prequantization bundles", "authors": "Guanheng Chen", "subjects": "Symplectic Geometry (math.SG); Geometric Topology (math.GT)", "abstract": "A prequantization bundle is a negative circle bundle over a symplectic surface together with a contact form induced by a S1-invariant connection. Given a symplectically aspherical symplectic filling of a prequantization bundle satisfying certain topological conditions, suppose that a version of symplectic capacity of the symplectic filling is finite. Then, we show that the symplectic filling is diffeomorphic to the associated disk bundle."}
