{"main_page": "https://arxiv.org/abs/2404.00037", "pdf": "https://arxiv.org/pdf/2404.00037", "title": "On the structure vector field in lightlike hypersurfaces", "authors": "Samuel Ssekajja", "subjects": "Differential Geometry (math.DG)", "abstract": "We study lightlike hypersurfaces of an indefinite almost contact metric-manifold $\\bar{M}$. We prove that there are only two types of such hypersurfaces, known as ascreen and inascreen, with respect to the position of the structure vector field of $\\bar{M}$. We also show that the second class of hypersurfaces naturally admits an almost Hermitian structure."}
{"main_page": "https://arxiv.org/abs/2404.00115", "pdf": "https://arxiv.org/pdf/2404.00115", "title": "On polynomial solutions to the minimal surface equation", "authors": "Yifan Guo", "subjects": "Differential Geometry (math.DG); Analysis of PDEs (math.AP)", "abstract": "We are interested in finding nonlinear polynomials $P$ on $\\mathbb{R}^n$ that solves the minimal surface equation. We first prove a structure theorem on such polynomials. We show that the highest degree term $P_m$ must factor as $P_0^kQ_m$ where $k$ is odd, $Q_m\\ge 0$ on $\\mathbb{R}^n$ and $P_0$ is irreducible, and that the level sets of $P_m$ are all area minimizing. Moreover, the unique tangent cone of $\\operatorname{graph} P$ at $\\infty$ is $\\{P_0=0\\}\\times\\mathbb{R}$. If $k\\ge 3$, we know further that lower order terms down to some degree are divisible by $P_0$. We also show that $P$ must contain terms of both high and low degree. In particular, it cannot be homogeneous. As a corollary, we prove that there is no quadratic or cubic polynomial solution. Using a general decay lower bound of Green's functions on minimal hypersurfaces we are able to show that $\\operatorname{deg} P_0+k^{-1}\\operatorname{deg} Q_m\\le n-2$. Finally, we prove that a polynomial minimal graph cannot have $C\\times \\mathbb{R}^l$ as its tangent cone at $\\infty$ where $l\\ge 1$ and $C$ is any isoparametric cone. We also show that the existence of a nonlinear polynomial solutions on $\\mathbb{R}^8$ will imply the existence of an area minimizing but not strictly minimizing cubic cone in $\\mathbb{R}^8$. These results indicate that finding an explicit polynomial solution can be hard."}
{"main_page": "https://arxiv.org/abs/2404.00119", "pdf": "https://arxiv.org/pdf/2404.00119", "title": "Green's functions on minimal submanifolds", "authors": "Yifan Guo", "subjects": "Differential Geometry (math.DG); Analysis of PDEs (math.AP)", "abstract": "We show that for the Green's function on an area-minimizing boundary, it is bounded below universally by the Euclidean Green's function. We also obtain asymptotics of the Green's function near the pole and infinity. These are done by proving a $C^\\alpha$ convergence of the Green's functions under the convergence of area-minimizing boundaries. For converging multiplicity 1 stationary varifolds, we have $L^p$ convergence of the Green's functions, but there are examples of stationary varifolds on which the lower bounds and asymptotics may fail. An application of the lower bound will be given in [9]."}
{"main_page": "https://arxiv.org/abs/2404.00286", "pdf": "https://arxiv.org/pdf/2404.00286", "title": "Global Implicit Function Theorems and Critical Point Theory in  Fréchet Spaces", "authors": "Kaveh Eftekharinasab", "subjects": "Differential Geometry (math.DG)", "abstract": "We prove two versions of a global implicit function theorem, which involve no loss of derivative, for Keller's $ C_c^1 $-mappings between arbitrary Fr\\'{e}chet spaces. Subsequently, within this framework, we apply these theorems to establish the global existence and uniqueness of solutions to initial value problems that involve the loss of one derivative. Moreover, we prove a Lagrange multiplier theorem by employing indirect applications of the global implicit function theorems through submersions and transversality."}
{"main_page": "https://arxiv.org/abs/2404.00501", "pdf": "https://arxiv.org/pdf/2404.00501", "title": "Weak limits of the $J$-flow and the deformed Hermitian-Yang-Mills flow  on Kähler surfaces: boundary cases", "authors": "Rei Murakami", "subjects": "Differential Geometry (math.DG)", "abstract": "We prove that if a pair of K\\\"ahler classes is $J$-nef, the $J$-flow on a compact K\\\"ahler surface converges to a weak solution of the Monge-Amp\\`ere equation in the sense of currents. We also establish the same convergence behavior for the deformed Hermitian-Yang-Mills flow. The method is based on a property of a limit of viscosity subsolutions."}
{"main_page": "https://arxiv.org/abs/2404.00508", "pdf": "https://arxiv.org/pdf/2404.00508", "title": "Tiling spaces are covering spaces over irrational tori", "authors": "Darío Alatorre, Diego Rodríguez-Guzmán", "subjects": "Differential Geometry (math.DG); Dynamical Systems (math.DS)", "abstract": "We study tiling spaces in the diffeological context. We prove some basic diffeological properties for tiling spaces and analyze two different fiber bundle structures of one-dimensional tiling spaces over the irrational torus. We use the diffeological classification of irrationatl tori which captures their arithmetical escence in order to inherit the diffeological equivalence in the context of tiling spaces."}
{"main_page": "https://arxiv.org/abs/2404.00619", "pdf": "https://arxiv.org/pdf/2404.00619", "title": "Examples of Ricci limit spaces with infinite holes", "authors": "Shengxuan Zhou", "subjects": "Differential Geometry (math.DG); Metric Geometry (math.MG)", "abstract": "Let $n\\geq 3$, $\\lambda \\in \\mathbb{R} $, and $(X,h)$ be an $n$-dimensional smooth complete Riemannian manifold with ${\\rm Ric}_h > \\lambda $. In this paper, we construct, for each given $\\epsilon >0$, a sequence of $(n+2)$-dimensional manifolds $(M_{i} ,g_i ) \\stackrel{GH}{\\longrightarrow} (X_\\epsilon ,d_\\epsilon ) $ with ${\\rm Ric}_{g_i} > \\lambda $, such that $d_{GH} (X,X_\\epsilon ) \\leq \\epsilon $, and $X_\\epsilon $ is homeomorphic to the space obtained by removing an infinite number of balls from $X$. Hence $X_\\epsilon $ has dense boundary with an infinite number of connected components. Moreover, $X_\\epsilon $ has no open subset which is topologically a manifold. This generalizes Hupp-Naber-Wang's result (arxiv: 2308.03909) from $4$-dimensional case to the general case of dimension $n\\geq 3$. Notably, the restriction $n\\geq 3$ is essential, as Ricci limit spaces in $1$ and $2$ dimensions always have a dense open subset which is topologically a manifold. Our construction differs from that of Hupp-Naber-Wang. In their approach, Hupp-Naber-Wang considered doing an infinite number of blow-ups on the local complex surface structure of $X$, thus relying on the $4$-dimensional condition. However, our method involves removing an infinite number of balls from $X$, allowing us to construct in the general case of dimensions greater than or equal to $3$. As a corollary, we provide a solution to an open problem posed by Naber in the $3$-dimensional case. Note that the $3$-dimensional case is the only remaining unresolved case in Naber's problem. Consequently, Naber's question is resolved in all dimensions."}
{"main_page": "https://arxiv.org/abs/2404.00703", "pdf": "https://arxiv.org/pdf/2404.00703", "title": "Generalized positive scalar curvature on spin$^c$ manifolds", "authors": "Boris Botvinnik, Jonathan Rosenberg", "subjects": "Differential Geometry (math.DG); Algebraic Topology (math.AT)", "abstract": "Let $(M,L)$ be a non-spin spin$^c$ manifold. Fix a Riemannian metric $g$ on $M$ and a connection $A$ on $L$, and let $D_L$ be the associated spin$^c$ Dirac operator. Let $R^{tw}_{g,A}:=R_g + 2ic(\\Omega)$ be the twisted scalar curvature (which takes values in the endomorphims of the spinor bundle), where $R_g$ is the scalar curvature of $g$ and $2ic(\\Omega)$ comes from the curvature $2$-form $\\Omega$ of the connection $A$. Then the Lichnerowicz-Schr\\\"odinger formula for the square of the Dirac operator takes the form $D_L^2 =\\nabla^*\\nabla+\\frac{1}{4}R^{tw}_{g,A}$. In a previous work we proved that a closed non-spin simply-connected spin$^c$-manifold $(M,L)$ of dimension $n\\geq 5$ admits a pair $(g,A)$ such that $R^{tw}_{g,A}>0$ if and only if the index $\\alpha^c(M,L):=\\text{ind}\\, D_L$ vanishes in $K_n$. In this paper we introduce a scalar-valued generalized scalar curvature $R^{gen}_{g,A}:=R_g - 2|\\Omega|_{op}$, where $|\\Omega|_{op}$ is the pointwise operator norm of Clifford multiplication $c(\\Omega)$, acting on spinors. We show that the positivity condition on the operator $R^{tw}_{g,A}$ is equivalent to the positivity of the scalar function $R^{gen}_{g,A}$. We prove a corresponding trichotomy theorem concerning the curvature $R^{gen}_{g,A}$, and study its implications. We also show that the space $\\mathcal{R}^{gen+}(M,L)$ of pairs $(g,A)$ with $R^{gen}_{g,A}>0$ has non-trivial topology, and address a conjecture about non-triviality of the ``index difference'' map."}
{"main_page": "https://arxiv.org/abs/2404.00757", "pdf": "https://arxiv.org/pdf/2404.00757", "title": "Nonpositively curved surfaces are Loewner", "authors": "Mikhail G. Katz, Stephane Sabourau", "subjects": "Differential Geometry (math.DG)", "abstract": "We show that every closed nonpositively curved surface satisfies Loewner's systolic inequality. The proof relies on a combination of the Gauss-Bonnet formula with an averaging argument using the invariance of the Liouville measure under the geodesic flow. This enables us to find a disk with large total curvature around its center yielding a large area."}
{"main_page": "https://arxiv.org/abs/2404.00835", "pdf": "https://arxiv.org/pdf/2404.00835", "title": "The Brioschi Formula for the Gaussian Curvature", "authors": "Lee-Peng Teo", "subjects": "Differential Geometry (math.DG); History and Overview (math.HO)", "abstract": "The Brioschi formula expresses the Gaussian curvature $K$ in terms of the functions $E, F$ and $G$ in local coordinates of a surface $S$. This implies the Gauss' theorema egregium, which says that the Gaussian curvature just depends on angles, distances, and their rates of change. In most of the textbooks, the Gauss' theorema egregium was proved as a corollary to the derivation of the Gauss equations, a set of equations expressing $EK, FK$ and $GK$ in terms of the Christoffel symbols. The Christoffel symbols can be expressed in terms of $E$, $F$ and $G$. In principle, one can derive the Brioschi formula from the Gauss equations after some tedious calculations. In this note, we give a direct elementary proof of the Brioschi formula without using Christoffel symbols. The key to the proof are properties of matrices and determinants."}
{"main_page": "https://arxiv.org/abs/2404.00870", "pdf": "https://arxiv.org/pdf/2404.00870", "title": "A gradient flow of Spin(7)-structures", "authors": "Shubham Dwivedi", "subjects": "Differential Geometry (math.DG)", "abstract": "We formulate and study the negative gradient flow of an energy functional of Spin(7)-structures on compact 8-manifolds. The energy functional is the $L^2$-norm of the torsion of the Spin(7)-structure. Our main result is the short-time existence and uniqueness of solutions to the flow. We also explain how this negative gradient flow is the most general flow of Spin(7)-structures. We also study solitons of the flow and prove a non-existence result for compact expanding solitons."}
