{"main_page": "https://arxiv.org/abs/2404.00289", "pdf": "https://arxiv.org/pdf/2404.00289", "title": "Rota-Baxter operators of weight zero on upper-triangular matrices of  order three", "authors": "Vsevolod Gubarev", "subjects": "Rings and Algebras (math.RA)", "abstract": "We describe all Rota-Baxter operators $R$ of weight zero on the algebra $U_3(F)$ of upper-triangular matrices of order three over a field of characteristic 0. For this, we apply the following three ingredients: properties of $R(1)$, conjugation with suitable (anti)automorphisms of $U_3(F)$, and computation with the help of \\texttt{Singular} of the Gr\\\"{o}bner basis for the system of the equations arisen on the coefficients of $R$."}
{"main_page": "https://arxiv.org/abs/2404.00627", "pdf": "https://arxiv.org/pdf/2404.00627", "title": "A cohomological study of modified Rota-Baxter associative algebras with  derivations", "authors": "Imed Basdouri, Sami Benabdelhafidh, Mohamed Amin Sadraoui, Ripan Saha", "subjects": "Rings and Algebras (math.RA)", "abstract": "This paper presents a cohomological study of modified Rota-Baxter associative algebras in the presence of derivations. The Modified Rota-Baxter operator, which is a modified version and closely related to the classical Rota-Baxter operator, has garnered significant attention due to its applications in various mathematical and physical contexts. In this study, we define a cohomology theory and also investigate a one-parameter formal deformation theory and abelian extensions of modified Rota-Baxter associative algebras under the influence of derivations."}
{"main_page": "https://arxiv.org/abs/2404.00981", "pdf": "https://arxiv.org/pdf/2404.00981", "title": "Classification of three-dimensional anti-dendriform algebras", "authors": "K. Abdurasulov, J. Adashev, Z. Normatov, Sh. Solijonova", "subjects": "Rings and Algebras (math.RA)", "abstract": "This article is devoted to the classification of anti-dendriform algebras that are associated with associativity. They are characterized as algebras with two operations whose sum is associative. In particular, the paper is devoted to classifying anti-dendriform algebras associated with null-filiform associative algebras and three-dimensional algebras. It is known that any finite-dimensional associative algebra without a non-zero idempotent element is nilpotent. If an associative algebra has a non-zero idempotent element, then there does not exist a compatible anti-dendriform algebra structure associated with associative algebras."}
