{"main_page": "https://arxiv.org/abs/2404.00077", "pdf": "https://arxiv.org/pdf/2404.00077", "title": "A note on the Kronecker--Weyl equidistribution theorem", "authors": "J. Beck, W.W.L. Chen, Y. Yang", "subjects": "Dynamical Systems (math.DS); Number Theory (math.NT)", "abstract": "We study the relationship between the discrete and the continuous versions of the Kronecker--Weyl equidistribution theorem, as well as their possible extension to manifolds in higher dimensions. We also investigate a way to deduce in some limited way uniformity results in higher dimension from results in lower dimension."}
{"main_page": "https://arxiv.org/abs/2404.00078", "pdf": "https://arxiv.org/pdf/2404.00078", "title": "Irreversible and dissipative systems", "authors": "J. Beck, W.W.L. Chen, Y. Yang", "subjects": "Dynamical Systems (math.DS); Number Theory (math.NT)", "abstract": "We study some new dynamical systems where the corresponding piecewise linear flow is neither time reversible nor measure preserving. We create a dissipative system by starting with a finite polysquare translation surface, and then modifying it by including a one-sided barrier on a common vertical edge of two adjacent atomic squares, in the form of a union of finitely many intervals. The line flow in this system partitions the system into a transient set and a recurrent set. We are interested in the geometry of these two sets."}
{"main_page": "https://arxiv.org/abs/2404.00307", "pdf": "https://arxiv.org/pdf/2404.00307", "title": "Mountain pass frozen planet orbits in the helium atom model", "authors": "Stefano Baranzini, Gian Marco Canneori, Susanna Terracini", "subjects": "Dynamical Systems (math.DS); Classical Analysis and ODEs (math.CA)", "abstract": "We seek frozen planet orbits for the helium atom through an application of the Mountain Pass Lemma to the Lagrangian action functional. Our method applies to a wide class of gravitational-like interaction potentials thus generalising the results in [7] (Cieliebak, Frauenfelder and Volkov - 2023). We also let the charge of the two electrons tend to zero and perform the asymptotic analysis to prove convergence to a limit trajectory having a collision-reflection singularity between the electrons."}
{"main_page": "https://arxiv.org/abs/2404.00337", "pdf": "https://arxiv.org/pdf/2404.00337", "title": "Pluripotency of wandering dynamics", "authors": "Shin Kiriki, Yushi Nakano, Teruhiko Soma", "subjects": "Dynamical Systems (math.DS)", "abstract": "This paper proposes a new concept of pluripotency inspired by Colli-Vargas [Ergod. Theory Dyn. Syst., 21(6):1657-1681, 2001] and presents fundamental theorems for developing the theory. Pluripotency reprograms dynamics from a statistical or geometrical point of view. This means that the dynamics of various codes, including non-trivial Dirac physical measures or historic behavior, can be observably and stochastically realized by arbitrarily small perturbations. We first give a practical condition equivalent to a stronger version of pluripotency. Next, we show that the property of pluripotency is $C^{r} (2\\leq r<\\infty)$-robust. Precisely, there exists a $C^{r}$-open set of non-hyperbolic diffeomorphisms that have wild blender-horseshoes and are strongly pluripotent. It implies a new affirmative solution to Takens' last problem for $C^{r}$ diffeomorphisms of dimension $n\\geq 3$."}
{"main_page": "https://arxiv.org/abs/2404.00535", "pdf": "https://arxiv.org/pdf/2404.00535", "title": "Cusp bifurcations: numerical detection via two-parameter continuation  and computer-assisted proofs of existence", "authors": "Jean-Philippe Lessard, Alessandro Pugliese", "subjects": "Dynamical Systems (math.DS)", "abstract": "This paper introduces a novel computer-assisted method for detecting and constructively proving the existence of cusp bifurcations in differential equations. The approach begins with a two-parameter continuation along which a tool based on the theory of Poincar\\'e index is employed to identify the presence of a cusp bifurcation. Using the approximate cusp location, Newton's method is then applied to a given augmented system (the cusp map), yielding a more precise numerical approximation of the cusp. Through a successful application of a Newton-Kantorovich type theorem, we establish the existence of a non-degenerate zero of the cusp map in the vicinity of the numerical approximation. Employing a Gershgorin circles argument, we then prove that exactly one eigenvalue of the Jacobian matrix at the cusp candidate has zero real part, thus rigorously confirming the presence of a cusp bifurcation. Finally, by incorporating explicit control over the cusp's location, a rigorous enclosure for the normal form coefficient is obtained, providing the explicit dynamics on the center manifold at the cusp. We show the effectiveness of this method by applying it to four distinct models."}
{"main_page": "https://arxiv.org/abs/2404.00601", "pdf": "https://arxiv.org/pdf/2404.00601", "title": "The paradigm of tax-reward and tax-punishment strategies in the  advancement of public resource management dynamics", "authors": "Lichen Wang, Yuyuan Liu, Ruqiang Guo, Liang Zhang, Linjie Liu, Shijia Hua", "subjects": "Dynamical Systems (math.DS)", "abstract": "In contemporary society, the effective utilization of public resources remains a subject of significant concern. A common issue arises from defectors seeking to obtain an excessive share of these resources for personal gain, potentially leading to resource depletion. To mitigate this tragedy and ensure sustainable development of resources, implementing mechanisms to either reward those who adhere to distribution rules or penalize those who do not, appears advantageous. We introduce two models: a tax-reward model and a tax-punishment model, to address this issue. Our analysis reveals that in the tax-reward model, the evolutionary trajectory of the system is influenced not only by the tax revenue collected but also by the natural growth rate of the resources. Conversely, the tax-punishment model exhibits distinct characteristics when compared to the tax-reward model, notably the potential for bistability. In such scenarios, the selection of initial conditions is critical, as it can determine the system's path. Furthermore, our study identifies instances where the system lacks stable points, exemplified by a limit cycle phenomenon, underscoring the complexity and dynamism inherent in managing public resources using these models."}
{"main_page": "https://arxiv.org/abs/2404.00662", "pdf": "https://arxiv.org/pdf/2404.00662", "title": "On bond anisotropy for the ising model through the geometry of numbers", "authors": "Renë Rühr", "subjects": "Dynamical Systems (math.DS); Statistical Mechanics (cond-mat.stat-mech)", "abstract": "We associate to each unit volume lattice of $\\R^d$ the Ising model with bond variables equal to the inverse successive minima of that lattice. This induces the notion of a critical temperature for a random lattice for which integrability exponents are proven."}
{"main_page": "https://arxiv.org/abs/2404.00700", "pdf": "https://arxiv.org/pdf/2404.00700", "title": "Critical exponent gap and leafwise dimension", "authors": "Omri Nisan Solan", "subjects": "Dynamical Systems (math.DS)", "abstract": "We show that for every nonarithmetic lattice $\\Gamma<{\\rm SL}_2(\\mathbb{C})$ there is a gap $\\varepsilon_\\Gamma>0$ such that for every $g\\in {\\rm SL}_2(\\mathbb{C})$ the intersection ${\\rm SL}_2(\\mathbb{R})\\cap g\\Gamma g^{-1}$ is either a lattice in ${\\rm SL}_2(\\mathbb{R})$ or has critical exponent $\\delta({\\rm SL}_2(\\mathbb{R})\\cap g\\Gamma g^{-1}) \\leq 1 - \\varepsilon_\\Gamma$."}
{"main_page": "https://arxiv.org/abs/2404.00731", "pdf": "https://arxiv.org/pdf/2404.00731", "title": "Portraits of quadratic rational maps with a small critical cycle", "authors": "Tyler Dunaisky, David Krumm", "subjects": "Dynamical Systems (math.DS); Number Theory (math.NT)", "abstract": "Motivated by a uniform boundedness conjecture of Morton and Silverman, we study the graphs of pre-periodic points for maps in three families of dynamical systems, namely the collections of rational functions of degree two having a periodic critical point of period $n$, where $n\\in\\{2,3,4\\}$. In particular, we provide a conjecturally complete list of possible graphs of rational pre-periodic points in the case $n=4$, analogous to well-known work of Poonen for $n=1$, and we strengthen earlier results of Canci and Vishkautsan for $n\\in\\{2,3\\}$. In addition, we address the problem of determining the representability of a given graph in our list by infinitely many distinct linear conjugacy classes of maps."}
{"main_page": "https://arxiv.org/abs/2404.00958", "pdf": "https://arxiv.org/pdf/2404.00958", "title": "Positive steady states of a class of power law systems with independent  decompositions", "authors": "Al Jay Lan J. Alamin, Bryan S. Hernandez", "subjects": "Dynamical Systems (math.DS)", "abstract": "Power law systems have been studied extensively due to their wide-ranging applications, particularly in chemistry. In this work, we focus on an important subclass of power law systems, which generalizes the mass action framework where every pair of reactions sharing identical reactant complexes possesses identical kinetic order vectors, that can be decomposed into stoichiometrically independent subsystems. We show that for such systems, if the deficiencies of the underlying individual subnetworks sum up to the deficiency of the entire network, and the ranks of the augmented matrices containing the kinetic order vectors of the subnetworks sum up to the rank of the augmented matrix containing the kinetic order vectors of the entire network, then the existence of the positive steady states of each stoichiometrically-independent subsystem is a necessary and sufficient condition for the existence of the positive steady states of the given power law system. We illustrate this result by providing illustrative examples, one of which is a network of a carbon cycle model that satisfies the assumptions, while the other network fails to meet the assumptions. Finally, using the aforementioned result, we present a systematic method for deriving positive steady state parametrizations for the mentioned subclass of power law systems with identical stoichiometrically independent subnetworks, which is a generalization of our recent method for mass action systems."}
{"main_page": "https://arxiv.org/abs/2404.01000", "pdf": "https://arxiv.org/pdf/2404.01000", "title": "On the Synchronization Analysis of a Strong Competition Kuramoto Model", "authors": "Chun-Hsiung Hsia, Chung-En Tsai", "subjects": "Dynamical Systems (math.DS)", "abstract": "When modeling the classical Kuramoto model, one of the key features is the tendency to synchronize. Accordingly, the most well-adopted choice of the coupling function is the sine function. Due to the oddness of the sine function, the synchronized frequency would be the average of all the natural frequencies. In this article, we study the synchronization behaviors of the Kuramoto model with a pure competition coupling function. Namely, instead of the sine function, we choose $\\max \\{0, \\sin \\theta \\}$ to be the coupling function. This indicates the relation of pure competition between oscillators. We prove asymptotical phase synchronization for identical oscillators and asymptotical frequency synchronization for non-identical oscillators under reasonable sufficient conditions. In particular, under our sufficient conditions, the synchronized frequency is the maximal frequency of all the natural frequencies. On the other hand, in the parameter regime which is out of the scope of the analysis of our theorems, it is possible that the synchronized frequency could be larger than the maximal frequency of the natural frequencies of all the oscillators. In this article, we also provide numerical experiments to support the analysis of our theorem and to demonstrate the aforementioned phenomenon."}
{"main_page": "https://arxiv.org/abs/2404.01073", "pdf": "https://arxiv.org/pdf/2404.01073", "title": "Integrable deformations of Rikitake systems, Lie bialgebras and  bi-Hamiltonian structures", "authors": "Angel Ballesteros, Alfonso Blasco, Ivan Gutierrez-Sagredo", "subjects": "Dynamical Systems (math.DS); Mathematical Physics (math-ph); Exactly Solvable and Integrable Systems (nlin.SI)", "abstract": "Integrable deformations of a class of Rikitake dynamical systems are constructed by deforming their underlying Lie-Poisson Hamiltonian structures as linearizations of Poisson--Lie structures on certain (dual) Lie groups. By taking into account that there exists a one-to one correspondence between Poisson--Lie groups and Lie bialgebra structures, a number of deformed Poisson coalgebras can be obtained, which allow the construction of integrable deformations of coupled Rikitake systems. Moreover, the integrals of the motion for coupled systems can be explicitly obtained by means of the deformed coproduct map. The same procedure can be also applied when the initial system is bi-Hamiltonian with respect to two different Lie-Poisson algebras. In this case, to preserve a bi-Hamiltonian structure under deformation, a common Lie bialgebra structure for the two Lie-Poisson structures has to be found. Coupled dynamical systems arising from this bi-Hamiltonian deformation scheme are also presented, and the use of collective `cluster variables', turns out to be enlightening in order to analyse their dynamical behaviour. As a general feature, the approach here presented provides a novel connection between Lie bialgebras and integrable dynamical systems."}
