{"main_page": "https://arxiv.org/abs/2404.00239", "pdf": "https://arxiv.org/pdf/2404.00239", "title": "On the Small Jumps of Lévy Processes and the Multivariate Dickman  Distribution", "authors": "Michael Grabchak, Xingnan Zhang", "subjects": "Probability (math.PR)", "abstract": "We develop a Dickman approximation to the small jumps of multivariate L\\'evy processes and related stochastic integral processes. Further, we show that the multivariate Dickman distribution is the unique distribution satisfying a certain stability property and that a related stochastic process is self-similar. Along the way we develop applications to non-Gaussian OU-Processes, to the class of generalized multivariate gamma distributions, and to the popular Barndorff-Nielsen and Shephard stochastic volatility model."}
{"main_page": "https://arxiv.org/abs/2404.00293", "pdf": "https://arxiv.org/pdf/2404.00293", "title": "Some super-Poincaré inequalities for gaussian-like measures on  stratified Lie groups", "authors": "Yaozhong W. Qiu", "subjects": "Probability (math.PR); Functional Analysis (math.FA)", "abstract": "We continue the $U$-bound program initiated in [J. Funct. Anal. 258, 814-851 (2010)] and prove super-Poincar\\'e inequalities for a class of probability measures defined on stratified Lie groups and in terms of their homogeneous norms with explicit estimates, the main ingredient in the proof being a Hardy-type inequality. In doing so, we recover and extend some previous results from the probabilistic viewpoint."}
{"main_page": "https://arxiv.org/abs/2404.00348", "pdf": "https://arxiv.org/pdf/2404.00348", "title": "Entropy-regularized optimal transport over networks with incomplete  marginals information", "authors": "Aayan Masood Pathan, Michele Pavon", "subjects": "Probability (math.PR)", "abstract": "We study in this paper optimal mass transport over a strongly connected, directed graph on a given discrete time interval. Differently from previous literature, we do not assume full knowledge of the initial and final goods distribution over the network nodes. In spite of the meager information, we show that it is possible to characterize the most likely flow in two important cases: The first one is when the initial and/or final distribution is only known on proper subsets of the nodes. The second case is when only some moments of the marginal distributions are known. As an important by-product, we determine the most likely initial and final marginals on the whole state space."}
{"main_page": "https://arxiv.org/abs/2404.00435", "pdf": "https://arxiv.org/pdf/2404.00435", "title": "Total progeny in almost critical multi-type Galton-Watson processes", "authors": "T.B. Lysetskyi, Ya.I. Yeleiko", "subjects": "Probability (math.PR)", "abstract": "We consider multi-type Galton-Watson branching processes, where the Perron root ($\\rho$) of the first moments matrix approaches unity. Specifically, we examine the random vector representing the number of individuals preceding generation $n$, often referred to as the total progeny. By conditioning on non-extinction or extinction at current time, and properly normalizing it, we derive the asymptotic distribution for this vector. Similar theorem is derived for process with immigration. The key determinant of this distributions is the limit of $n(\\rho-1)$ as $n$ tends to infinity and $\\rho$ approaches 1."}
{"main_page": "https://arxiv.org/abs/2404.00709", "pdf": "https://arxiv.org/pdf/2404.00709", "title": "The Gaussian free-field as a stream function: continuum version of the  scale-by-scale homogenization result", "authors": "Peter Morfe, Felix Otto, Christian Wagner", "subjects": "Probability (math.PR); Analysis of PDEs (math.AP)", "abstract": "This note is about a drift-diffusion process $X$ with a time-independent, divergence-free drift $b$, where $b$ is a smooth Gaussian field that decorrelates over large scales. In two space dimensions, this just fails to fall into the standard theory of stochastic homogenization, and leads to a borderline super-diffusive behavior. In a previous paper by Chatzigeorgiou, Morfe, Otto, and Wang (2022), precise asymptotics of the annealed second moments of $X$ were derived by characterizing the asymptotics of the effective diffusivity $\\lambda_L$ in terms of an artificially introduced large-scale cut-off $L$. The latter was carried out by a scale-by-scale homogenization, and implemented by monitoring the corrector $\\phi_L$ for geometrically increasing cut-off scales $L^+=ML$. In fact, proxies $(\\tilde\\phi_L,\\tilde\\sigma_L)$ for the corrector and flux corrector were introduced incrementally and the residuum $f_L$ estimated. In this short supplementary note, we reproduce the arguments of the above paper in the continuum setting of $M\\downarrow 1$. This has the advantage that the definition of the proxies $(\\tilde\\phi_L,\\tilde\\sigma_L)$ becomes more transparent -- it is given by a simple It\\^{o} SDE with $\\ln L$ acting as a time variable. It also has the advantage that the residuum $f_L$, which is a martingale, can be efficiently and precisely estimated by It\\^{o} calculus. This relies on the characterization of the quadratic variation of the (infinite-dimensional) Gaussian driver."}
{"main_page": "https://arxiv.org/abs/2404.01115", "pdf": "https://arxiv.org/pdf/2404.01115", "title": "Superdiffusive central limit theorem for a Brownian particle in a  critically-correlated incompressible random drift", "authors": "Scott Armstrong, Ahmed Bou-Rabee, Tuomo Kuusi", "subjects": "Probability (math.PR); Mathematical Physics (math-ph); Analysis of PDEs (math.AP)", "abstract": "We consider the long-time behavior of a diffusion process on $\\mathbb{R}^d$ advected by a stationary random vector field which is assumed to be divergence-free, dihedrally symmetric in law and have a log-correlated potential. A special case includes $\\nabla^\\perp$ of the Gaussian free field in two dimensions. We show the variance of the diffusion process at a large time $t$ behaves like $2 c_* t (\\log t)^{1/2}$, in a quenched sense and with a precisely determined, universal prefactor constant $c_*>0$. We also prove a quenched invariance principle under this superdiffusive scaling. The proof is based on a rigorous renormalization group argument in which we inductively analyze coarse-grained diffusivities, scale-by-scale. Our analysis leads to sharp homogenization and large-scale regularity estimates on the infinitesimal generator, which are subsequently transferred into quantitative information on the process."}
{"main_page": "https://arxiv.org/abs/2404.01118", "pdf": "https://arxiv.org/pdf/2404.01118", "title": "Strong law of large numbers for $m$-dependent and stationary random  variables under sub-linear expectations", "authors": "Wang-Yun Gu, Li-Xin Zhang", "subjects": "Probability (math.PR)", "abstract": "The arm of this paper is to establish the strong law of large numbers (SLLN) of $m$-dependent random variables under the framework of sub-linear expectations. We establish the SLLN for a sequence of independent, but not necessarily identically distributed random variables. The study further extends the SLLN to $m$-dependent and stationary sequence of random variables with the condition $C_{\\mathbb V}(|X_1|)<\\infty$ which is the sufficient and necessary condition of SLLN in the case of independent and identically distributed random variables."}
{"main_page": "https://arxiv.org/abs/2404.01149", "pdf": "https://arxiv.org/pdf/2404.01149", "title": "Least Non-Zero Singular Value and the Distribution of Eigenvectors of  non-Hermitian Random Matrices", "authors": "Mohammed Osman", "subjects": "Probability (math.PR); Mathematical Physics (math-ph)", "abstract": "We obtain a tail bound for the least non-zero singular value of $A-z$ when $A$ is a random matrix and $z$ is an eigenvalue of $A$ in a neighbourhood of a given point $z_0$ in the bulk of the spectrum. The argument relies on a resolvent comparison and a tail bound for Gauss-divisible matrices. The latter can be obtained by the method of partial Schur decomposition. Using this bound we prove that any finite collection of components of a right eigenvector corresponding to an eigenvalue uniformly sampled from a neighbourhood of a point in the bulk is Gaussian. A byproduct of the calculation is an asymptotic formula for the odd moments of the absolute value of the characteristic polynomial of real Gauss-divisible matrices."}
