{"main_page": "https://arxiv.org/abs/2404.00116", "pdf": "https://arxiv.org/pdf/2404.00116", "title": "Backward-forward characterization of attainable set for conservation  laws with spatially discontinuous flux", "authors": "Fabio Ancona, Luca Talamini", "subjects": "Analysis of PDEs (math.AP)", "abstract": "Consider a scalar conservation law with a spatially discontinuous flux at a single point x=0, and assume that the flux is uniformly convex when x\\neq 0. Given an interface connection (A,B), we define a backward solution operator consistent with the concept of AB-entropy solution [4,13,16]. We then analyze the family A^{[AB]}(T) of profiles that can be attained at time T>0 by AB-entropy solutions with L^\\infty-initial data. We provide a characterization of A^{[AB]}(T) as fixed points of the backward-forward solution operator. As an intermediate step we establish a full characterization of A^{[AB]}(T) in terms of unilateral constraints and Ole\\v{\\i}nik-type estimates, valid for all connections. Building on such a characterization we derive uniform BV bounds on the flux of AB-entropy solutions, which in turn yield the L^1_{loc}-Lipschitz continuity in time of these solutions."}
{"main_page": "https://arxiv.org/abs/2404.00182", "pdf": "https://arxiv.org/pdf/2404.00182", "title": "On the Sobolev boundedness of vector fields on compact Riemannian  manifolds", "authors": "Duván Cardona, Alexandre Kirilov, Wagner A. A. de Moraes, André Pedroso Kowacs", "subjects": "Analysis of PDEs (math.AP)", "abstract": "We analyse the sharpness of the Sobolev order for vector fields on compact Riemannian manifolds. As an application, we then prove ill-posedness for a certain class of Cauchy problems."}
{"main_page": "https://arxiv.org/abs/2404.00258", "pdf": "https://arxiv.org/pdf/2404.00258", "title": "Singular solutions of semilinear elliptic equations with exponential  nonlinearities in 2-dimensions", "authors": "Yohei Fujishima, Norisuke Ioku, Bernhard Ruf, Elide Terraneo", "subjects": "Analysis of PDEs (math.AP)", "abstract": "By introducing a new classification of the growth rate of exponential functions, singular solutions for semilinear elliptic equations in 2-dimensions with exponential nonlinearities are constructed. The strategy is to introduce a model nonlinearity which admits an explicit singular solution. Then, using a transformation as in [8], one obtains an approximate singular solution, and then one concludes by a suitable fixed point argument. Our method covers a wide class of nonlinearities in a unified way. As a special case, our result contains a pioneering contribution by Ibrahim--Kikuchi--Nakanishi--Wei [15] for the Moser--Trudinger type nonlinearity."}
{"main_page": "https://arxiv.org/abs/2404.00347", "pdf": "https://arxiv.org/pdf/2404.00347", "title": "Stability of equilibria of the spatially inhomogeneous Vicsek-BGK  equation across a bifurcation", "authors": "Sara Merino-Aceituno, Christian Schmeiser, Raphael Winter", "subjects": "Analysis of PDEs (math.AP); Adaptation and Self-Organizing Systems (nlin.AO)", "abstract": "The Vicsek-BGK equation is a kinetic model for alignment of particles moving with constant speed between stochastic reorientation events with sampling from a von Mises distribution. The spatially homogeneous model shows a steady state bifurcation with exchange of stability. The main result of this work is an extension of the bifurcation result to the spatially inhomogeneous problem under the additional assumption of a sufficiently large Knudsen number, which is shown to be necessary. A counterexample is derived in the form of an exponentially increasing travelling wave solution of the linearized equation, indicating a possible explanation of traveling bands, which have been observed in the literature in simulations with an individual based model. The mathematical core is the proof of linearized stability, which employs a new hypocoercivity approach based on Laplace-Fourier transformation. The bifurcation result includes global existence of smooth solutions for close-to-equilibrium initial data. For large data smooth solutions might blow up in finite time whereas weak solutions with bounded Boltzmann entropy are shown to exist globally."}
{"main_page": "https://arxiv.org/abs/2404.00400", "pdf": "https://arxiv.org/pdf/2404.00400", "title": "Mean First Passage Times for Transport Equations", "authors": "Thomas Hillen, Maria R. D'Orsogna, Jacob C. Mantooth, Alan E. Lindsay", "subjects": "Analysis of PDEs (math.AP)", "abstract": "Many transport processes in ecology, physics and biochemistry can be described by the average time to first find a site or exit a region, starting from an initial position. Typical mathematical treatments are based on formulations that allow for various diffusive forms and geometries but where only initial and final positions are taken into account. Here, we develop a general theory for the mean first passage time (MFPT) for velocity jump processes. For random walkers, both position and velocity are tracked and the resulting Fokker-Planck equation takes the form of a kinetic transport equation. Starting from the forward and backward formulations we derive a general elliptic integro-PDE for the MFPT of a random walker starting at a given location with a given velocity. We focus on two scenarios that are relevant to biological modelling; the diffusive case and the anisotropic case. For the anisotropic case we also perform a parabolic scaling, leading to a well known anisotropic MFPT equation. To illustrate the results we consider a two-dimensional circular domain under radial symmetry, where the MFPT equations can be solved explicitly. Furthermore, we consider the MFPT of a random walker in an ecological habitat that is perturbed by linear features, such as"}
{"main_page": "https://arxiv.org/abs/2404.00460", "pdf": "https://arxiv.org/pdf/2404.00460", "title": "On the weighted non-linear Steklov eigenvalue problem in outward  cuspidal domains", "authors": "Prashanta Garain, Vladimir Gol'dshtein, Alexander Ukhlov", "subjects": "Analysis of PDEs (math.AP)", "abstract": "In this article, we consider the weighted Steklov $p$-eigenvalue problem in outward cuspidal domains. We prove solvability of this spectral problem both in the linear and non-linear case."}
{"main_page": "https://arxiv.org/abs/2404.00479", "pdf": "https://arxiv.org/pdf/2404.00479", "title": "Sharp regularity estimates for $0$-order $p$-Laplacian evolution  problems", "authors": "Matteo Bonforte, Ariel Salort", "subjects": "Analysis of PDEs (math.AP)", "abstract": "We study regularity properties of solutions to nonlinear and nonlocal evolution problems driven by the so-called \\emph{$0$-order fractional $p-$Laplacian} type operators: $$ \\partial_t u(x,t)=\\mathcal{J}_p u(x,t):=\\int_{\\mathbb{R}^n} J(x-y)|u(y,t)-u(x,t)|^{p-2}(u(y,t)-u(x,t))\\,dy\\,, $$ where $n\\ge 1$, $p>1$, $J\\colon\\mathbb{R}^n\\to\\mathbb{R}$ is a bounded nonnegative function with compact support, $J(0)>0$ and normalized such that $\\|J\\|_{\\mathrm{L}^1(\\mathbb{R}^n)}=1$, but not necessarily smooth. We deal with Cauchy problems on the whole space, and with Dirichlet and Neumann problems on bounded domains. Beside complementing the existing results about existence and uniqueness theory, we focus on sharp regularity results in the whole range $p\\in (1,\\infty)$. When $p>2$, we find an unexpected $\\mathrm{L}^q-\\mathrm{L}^\\infty$ regularization: the surprise comes from the fact that this result is false in the linear case $p=2$. We show next that bounded solutions automatically gain higher time regularity, more precisely that $u(x,\\cdot)\\in C^p_t$. We finally show that solutions preserve the regularity of the initial datum up to certain order, that we conjecture to be optimal ($p$-derivatives in space). When $p>1$ is integer we can reach $C^\\infty$ regularity (gained in time, preserved in space) and even analyticity in time. The regularity estimates that we obtain are quantitative and constructive (all computable constants), and have a local character, allowing us to show further properties of the solutions: for instance, initial singularities do not move with time. We also study the asymptotic behavior for large times of solutions to Dirichlet and Neumann problems. Our results are new also in the linear case and are sharp when $p$ is integer. We expect them to be optimal for all $p>1$, supporting this claim with some numerical simulations."}
{"main_page": "https://arxiv.org/abs/2404.00587", "pdf": "https://arxiv.org/pdf/2404.00587", "title": "A uniqueness theory on determining the nonlinear energy potential in  phase-field system", "authors": "Tianhao Ni, Jun Lai", "subjects": "Analysis of PDEs (math.AP); Mathematical Physics (math-ph)", "abstract": "The phase-field system is a nonlinear model that has significant applications in material sciences. In this paper, we are concerned with the uniqueness of determining the nonlinear energy potential in a phase-field system consisted of Cahn-Hilliard and Allen-Cahn equations. This system finds widespread applications in the development of alloys engineered to withstand extreme temperatures and pressures. The goal is to reconstruct the nonlinear energy potential through the measurements of concentration fields. We establish the local well-posedness of the phase-field system based on the implicit function theorem in Banach spaces. Both of the uniqueness results for recovering time-independent and time-dependent energy potential functions are provided through the higher order linearization technique."}
{"main_page": "https://arxiv.org/abs/2404.00609", "pdf": "https://arxiv.org/pdf/2404.00609", "title": "Strong maximum principle for generalized solutions to equations of the  Monge-Ampère type", "authors": "Huaiyu Jian, Xushan Tu", "subjects": "Analysis of PDEs (math.AP)", "abstract": "In this paper, we investigate the strong maximum principle for generalized solutions of Monge-Amp\\`ere type equations. We prove that the strong maximum principle holds at points where the function is strictly convex but not necessarily $C^{1,1}$ smooth, and show that it fails at non-strictly convex points. The results we obtain can be applied to various Minkowski type problems in convex geometry by the virtue of the Gauss image map."}
{"main_page": "https://arxiv.org/abs/2404.00664", "pdf": "https://arxiv.org/pdf/2404.00664", "title": "Bifurcation of solitary waves", "authors": "Vladimir Kozlov", "subjects": "Analysis of PDEs (math.AP); Dynamical Systems (math.DS)", "abstract": "We consider solitary water waves on the vorticity flow in a two-dimensional channel of finite depth. The main object of study is a branch of solitary waves starting from a laminar flow and then approaching an extreme wave. In \\cite{Koz1b} it was proved that there always exists a bifurcation point on such branches and the first bifurcation occurs at a simple eigenvalue. Here we describe the structure of global bifurcating branches starting from this bifurcation point."}
{"main_page": "https://arxiv.org/abs/2404.00677", "pdf": "https://arxiv.org/pdf/2404.00677", "title": "Landau-de Gennes model with sextic potentials: asymptotic behavior of  minimizers", "authors": "Wei Wang, Zhifei Zhang", "subjects": "Analysis of PDEs (math.AP)", "abstract": "We study a class of Landau-de Gennes energy functionals with a sextic bulk energy density in a three-dimensional domain. We examine the asymptotic behavior of uniformly bounded minimizers in two distinct scenarios: one where their energy remains uniformly bounded, and another where it logarithmically diverges as a function of the elastic constant. In the first case, we show that up to a subsequence, the minimizers converge to a locally minimizing harmonic map in both the $ H_{\\loc}^1 $ and $ C_{\\loc}^j, j\\in \\Z_+ $ norms within compact subsets that are distant from the singularities of the limit. For the second case, we establish the existence of a closed set denoted as $ \\cS_{\\op{line}} $. This set has finite length and consists of finite segments of lines locally such that the energy of minimizers are locally uniformly bounded away from it. This work solves an open question raised by Canevari (ARMA, 223 (2017), 591-676), specifically concerning point and line defects in the Landau-de Gennes model with sextic potentials."}
{"main_page": "https://arxiv.org/abs/2404.00687", "pdf": "https://arxiv.org/pdf/2404.00687", "title": "Variational method for fractional Hamiltonian system in bounded domain", "authors": "Weimin Zhang", "subjects": "Analysis of PDEs (math.AP)", "abstract": "In this paper, we consider the following fractional Hamiltonian system \\begin{equation*} \\begin{cases} \\begin{aligned} (-\\Delta)^{s} u&=H_v(u,v) \\;\\;&&\\text{in}~\\Omega,\\\\ (-\\Delta)^{s} v&=H_u(u,v) &&\\text{in}~\\Omega,\\\\ u,\\,&v=0 &&\\text{in} ~ \\mathbb{R}^N\\setminus\\Omega, \\end{aligned} \\end{cases} \\end{equation*} where $s\\in (0,1)$, $N>2s$, $H \\in C^1(\\mathbb{R}^2, \\mathbb{R})$ and $\\Omega \\subset \\mathbb{R}^N$ is a bounded domain with $C^{1, 1}$ boundary. To apply the variational method for this problem, the key question is to find a suitable functional setting. Instead of the usual fractional Sobolev spaces we use the solutions space of $(-\\Delta)^{s}u=f$, for which we show the related (compact) embedding properties. When $H$ has subcritical and superlinear growth, we construct two frameworks respectively with interpolation and dual method. Under some technical conditions, we show the existence of nontrivial solutions. Finally, we consider fractional Lane-Emden system, i.e. $H(u, v)=\\frac{1}{p+1}|u|^{p+1}+\\frac{1}{q+1}|v|^{q+1}$. With subcritical condition, we consider the existence, uniqueness and radially symmetry of positive solutions."}
{"main_page": "https://arxiv.org/abs/2404.00689", "pdf": "https://arxiv.org/pdf/2404.00689", "title": "The biharmonic optimal support problem", "authors": "Antoine Lemenant, Mohammad Reza Pakzad", "subjects": "Analysis of PDEs (math.AP); Functional Analysis (math.FA)", "abstract": "We establish a $\\Gamma$-convergence result for $h\\to 0$ of a thin nonlinearly elastic 3D-plate of thickness $h>0$ which is assumed to be glued to a support region in the 2D-plane $x_3=0$ over the $h$-2D-neighborhood of a given closed set $K$. In the regime of very small vertical forces we identify the $\\Gamma$-limit as being the bi-harmonic energy, with Dirichlet condition on the gluing region $K$, following a general strategy by Friesecke, James, and M\\\"uller that we have to adapt in presence of the glued region. Then we introduce a shape optimization problem that we call \"optimal support problem\" and which aims to find the best glued plate. In this problem the bi-harmonic energy is optimized among all possible glued regions $K$ that we assume to be connected and for which we penalize the length. By relating the dual problem with Griffith almost-minimizers, we are able to prove that any minimizer is $C^{1,\\alpha}$ regular outside a set of Hausdorff dimension strictly less then one."}
{"main_page": "https://arxiv.org/abs/2404.00755", "pdf": "https://arxiv.org/pdf/2404.00755", "title": "Stationary solutions to the relativistic BGK model for gas mixtures in a  slab", "authors": "Byung-Hoon Hwang, Myeong-Su Lee", "subjects": "Analysis of PDEs (math.AP)", "abstract": "In a recent paper [16], the authors proposed a BGK model for relativistic gas mixtures based on the Marle-type approximation, which satisfies the fundamental kinetic properties: non-negativity of distribution functions, conservation laws, H-theorem, and indifferentiability principle. In this paper, we are concerned with the stationary problems to the relativistic BGK model for gas mixtures in slab geometry. We establish the existence of a unique mild solution with the fixed inflow boundary data when the collision frequencies for each species are sufficiently small."}
{"main_page": "https://arxiv.org/abs/2404.00799", "pdf": "https://arxiv.org/pdf/2404.00799", "title": "Existence for noncoercive nonlinear elliptic equations with two  lower-order terms", "authors": "Thi Tam Dang, Trung Hau Hoang", "subjects": "Analysis of PDEs (math.AP)", "abstract": "This paper considers a class of noncoercive nonlinear elliptic problems with coefficients defined in Marcinkiewicz and Lorentz spaces. We prove the existence of a solution for the corresponding Dirichlet problem and investigate the higher integrability properties of the solution."}
{"main_page": "https://arxiv.org/abs/2404.00907", "pdf": "https://arxiv.org/pdf/2404.00907", "title": "The long-time behavior of solutions of a three-component  reaction-diffusion model for the population dynamics of farmers and  hunter-gatherers: the different motility case", "authors": "Dongyuan Xiao, Ryunosuke Mori", "subjects": "Analysis of PDEs (math.AP)", "abstract": "In this paper, we investigate the spreading properties of solutions of the Aoki-Shida-Shigesada model. This model is a three-component reaction-diffusion system that delineates the geographical expansion of an initially localized population of farmers into a region occupied by hunter-gatherers. By considering the scenario where farmers and hunter-gatherers possess identical motility, Aoki et al. previously concluded, through numerical simulations and some formal linearization arguments, that there are four different types of spreading behaviors depending on the parameter values. In this paper, we concentrate on the general case for which farmers and hunter-gatherers possess different motility. By providing more sophisticated estimates, we not only theoretically justify the spreading speed of the Aoki-Shida-Shigesada model, but also establish sharp estimates for the long-time behaviors of solutions. These estimates enable us to validate all four types of spreading behaviors observed by Aoki et al.."}
{"main_page": "https://arxiv.org/abs/2404.00985", "pdf": "https://arxiv.org/pdf/2404.00985", "title": "Long time stability and instability in the two-dimensional Boussinesq  system with kinematic viscosity", "authors": "Jaemin Park", "subjects": "Analysis of PDEs (math.AP)", "abstract": "In this paper, we investigate the long-time behavior of the two-dimensional incompressible Boussinesq system with kinematic viscosity in a periodic channel, focusing on instability and asymptotic stability near hydrostatic equilibria. Firstly, we prove that any hydrostatic equilibrium reveals long-time instability when the initial data are perturbed in Sobolev spaces of low regularity. Secondly, we establish asymptotic stability of the stratified density, which is strictly decreasing in the vertical direction, under sufficiently regular perturbations, proving that the solution converges to the unique minimizer of the total energy. Our analysis is based on the energy method. Although the total energy dissipates due to kinematic viscosity, such mechanism cannot capture the stratification of the density. We overcome this difficulty by discovering another Lyapunov functional which exhibits the density stratification in a quantitative manner."}
{"main_page": "https://arxiv.org/abs/2404.01005", "pdf": "https://arxiv.org/pdf/2404.01005", "title": "Solitary wave solutions of the delayed KP-BBM equation", "authors": "Yonghui Xia, Hang Zheng, Haojie Zhang", "subjects": "Analysis of PDEs (math.AP); Classical Analysis and ODEs (math.CA)", "abstract": "In this paper, we consider a kind of shallow water wave model called the Kadomtsev-Petviashvili-Benjamin-Bona-Mahony (KP-BBM) equation. We firstly consider the unperturbed KP-BBM equation. Then by using the geometric singular perturbation (GSP) theory, especially the invariant manifold theory, method of dynamical system and Melnikov function, the existence of solitary wave solutions of perturbed KP-BBM equation is proved. In other words, we dissuss the equation under different nonlinear terms. Finally, we validate our results with numerical simulations."}
{"main_page": "https://arxiv.org/abs/2404.01040", "pdf": "https://arxiv.org/pdf/2404.01040", "title": "Monge-Ampère equations with right-hand sides of polynomial growth", "authors": "Beomjun Choi, Kyeongsu Choi, Soojung Kim", "subjects": "Analysis of PDEs (math.AP); Differential Geometry (math.DG)", "abstract": "We study the regularity and the growth rates of solutions to two-dimensional Monge-Amp\\`ere equations with the right-hand side exhibiting polynomial growth. Utilizing this analysis, we demonstrate that the translators for the flow by sub-affine-critical powers of the Gauss curvature are smooth, strictly convex entire graphs. These graphs exhibit specific growth rates that depend solely on the power of the flow."}
{"main_page": "https://arxiv.org/abs/2404.01093", "pdf": "https://arxiv.org/pdf/2404.01093", "title": "Non-existence and multiplicity of positive solutions for Choquard  equations with critical combined nonlinearities", "authors": "Shiwang Ma", "subjects": "Analysis of PDEs (math.AP)", "abstract": "We study the non-existence and multiplicity of positive solutions of the nonlinear Choquard type equation $$ -\\Delta u+ \\varepsilon u=(I_\\alpha \\ast |u|^{p})|u|^{p-2}u+ |u|^{q-2}u, \\quad {\\rm in} \\ \\mathbb R^N, \\qquad (P_\\varepsilon)$$ where $N\\ge 3$ is an integer, $p\\in [\\frac{N+\\alpha}{N}, \\frac{N+\\alpha}{N-2}]$, $q\\in (2,\\frac{2N}{N-2}]$, $I_\\alpha$ is the Riesz potential of order $\\alpha\\in (0,N)$ and $\\varepsilon>0$ is a parameter. We fix one of $p,q$ as a critical exponent (in the sense of Hardy-Littlewood-Sobolev and Sobolev inequalities ) and view the others in $p,q,\\varepsilon, \\alpha$ as parameters, we find regions in the $(p,q,\\alpha, \\varepsilon)$-parameter space, such that the corresponding equation has no positive ground state or admits multiple positive solutions. This is a counterpart of the Brezis-Nirenberg Conjecture (Brezis-Nirenberg, CPAM, 1983) for nonlocal elliptic equation in the whole space. Particularly, some threshold results for the existence of ground states and some conditions which insure two positive solutions are obtained. These results are quite different in nature from the corresponding local equation with combined powers nonlinearity and reveal the special influence of the nonlocal term. To the best of our knowledge, the only two papers concerning the multiplicity of positive solutions of elliptic equations with critical growth nonlinearity are given by Atkinson, Peletier (Nonlinear Anal, 1986) for elliptic equation on a ball and Juncheng Wei, Yuanze Wu (Proc. Royal Soc. Edinburgh, 2022) for elliptic equation with a combined powers nonlinearity in the whole space. The ODE technique is main ingredient in the proofs of the above mentioned papers, however, ODE technique does not work any more in our model equation due to the presence of the nonlocal term."}
{"main_page": "https://arxiv.org/abs/2404.01185", "pdf": "https://arxiv.org/pdf/2404.01185", "title": "Symmetry of Convex Solutions to Fully Nonlinear Elliptic Systems:  Unbounded Domains", "authors": "Weijun Zhang, Zhitao Zhang", "subjects": "Analysis of PDEs (math.AP); Functional Analysis (math.FA)", "abstract": "In this paper, we are concerned with the monotonic and symmetric properties of convex solutions Monge-Amp\\`ere systems for instance, considering \\begin{equation*} \\det(D^2u^i)=f^i(x,{\\bf u},\\nabla u^i), \\ 1\\leq i\\leq m, \\end{equation*} over unbounded domains of various cases, including the whole spaces $\\mathbb{R}^n$, the half spaces $\\mathbb{R}^n_+$ and the unbounded tube shape domains in $\\mathbb{R}^n$. We obtain monotonic and symmetric properties of the solutions to the problem with respect to the geometry of domains and the monotonic and symmetric properties of right-hand side terms. The proof is based on carefully using the moving plane method together with various maximum principles and Hopf's lemmas."}
{"main_page": "https://arxiv.org/abs/2404.01213", "pdf": "https://arxiv.org/pdf/2404.01213", "title": "Bifurcation on Fully Nonlinear Elliptic Equations and Systems", "authors": "Jing Gao, Weijun Zhang, Zhitao Zhang", "subjects": "Analysis of PDEs (math.AP); Functional Analysis (math.FA)", "abstract": "In this paper, we study the following fully nonlinear elliptic equations \\begin{equation*} \\left\\{\\begin{array}{rl} \\left(S_{k}(D^{2}u)\\right)^{\\frac1k}=\\lambda f(-u) & in\\quad\\Omega \\\\ u=0 & on\\quad \\partial\\Omega\\\\ \\end{array} \\right. \\end{equation*} and coupled systems \\begin{equation*} \\left\\{\\begin{array}{rl} (S_{k}(D^{2}u))^\\frac1k=\\lambda g(-u,-v) & in\\quad\\Omega \\\\ (S_{k}(D^{2}v))^\\frac1k=\\lambda h(-u,-v) & in\\quad\\Omega \\\\ u=v=0 & on\\quad \\partial\\Omega\\\\ \\end{array} \\right. \\end{equation*} dominated by $k$-Hessian operators, where $\\Omega$ is a $(k$-$1)$-convex bounded domain in $\\mathbb{R}^{N}$, $\\lambda$ is a non-negative parameter, $f:\\left[0,+\\infty\\right)\\rightarrow\\left[0,+\\infty\\right)$ is a continuous function with zeros only at $0$ and $g,h:\\left[0,+\\infty\\right)\\times \\left[0,+\\infty\\right)\\rightarrow \\left[0,+\\infty\\right)$ are continuous functions with zeros only at $(\\cdot,0)$ and $(0,\\cdot)$. We determine the interval of $\\lambda$ about the existence, non-existence, uniqueness and multiplicity of $k$-convex solutions to the above problems according to various cases of $f,g,h$, which is a complete supplement to the known results in previous literature. In particular, the above results are also new for Laplacian and Monge-Amp\\`ere operators. We mainly use bifurcation theory, a-priori estimates, various maximum principles and technical strategies in the proof."}
