{"main_page": "https://arxiv.org/abs/2404.00240", "pdf": "https://arxiv.org/pdf/2404.00240", "title": "Collapse in Noncommutative Geometry and Spectral Continuity", "authors": "Carla Farsi, Frederic Latremoliere", "subjects": "Operator Algebras (math.OA)", "abstract": "If two compact quantum metric spaces are close in the metric sense, then how similar are they, as noncommutative spaces? In the classical realm of Riemannian geometry, informally, if two manifolds are close in the Gromov-Hausdorff distance, and belong to a class of manifolds with bounded curvature and diameter, then the spectra of their Laplacian or Dirac operators are also close under many scenari. Of particular interest is the case where a sequence of manifolds converge for the Gromov-Hausdorff distance to a manifold of lower dimension, and the question of the continuity, in some sense, of the spectra of geometrically relevant operators. In this paper, we initiate the study of the continuity of spectra and other properties of metric spectral triples under collapse in the noncommutative realm. As a first step in this study, we work with collapse for the spectral propinquity, an analogue of the Gromov-Hausdorff distance for spectral triples introduced by the second author, i.e. a form of metric for differential structures. Inspired by results from collapse in Riemannian geometry, we begin with the study of spectral triples which decompose, in some sense, in a vertical and a horizontal direction, and we collapse these spectral triples along the vertical direction. We obtain convergence results, and by the work of the second author, we conclude continuity results for the spectra of the Dirac operators of these spectral triples. Examples include collapse of product of spectral triples with one Abelian factor, $U(1)$ principal bundles over Riemannian spin manifolds, and noncommutative principal bundles, including C*-crossed-products and other noncommutative bundles."}
{"main_page": "https://arxiv.org/abs/2404.00259", "pdf": "https://arxiv.org/pdf/2404.00259", "title": "Diagonality modulo symmetric spaces in semifinite von Neumann algebras", "authors": "Aleksey Ber, Fedor Sukochev, Dmitriy Zanin, Hongyin Zhao", "subjects": "Operator Algebras (math.OA)", "abstract": "In the study on the diagonality of an $n$-tuple $\\alpha=(\\alpha(j))_{j=1}^n$ of commuting self-adjoint operators modulo a given $n$-tuple $\\Phi=(\\mathcal{J}_1,\\ldots,\\mathcal{J}_n)$ of normed ideals in $B(H)$, Voiculescu introduced the notion of quasicentral modulus $k_{\\Phi}(\\alpha)$ and proved that $\\alpha$ is diagonal modulo $(\\mathcal{J}_1,\\ldots,\\mathcal{J}_n)$ if and only if $k_{\\Phi}(\\alpha)=0.$ We prove that the same assertion holds true when $B(H)$ is replaced with a $\\sigma$-finite semifinite von Neumann algebra $\\mathcal{M}$, and $\\mathcal{J}_1,\\ldots,\\mathcal{J}_n$ are replaced with symmetric spaces $E_1(\\mathcal{M}),\\ldots,E_n(\\mathcal{M})$ associated with $\\mathcal{M}.$"}
