{"main_page": "https://arxiv.org/abs/2404.00175", "pdf": "https://arxiv.org/pdf/2404.00175", "title": "Compact moduli of marked noncommutative cubic surfaces", "authors": "Tarig Abdelgadir, Shinnosuke Okawa, Kazushi Ueda", "subjects": "Algebraic Geometry (math.AG)", "abstract": "We introduce a compact moduli scheme of marked noncommutative cubic surfaces as the GIT moduli scheme of relations of a quiver associated with a full strong exceptional collection on a cubic surface. It is a toric variety containing the configuration space of six points on a plane in general position as a locally closed subvariety, and birationally parametrizes a class of AS-regular $\\mathbb{Z}$-algebras."}
{"main_page": "https://arxiv.org/abs/2404.00316", "pdf": "https://arxiv.org/pdf/2404.00316", "title": "Computing a Saito basis from a standard basis", "authors": "Felipe Cano, Nuria Corral, David Senovilla-Sanz", "subjects": "Algebraic Geometry (math.AG)", "abstract": "In this paper we describe how to compute a Saito basis of a cusp, a plane curve with only one Puiseux pair. Moreover, the 1-forms of the Saito basis that we compute are characterized in terms of their divisorial orders associated to the \"cuspidal\" divisor of the minimal reduction of singularities of the cusp. We also introduce a new family of analytic invariants for plane curves computed in terms of Saito bases."}
{"main_page": "https://arxiv.org/abs/2404.00652", "pdf": "https://arxiv.org/pdf/2404.00652", "title": "Principal polarizations on products of abelian varieties over finite  fields", "authors": "Sergey Rybakov", "subjects": "Algebraic Geometry (math.AG)", "abstract": "We refine and generalize the results of K. E. Lauter and E. W. Howe on principal polarizations on products of abelian varieties over finite fields. Firstly, we study the reasons for the absence of an irreducible principal polarization in the isogeny class of the product of an ordinary and a supersingular abelian varieties. Secondly, we provide a necessary condition for the existence of a principal polarization on an abelian variety in the isogeny class of the product of a geometrically simple abelian surface and an elliptic curve. As an application we get that this abelian threefold or its quadratic twist is a Jacobian."}
{"main_page": "https://arxiv.org/abs/2404.00839", "pdf": "https://arxiv.org/pdf/2404.00839", "title": "The (Co)homology of the Deligne-Mumford Moduli Spaces of Marked Rational  Curves", "authors": "Aleksey Zinger", "subjects": "Algebraic Geometry (math.AG); High Energy Physics - Theory (hep-th); Algebraic Topology (math.AT); Quantum Algebra (math.QA)", "abstract": "This informal note collects key results and open problems on the (co)homology of the Deligne-Mumford moduli spaces of real marked rational curves. The open problems are both of topological nature, aiming to investigate the (co)homology of these spaces further, and of algebraic nature, aiming to describe the structure of the homology of these spaces in operad-like terms."}
{"main_page": "https://arxiv.org/abs/2404.00945", "pdf": "https://arxiv.org/pdf/2404.00945", "title": "Generalized Kummer surfaces over finite fields", "authors": "Sergey Rybakov", "subjects": "Algebraic Geometry (math.AG)", "abstract": "In this paper we prove a refinement of the Katsura theorem on finite groups acting on abelian surfaces such that the quotient is birational to a $K3$ surface. As an application we extend our results on zeta functions of Kummer surfaces to supersingular generalized Kummer surfaces over finite fields of odd degree."}
{"main_page": "https://arxiv.org/abs/2404.00993", "pdf": "https://arxiv.org/pdf/2404.00993", "title": "Space of initial conditions for the four-dimensional Garnier system  revisited", "authors": "Tomoyuki Takenawa", "subjects": "Algebraic Geometry (math.AG); Dynamical Systems (math.DS)", "abstract": "A geometric study is given for the 4-dimensional Garnier system. By the resolution of indeterminacy, the group of its B\\\"aklund transformations is lifted to a group of pseudo-isomorphisms between rational varieties obtained from ${\\mathbb P}^2 \\times {\\mathbb P}^2$ by 10 or 21 blow-ups. The root basis is discussed in the N\\'eron-Severi bilattices for the space with 10 blow-ups."}
{"main_page": "https://arxiv.org/abs/2404.01087", "pdf": "https://arxiv.org/pdf/2404.01087", "title": "$\\mathbb{A}^1$-homotopy type of $\\mathbb{A}^2 \\setminus \\left\\{(0,0)  \\right\\}$", "authors": "Utsav Choudhury, Biman Roy", "subjects": "Algebraic Geometry (math.AG)", "abstract": "In this article we prove that any $\\mathbb{A}^1$-connected smooth $k$-variety is $\\mathbb{A}^1$-uniruled for any algebraically closed field $k$. We establish that if a non empty open subscheme $X$ of a smooth affine $k$-scheme is $\\mathbb{A}^1$-weakly equivalent to $\\mathbb{A}^2_{k} \\setminus \\left\\{(0,0) \\right\\}$, then $X \\cong \\mathbb{A}^2_{k} \\setminus \\left\\{(0,0) \\right\\}$ as $k$-varieties for any field $k$ of characteristic $0$."}
{"main_page": "https://arxiv.org/abs/2404.01132", "pdf": "https://arxiv.org/pdf/2404.01132", "title": "A new approach to flatness in categories of sheaves", "authors": "Driss Bennis, Soumia Mamdouhi", "subjects": "Algebraic Geometry (math.AG); Category Theory (math.CT)", "abstract": "Recently, many authors have embraced the study of certain properties of modules such as projectivity, injectivity and flatness from an alternative point of view. This way, Durgun has introduced absolutely pure domains of modules as a mean to gauge the extent of the flatness of any given module (so not just to determine whether or not the module is flat). In this paper, we develop a new treatment of the goemetric flatness in categories of sheaves which shed more light on some of its various important aspects. Namely, in terms of this new approach, some classical schemes are characterized, some new results are established and also known ones are generalized."}
{"main_page": "https://arxiv.org/abs/2404.01178", "pdf": "https://arxiv.org/pdf/2404.01178", "title": "Projective contact log varieties", "authors": "Adrian Langer", "subjects": "Algebraic Geometry (math.AG); Symplectic Geometry (math.SG)", "abstract": "We study contact structures on smooth complex projective varieties with a simple normal crossing divisor, generalizing some well-known results concerning the non-logarithmic case. In particular, we describe the structure of elementary log contractions of such log varieties and we construct the corresponding contact structures."}
{"main_page": "https://arxiv.org/abs/2404.01180", "pdf": "https://arxiv.org/pdf/2404.01180", "title": "On the fundamental group of a spherical variety", "authors": "Friedrich Knop", "subjects": "Algebraic Geometry (math.AG); Representation Theory (math.RT)", "abstract": "Let $X=G/H$ be a spherical variety over an algebraically closed field of characteristic $p\\ge0$. We compute the $p'$-parts of $\\pi_0(H)$ and $\\pi_1(X)$ from the spherical system of $X$."}
