{"main_page": "https://arxiv.org/abs/2404.00101", "pdf": "https://arxiv.org/pdf/2404.00101", "title": "Quandle Action Quivers", "authors": "Mason Cai, Sam Nelson", "subjects": "Geometric Topology (math.GT); Quantum Algebra (math.QA)", "abstract": "Quandle Coloring Quivers are directed graph-valued invariants of classical and virtual knots and links associated to finite quandles. Quandle action quivers are subquivers of the full quandle coloring quiver associated to quandle actions by elements of the coloring quandle. These quivers provide a categorification of the quandle counting invariant associated to each element of the quandle. We obtain new polynomial invariants called quandle action polynomials from these quivers as decategorifications."}
{"main_page": "https://arxiv.org/abs/2404.00336", "pdf": "https://arxiv.org/pdf/2404.00336", "title": "The extremal length systole of the cube punctured at its vertices", "authors": "Samuel Dobchies, Maxime Fortier Bourque", "subjects": "Geometric Topology (math.GT); Complex Variables (math.CV)", "abstract": "We prove that the extremal length systole of the cube punctured at its vertices is realized by the 12 curves surrounding its edges and give a characterization of the corresponding quadratic differentials, allowing us to estimate its value to high precision. The proof uses a mixture of exact calculations done using branched covers and elliptic integrals, together with estimates obtained using either the geometry of geodesic trajectories on the cube or explicit conformal maps."}
{"main_page": "https://arxiv.org/abs/2404.00372", "pdf": "https://arxiv.org/pdf/2404.00372", "title": "Non-ergodicity on the SU(2)-character varieties", "authors": "Fayssal Saadi", "subjects": "Geometric Topology (math.GT)", "abstract": "We describe the dynamics of a group $\\Gamma$ generated by Dehn twists along two filling multi-curves or a family of filling curves on the SU(2)-representation variety of closed surfaces. Consequently, we provide explicit $\\Gamma$-invariant rational functions on the representation variety of the genus two closed surface $S_2$ for some pair of multi-curves. We establish a similar result for the SU(2)-character variety of genus four non-orientable surfaces $N_4$ for some family of filling curves."}
{"main_page": "https://arxiv.org/abs/2404.00436", "pdf": "https://arxiv.org/pdf/2404.00436", "title": "Non-triviality of welded knots and ribbon torus-knots", "authors": "Tumpa Mahato, Rama Mishra, Sahil Joshi", "subjects": "Geometric Topology (math.GT)", "abstract": "In this paper we study welded knots and their invariants. We focus on generating examples of non-trivial knotted ribbon tori as the tube of welded knots that are obtained from classical knot diagrams by welding some of the crossings. Non-triviality is shown by determining the fundamental group of the concerned welded knot. Sample examples under consideration are the standard diagrams of the family of $(2,q)$ torus knots and the twist knots. Standard diagrams of knots from Rolfsen's tables with $6$ crossings are also discussed which are not in the family of torus and twist knots."}
{"main_page": "https://arxiv.org/abs/2404.00490", "pdf": "https://arxiv.org/pdf/2404.00490", "title": "Is the geography of Heegaard Floer homology restricted or the $L$-space  conjecture false?", "authors": "Antonio Alfieri, Fraser Binns", "subjects": "Geometric Topology (math.GT)", "abstract": "In a recent note F. Lin showed that if a rational homology sphere $Y$ admits a taut foliation then the Heegaard Floer module $HF^-(Y)$ contains a copy of $\\mathbf{F}[U]/U$ as a summand (arXiv:2309.01222). This implies that either the $L$-space conjecture is false or that Heegaard Floer homology satisfies a geography restriction. We verify that Lin's geography restriction holds for a wide class of rational homology spheres. Indeed, we show that the Heegaard Floer module $HF^-(Y)$ may satisfy a stronger geography restriction."}
