{"main_page": "https://arxiv.org/abs/2404.00052", "pdf": "https://arxiv.org/pdf/2404.00052", "title": "PainleveBacklundCheck: A Sympy-powered Kivy app for the Painlevé  property of nonlinear dispersive PDEs and auto-Bäcklund transformations", "authors": "Shrohan Mohapatra, P.G. Kevrekidis, Stephane Lafortune", "subjects": "Exactly Solvable and Integrable Systems (nlin.SI); Pattern Formation and Solitons (nlin.PS)", "abstract": "In the present work we revisit the Painlev\\'e property for partial differential equations. We consider the PDE variant of the relevant algorithm on the basis of the fundamental work of Weiss, Tabor and Carnevale and explore a number of relevant examples. Subsequently, we present an implementation of the relevant algorithm in an open-source platform in Python and discuss the details of a Sympy-powered Kivy app that enables checking of the property and the derivation of associated auto-B{\\\"a}ck{u}nd transform when the property is present. Examples of the relevant code and its implementation are also provided, as well as details of its open access for interested potential users."}
{"main_page": "https://arxiv.org/abs/2404.00148", "pdf": "https://arxiv.org/pdf/2404.00148", "title": "Measurement of nonequilibrium vortex propagation dynamics in a nonlinear  medium", "authors": "Patrick C. Ford, Andrew A. Voitiv, Chuanzhou Zhu, Mark T. Lusk, Mark E. Siemens", "subjects": "Optics (physics.optics); Other Condensed Matter (cond-mat.other); Pattern Formation and Solitons (nlin.PS); Fluid Dynamics (physics.flu-dyn)", "abstract": "We observe and measure the nonequilibrium dynamics of optical vortices as a function of propagation distance through a nonlinear medium. The precession of a tilted-core vortex is quantified as is vortex-core sharpening, where the infinite width of a linear core subsequently shrinks and approaches the healing length of this nonlinear optical fluid. Experiments are performed with a variable-length nonlinear medium: a nonlinear fluid in a tank with an output window on a translating tube. This provides control over the distance the light propagates in the fluid and allows for the measurement of the dynamics throughout the entire propagation range. Results are compared to the predictions of a computational simulator to find the equivalent dimensionless nonlinear coefficient."}
{"main_page": "https://arxiv.org/abs/2404.00991", "pdf": "https://arxiv.org/pdf/2404.00991", "title": "Optical solitons in multimode fibers: recent advances", "authors": "Mario Zitelli", "subjects": "Optics (physics.optics); Pattern Formation and Solitons (nlin.PS)", "abstract": "Optical solitons in multimode fibers have been predicted 40 years ago and extensively investigated theoretically. Transmission experiments in nonlinear multimode fibers have gained renewed interest, motivated by their potential to extend the capacity of long-distance transmission systems; only in the last few years, new experiments have revealed unexpected properties of optical solitons propagating in graded-index and step-index multimode fibers, partially re-writing the existing theory. Here we provide an overview of the recent experimental, numerical and theoretical studies which revealed those new properties. It will be shown that multimode fiber solitons form with specific pulse width and energy dependent on the wavelength, and that they naturally evolve toward fundamental-mode Raman solitons. New soliton fission mechanisms, governed by the modal dispersion, will be explained. Possible applications in space-division multiplexed systems will be discussed. A recent thermodynamic approach to soliton condensation will be described."}
{"main_page": "https://arxiv.org/abs/2404.01028", "pdf": "https://arxiv.org/pdf/2404.01028", "title": "The energy-frequency diagram of the (1+1)-dimensional $Φ^4$ oscillon", "authors": "N. V. Alexeeva, I. V. Barashenkov, Alain Dika, Raphael De Sousa", "subjects": "High Energy Physics - Theory (hep-th); Pattern Formation and Solitons (nlin.PS)", "abstract": "Two different methods are used to study the existence and stability of the (1+1)-dimensional $\\Phi^4$ oscillon. The variational technique approximates it by a periodic function with a set of adiabatically changing parameters. An alternative approach treats oscillons as standing waves in a finite-size box; these are sought as solutions of a boundary-value problem on a two-dimensional domain. The numerical analysis reveals that the standing wave's energy-frequency diagram is fragmented into disjoint segments with $\\omega_{n-1} < \\omega < \\omega_{n-2}$, where $\\omega_n=\\frac{2}{n+1}$. In the interval $(\\omega_{n-1}, \\omega_{n-2})$, the structure's small-amplitude wings are formed by the $n$-th harmonic radiation ($n=2,3, ...$). All standing waves are practically stable: perturbations may result in the deformation of the wave's radiation wings but do not affect its core. The variational approximation involving the first, zeroth and second harmonic components provides an accurate description of the oscillon with the frequency in $(\\omega_1, \\omega_0)$, but breaks down as $\\omega$ falls out of that interval."}
