{"main_page": "https://arxiv.org/abs/2404.00052", "pdf": "https://arxiv.org/pdf/2404.00052", "title": "PainleveBacklundCheck: A Sympy-powered Kivy app for the Painlevé  property of nonlinear dispersive PDEs and auto-Bäcklund transformations", "authors": "Shrohan Mohapatra, P.G. Kevrekidis, Stephane Lafortune", "subjects": "Exactly Solvable and Integrable Systems (nlin.SI); Pattern Formation and Solitons (nlin.PS)", "abstract": "In the present work we revisit the Painlev\\'e property for partial differential equations. We consider the PDE variant of the relevant algorithm on the basis of the fundamental work of Weiss, Tabor and Carnevale and explore a number of relevant examples. Subsequently, we present an implementation of the relevant algorithm in an open-source platform in Python and discuss the details of a Sympy-powered Kivy app that enables checking of the property and the derivation of associated auto-B{\\\"a}ck{u}nd transform when the property is present. Examples of the relevant code and its implementation are also provided, as well as details of its open access for interested potential users."}
{"main_page": "https://arxiv.org/abs/2404.00671", "pdf": "https://arxiv.org/pdf/2404.00671", "title": "On SK and KK Integrable Systems", "authors": "Metin Gürses, Aslı Pekcan", "subjects": "Exactly Solvable and Integrable Systems (nlin.SI)", "abstract": "To obtain new integrable nonlinear differential equations there are some well-known methods such as Lax equations with different Lax representations. There are also some other methods which are based on integrable scalar nonlinear partial differential equations. We show that some systems of integrable equations published recently are the ${\\cal M}_{2}$-extension of integrable scalar equations. For illustration we give Korteweg-de Vries, Kaup-Kupershmidt, and Sawada-Kotera equations as examples. By the use of such an extension of integrable scalar equations we obtain some new integrable systems with recursion operators. We give also the soliton solutions of the system equations and integrable standard nonlocal and shifted nonlocal reductions of these systems."}
{"main_page": "https://arxiv.org/abs/2404.00721", "pdf": "https://arxiv.org/pdf/2404.00721", "title": "Designing robust trajectories by lobe dynamics in low-dimensional  Hamiltonian systems", "authors": "Naoki Hiraiwa, Mai Bando, Isaia Nisoli, Yuzuru Sato", "subjects": "Chaotic Dynamics (nlin.CD); Dynamical Systems (math.DS); Optimization and Control (math.OC); Classical Physics (physics.class-ph)", "abstract": "Modern space missions with uncrewed spacecraft require robust trajectory design to connect multiple chaotic orbits by small controls. To address this issue, we propose a novel control scheme to design robust trajectories by leveraging a geometrical structure in chaotic zones, known as {\\it lobe}. Our scheme shows that appropriately selected lobes reveal possible paths to traverse chaotic zones in a short time. The effectiveness of our method is demonstrated through trajectory design in both the standard map and Hill's equation."}
{"main_page": "https://arxiv.org/abs/2404.00977", "pdf": "https://arxiv.org/pdf/2404.00977", "title": "Nonlinear Impulse Pattern Formulation dynamical social and political  prediction algorithm for city planning and public participation", "authors": "Rolf Bader, Simon Linke, Stefanie Gernert", "subjects": "Adaptation and Self-Organizing Systems (nlin.AO); Artificial Intelligence (cs.AI); Dynamical Systems (math.DS)", "abstract": "A nonlinear-dynamical algorithm for city planning is proposed as an Impulse Pattern Formulation (IPF) for predicting relevant parameters like health, artistic freedom, or financial developments of different social or political stakeholders over the cause of a planning process. The IPF has already shown high predictive precision at low computational cost in musical instrument simulations, brain dynamics, and human-human interactions. The social and political IPF consists of three basic equations of system state developments, self-adaptation of stakeholders, two adaptive interactions, and external impact terms suitable for respective planning situations. Typical scenarios of stakeholder interactions and developments are modeled by adjusting a set of system parameters. These include stakeholder reaction to external input, enhanced system stability through self-adaptation, stakeholder convergence due to mediative interaction adaptation, as well as complex dynamics in terms of direct stakeholder impacts. A workflow for implementing the algorithm in real city planning scenarios is outlined. This workflow includes machine learning of a suitable set of parameters suggesting best-practice planning to aim at the desired development of the planning process and its output."}
{"main_page": "https://arxiv.org/abs/2404.01215", "pdf": "https://arxiv.org/pdf/2404.01215", "title": "Miura transformations and large-time behaviors of the Hirota-Satsuma  equation", "authors": "Deng-Shan Wang, Cheng Zhu, Xiaodong Zhu", "subjects": "Exactly Solvable and Integrable Systems (nlin.SI)", "abstract": "The good Boussinesq equation has several modified versions such as the modified Boussinesq equation, Mikhailov-Lenells equation and Hirota-Satsuma equation. This work builds the full relations among these equations by Miura transformation and invertible linear transformations and draws a pyramid diagram to demonstrate such relations. The direct and inverse spectral analysis shows that the solution of Riemann-Hilbert problem for Hirota-Satsuma equation has simple pole at origin, the solution of Riemann-Hilbert problem for the good Boussinesq equation has double pole at origin, while the solution of Riemann-Hilbert problem for the modified Boussinesq equation and Mikhailov-Lenells equation doesn't have singularity at origin. Further, the large-time asymptotic behaviors of the Hirota-Satsuma equation with Schwartz class initial value is studied by Deift-Zhou nonlinear steepest descent analysis. In such initial condition, the asymptotic expressions of the Hirota-Satsuma equation and good Boussinesq equation away from the origin are proposed and it is displayed that the leading term of asymptotic formulas match well with direct numerical simulations."}
