{"main_page": "https://arxiv.org/abs/2404.00682", "pdf": "https://arxiv.org/pdf/2404.00682", "title": "A new approach for deducing rms proton radii from charge-changing  reactions of neutron-rich nuclei and the reaction-target dependence", "authors": "J.-C. Zhang, B.-H. Sun, I. Tanihata, R. Kanungo, C. Scheidenberger, S. Terashima, Feng Wang, F. Ameil, J. Atkinson, Y. Ayyad, S. Bagchi, D. Cortina-Gil, I. Dillmann, A. Estrade, A. Evdokimov, F. Farinon, H. Geissel, G. Guastalla, R. Janik, S. Kaur, R. Knobel, J. Kurcewicz, Yu. A. Litvinov, M. Marta, M. Mostazo, I. Mukha, C. Nociforo, H. J. Ong, S. Pietri, A. Prochazka, B. Sitar, P. Strmen, M. Takechi, J. Tanaka, J. Vargas, H. Weick, J. S. Winfield, the Super-FRS Experiment Collaboration", "subjects": "Nuclear Experiment (nucl-ex); Nuclear Theory (nucl-th)", "abstract": "We report the charge-changing cross sections ($\\sigma_{\\text{cc}}$) of 24 $p$-shell nuclides on both hydrogen and carbon at about 900$A$ MeV, of which $^{8,9}$Li, $^{10\\textendash12}$Be, $^{10,14,15}$B, $^{14,15,17\\textendash22}$N and $^{16}$O on hydrogen and $^{8,9}$Li on carbon are for the first time. Benefiting from the data set,we found a new and robust relationship between the scaling factor of the Glauber model calculations and the separation energies of the nuclei of interest on both targets.This allows us to deduce proton radii ($R_p$) for the first time from the cross sections on hydrogen. Nearly identical $R_p$ values are deduced from both target data for the neutron-rich carbon isotopes, however, the $R_p$ from the hydrogen target is systematically smaller in the neutron-rich nitrogen isotopes.This calls for further experimental and theoretical investigations."}
{"main_page": "https://arxiv.org/abs/2404.01271", "pdf": "https://arxiv.org/pdf/2404.01271", "title": "Energy, strength, and alpha width measurements of $E_{\\rm{c.m.}} = 1323$  and $1487$ keV resonances in $^{15}$N($α,γ$)$^{19}$F", "authors": "R. Fang, J. Görres, R. J. deBoer, S. Moylan, A. Sanchez, T. L. Bailey, S. Carmichael, J. Koros, K. Lee, K. Manukyan, M. Matney, J. P. McDonaugh, D. Robertson, J. Rufino, E. Stech, M. Couder", "subjects": "Nuclear Experiment (nucl-ex)", "abstract": "The $^{15}$N($\\alpha,\\gamma$)$^{19}$F reaction produces $^{19}$F in asymptotic giant branch (AGB) stars, where the low energy tails of two resonances at $E_{\\rm{c.m.}} = 1323 \\pm 2$ and $1487 \\pm 1.7$ keV are estimated to contribute about $30\\%$ of the total reaction rate in these environments. However, recent measurements have shown discrepancies in the energies, the strengths, and the corresponding alpha widths of these two resonances, resulting in an increase in the systematic uncertainty of the extrapolated cross section to helium burning energies. With this motivation, we have undertaken new measurements of the $^{15}$N$(\\alpha,\\gamma)^{19}$F at the University of Notre Dame Nuclear Science Laboratory. The setup consisted of an alpha particle beam impinged on a solid Ti$^{15}$N target with gamma-ray spectroscopy accomplished using a high purity germanium detector. Using the Doppler corrected gamma-ray energies, we confirmed the lower resonance energy to be $1321.6 \\pm 0.6$ keV and found a value for the higher one of $1479.4 \\pm 0.6$ keV that is more consistent with those found from previous elastic scattering studies. We found that the resonance strengths for both were consistent with most values found in the literature, but a larger alpha width has been recommended for the $E_{\\rm{c.m.}} = 1487$ keV resonance. The larger alpha width suggests a reaction rate increase of about $15\\%$ at temperatures $T < 0.1$ GK relevant to low mass AGB stars. The impact of the increased reaction rate requires further investigations."}
