{"main_page": "https://arxiv.org/abs/2404.00331", "pdf": "https://arxiv.org/pdf/2404.00331", "title": "Investigation of self-focusing of Gaussian laser beams within magnetized  plasma via source-dependent expansion method", "authors": "A. A. Molavi Choobini, S. S. Ghaffari-Oskooei", "subjects": "Plasma Physics (physics.plasm-ph)", "abstract": "Self-focusing emerges as a nonlinear optical phenomenon resulting from an intense laser field and plasma interaction. This study investigates the self-focusing behavior of Gaussian laser beams within magnetized plasma environments utilizing a novel approach, source-dependent expansion. By employing source-dependent expansion, we explore the intricate dynamics of laser beam propagation, considering the influence of plasma density and external magnetic fields. The interplay between the beam's Gaussian profile and the self-focusing mechanism through rigorous mathematical analysis and numerical simulations, particularly in the presence of plasma-induced nonlinearities are elucidated here. Our findings reveal crucial insights into the evolution of laser beams under diverse parameters, the ponderomotive force, relativistic factors, plasma frequency, polarization states, external magnetic field, wavelength, and laser intensity. This research not only contributes to advancing our fundamental understanding of laser-plasma interactions but also holds promise for optimizing laser-driven applications."}
{"main_page": "https://arxiv.org/abs/2404.00467", "pdf": "https://arxiv.org/pdf/2404.00467", "title": "Characterization of uncertainties in electron-argon collision cross  sections under statistical principles", "authors": "Seung Whan Chung, Todd A. Oliver, Laxminarayan L. Raja, Robert D. Moser", "subjects": "Plasma Physics (physics.plasm-ph); Data Analysis, Statistics and Probability (physics.data-an)", "abstract": "The predictive capability of a plasma discharge model depends on accurate representations of electron-impact collision cross sections, which determine the key reaction rates and transport properties of the plasma. Although many cross sections have been identified through experiments and quantum mechanical simulations, their uncertainties are not well-investigated. We characterize the uncertainties in electron-argon collision cross sections using a Bayesian framework. Six collision processes -- elastic momentum transfer, ionization, and four excitations -- are characterized with semi-empirical models, whose parametric uncertainties effectively capture the features important to the macroscopic properties of the plasma, namely transport properties and chemical reaction rates. The method is designed to capture the effects of systematic errors that lead to large discrepancies between some data sets. Specifically, for the purposes of Bayesian inference, each of the parametric cross section models is augmented with a Gaussian process representing systematic measurement errors as well as model inadequacies in the parametric form. The results show that the method is able to capture scatter in the data between the electron-beam experiments and ab-initio quantum simulations. The calibrated cross section models are further validated against measurements from swarm-parameter experiments."}
{"main_page": "https://arxiv.org/abs/2404.01187", "pdf": "https://arxiv.org/pdf/2404.01187", "title": "Modeling the low-pressure high-voltage branch of the Paschen curve for  hydrogen and deuterium", "authors": "Alexander V. Khrabrov, David. J. Smith, Igor D. Kaganovich", "subjects": "Plasma Physics (physics.plasm-ph)", "abstract": "A physical and numerical model of the Townsend discharge in molecular hydrogen and deuterium has been developed to meet the needs of designing a plasma-based switching device for power grid application. The model allows to predict the low-pressure branch of the Paschen curve for applied voltage in the range of several hundred kiloVolts. In the regime of interest, electrons are in a runaway state and ionization by ions and fast neutrals sustains the discharge. It was essential to correctly account for both gas-phase and surface interactions (electron emission and electron back-scattering), especially in terms of their dependence on particle energy. The model yields results consistent with prior data obtained for lower voltage. The three-species (electrons, ions and fast neutrals) model successfully captures the essential physics of the process."}
