{"main_page": "https://arxiv.org/abs/2404.00014", "pdf": "https://arxiv.org/pdf/2404.00014", "title": "Deep Geometry Handling and Fragment-wise Molecular 3D Graph Generation", "authors": "Odin Zhang, Yufei Huang, Shichen Cheng, Mengyao Yu, Xujun Zhang, Haitao Lin, Yundian Zeng, Mingyang Wang, Zhenxing Wu, Huifeng Zhao, Zaixi Zhang, Chenqing Hua, Yu Kang, Sunliang Cui, Peichen Pan, Chang-Yu Hsieh, Tingjun Hou", "subjects": "Chemical Physics (physics.chem-ph); Artificial Intelligence (cs.AI); Biomolecules (q-bio.BM)", "abstract": "Most earlier 3D structure-based molecular generation approaches follow an atom-wise paradigm, incrementally adding atoms to a partially built molecular fragment within protein pockets. These methods, while effective in designing tightly bound ligands, often overlook other essential properties such as synthesizability. The fragment-wise generation paradigm offers a promising solution. However, a common challenge across both atom-wise and fragment-wise methods lies in their limited ability to co-design plausible chemical and geometrical structures, resulting in distorted conformations. In response to this challenge, we introduce the Deep Geometry Handling protocol, a more abstract design that extends the design focus beyond the model architecture. Through a comprehensive review of existing geometry-related models and their protocols, we propose a novel hybrid strategy, culminating in the development of FragGen - a geometry-reliable, fragment-wise molecular generation method. FragGen marks a significant leap forward in the quality of generated geometry and the synthesis accessibility of molecules. The efficacy of FragGen is further validated by its successful application in designing type II kinase inhibitors at the nanomolar level."}
{"main_page": "https://arxiv.org/abs/2404.00044", "pdf": "https://arxiv.org/pdf/2404.00044", "title": "UAlign: Pushing the Limit of Template-free Retrosynthesis Prediction  with Unsupervised SMILES Alignment", "authors": "Kaipeng Zeng, Xin Zhao, Yu Zhang, Fan Nie, Xiaokang Yang, Yaohui Jin, Yanyan Xu", "subjects": "Chemical Physics (physics.chem-ph); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)", "abstract": "Retrosynthesis planning poses a formidable challenge in the organic chemical industry, particularly in pharmaceuticals. Single-step retrosynthesis prediction, a crucial step in the planning process, has witnessed a surge in interest in recent years due to advancements in AI for science. Various deep learning-based methods have been proposed for this task in recent years, incorporating diverse levels of additional chemical knowledge dependency. This paper introduces UAlign, a template-free graph-to-sequence pipeline for retrosynthesis prediction. By combining graph neural networks and Transformers, our method can more effectively leverage the inherent graph structure of molecules. Based on the fact that the majority of molecule structures remain unchanged during a chemical reaction, we propose a simple yet effective SMILES alignment technique to facilitate the reuse of unchanged structures for reactant generation. Extensive experiments show that our method substantially outperforms state-of-the-art template-free and semi-template-based approaches. Importantly, Our template-free method achieves effectiveness comparable to, or even surpasses, established powerful template-based methods. Scientific contribution: We present a novel graph-to-sequence template-free retrosynthesis prediction pipeline that overcomes the limitations of Transformer-based methods in molecular representation learning and insufficient utilization of chemical information. We propose an unsupervised learning mechanism for establishing product-atom correspondence with reactant SMILES tokens, achieving even better results than supervised SMILES alignment methods. Extensive experiments demonstrate that UAlign significantly outperforms state-of-the-art template-free methods and rivals or surpasses template-based approaches, with up to 5\\% (top-5) and 5.4\\% (top-10) increased accuracy over the strongest baseline."}
{"main_page": "https://arxiv.org/abs/2404.00050", "pdf": "https://arxiv.org/pdf/2404.00050", "title": "Grappa -- A Machine Learned Molecular Mechanics Force Field", "authors": "Leif Seute, Eric Hartmann, Jan Stühmer, Frauke Gräter", "subjects": "Chemical Physics (physics.chem-ph); Machine Learning (cs.LG); Computational Physics (physics.comp-ph)", "abstract": "Simulating large molecular systems over long timescales requires force fields that are both accurate and efficient. In recent years, E(3) equivariant neural networks have lifted the tension between computational efficiency and accuracy of force fields, but they are still several orders of magnitude more expensive than classical molecular mechanics (MM) force fields. Here, we propose a novel machine learning architecture to predict MM parameters from the molecular graph, employing a graph attentional neural network and a transformer with symmetry-preserving positional encoding. The resulting force field, Grappa, outperforms established and other machine-learned MM force fields in terms of accuracy at the same computational efficiency and can be used in existing Molecular Dynamics (MD) engines like GROMACS and OpenMM. It predicts energies and forces of small molecules, peptides, RNA and - showcasing its extensibility to uncharted regions of chemical space - radicals at state-of-the-art MM accuracy. We demonstrate Grappa's transferability to macromolecules in MD simulations, during which large protein are kept stable and small proteins can fold. Our force field sets the stage for biomolecular simulations close to chemical accuracy, but with the same computational cost as established protein force fields."}
{"main_page": "https://arxiv.org/abs/2404.00096", "pdf": "https://arxiv.org/pdf/2404.00096", "title": "A theoretical study on the mechanisms of formation of primal carbon  clusters and nanoparticles in space", "authors": "Dobromir A. Kalchevski, Dimitar V. Trifonov, Stefan K. Kolev, Valentin N. Popov, Hristiyan A. Aleksandrov, Teodor I. Milenov", "subjects": "Chemical Physics (physics.chem-ph)", "abstract": "We present a computational study of assembling carbon clusters and nanophases in space from carbon aggregations. Geometry optimizations and Density-functional-based tight-binding (SCC-DFTB) dynamics methods are employed to predict carbon clusters, their time evolution, and their stability. The initial density of the aggregates is found to be of primary importance for the structural properties of the clusters. Aggregates with sufficiently low initial density yield clusters with approximately equal prevalence of sp and sp2 hybridized states and almost missing sp3 ones. The increase in the initial density results in sp2-dominant molecules that resemble the carbon skeleton of polycyclic aromatic hydrocarbons (PAHs). Larger initial aggregations with tetrahedral interatomic orientation result in sp2-dominant multi-dimensional polymers. Such materials are highly porous and resemble axially bound nanotubes. Some resultant clusters resemble fullerene building blocks. Spheroid nanoparticles resembling improper fullerenes are predicted by metadynamics, aimed at inter-fragment coupling reactions. One such structure has the lowest binding energy per atom among the studied molecules. All zero-dimensional forms, obtained by the simulations, conform to the experimentally detected types of molecules in space. The theoretical IR spectrum of the clusters closely resembles that of fullerene C70 and therefore such imperfect structures may be mistaken for known fullerenes in experimental infrared (IR) telescope studies."}
{"main_page": "https://arxiv.org/abs/2404.00167", "pdf": "https://arxiv.org/pdf/2404.00167", "title": "Electrical double layer and capacitance of TiO2 electrolyte interfaces  from first principles simulations", "authors": "Chunyi Zhang, Marcos Calegari Andrade, Zachary K. Goldsmith, Abhinav S. Raman, Yifan Li, Pablo Piaggi, Xifan Wu, Roberto Car, Annabella Selloni", "subjects": "Chemical Physics (physics.chem-ph)", "abstract": "The electrical double layer (EDL) at aqueous solution-metal oxide interfaces critically affects many fundamental processes in electrochemistry, geology and biology, yet understanding its microscopic structure is challenging for both theory and experiments. Here we employ ab initio-based machine learning potentials including long-range electrostatics in large-scale atomistic simulations of the EDL at the TiO2-electrolyte interface. Our simulations provide a molecular-scale picture of the EDL that demonstrates the limitations of standard mean-field models. We further develop a method to accurately calculate the electrostatic potential drop at the interface. The computed capacitance originating from the adsorbed charges and the potential drop agrees with experiments, supporting the reliability of our description of the EDL. The larger interfacial capacitance of basic relative to acidic solutions originates from the higher affinity of the cations for the oxide surface and gives rise to distinct charging mechanisms on negative and positive surfaces."}
{"main_page": "https://arxiv.org/abs/2404.00388", "pdf": "https://arxiv.org/pdf/2404.00388", "title": "Approximation of the electronic terms of diatomic molecules by the Morse  function. The role of anharmonicity. II. Simple terms", "authors": "G. S. Denisov, R. E. Asfin", "subjects": "Chemical Physics (physics.chem-ph)", "abstract": "This article continues the series of works by the authors on the approximation of the electronic terms of diatomic molecules by the Morse formula, which is the simplest anharmonic approximation of the real term U(r). Depending on the choice of parameters, the approximation has two alternative solutions M1(r) and M2(r), with different patterns of deviations from the real term and its vibrational structure. The difference {\\delta}(r)=U(r)-M(r) quantitatively shows the changes in the shape of the terms during approximation. We introduced an empirical anharmonicity function -2{\\omega}_e x(v), which characterizes the positions of vibrational levels in the potential well; it demonstrates the distortion of the vibrational structure of the term U(r) during the approximation. Based on the data from literature, the functions {\\delta}(r) and -2{\\omega}_e x(v) were constructed for more than 20 molecules. Here we present a group of simple terms with minimal deviations from the Morse shape."}
{"main_page": "https://arxiv.org/abs/2404.00787", "pdf": "https://arxiv.org/pdf/2404.00787", "title": "Effect of cathode porosity on the Lithium air cell oxygen reduction  reaction", "authors": "Jeongwook Seo, Shrihari Sankarasubramanian, Nikhilendra Singh, Fuminori Mizuno, Kensuke Takechi, Jai Prakash", "subjects": "Chemical Physics (physics.chem-ph); Materials Science (cond-mat.mtrl-sci)", "abstract": "The kinetics of the oxygen reduction reaction (ORR) on the practical air cathode in a Lithium air cell, which is conventionally composed of porous carbon with or without catalysts supported on it, was investigated. The mechanism and kinetics of the oxygen reduction reaction (ORR) was studied on a porous carbon electrode in an oxygen saturated solution of 0.1M Lithium bis-trifluoromethanesulfonimidate (LiTFSI) in Dimethoxyethane (DME) using cyclic voltammetery (CV) and the rotating ring-disk electrode (RRDE) technique. The oxygen reduction and evolution reactions were found to occur at similar potentials to those observed on a smooth, planar glassy carbon (GC) electrode. The effect of the porosity and the resultant increase in surface area were readily observed in the increase in the transient time required for the intermediates to reach the ring and the much larger disk currents (compared to smooth, planar GC) recorded respectively. The RRDE data was analyzed using a kinetic model previously developed by us and the rate constant of the elementary reactions calculated. The rates constant for the electrochemical reactions were found to be similar in magnitude to the rate constants calculated for smooth GC disks. The porosity of the electrode was found to decrease the rate of desorption of the intermediate and the product and delay their diffusion by shifting it from a Fickian regime in the electrolyte bulk to the Knudsen regime in the film pores. Thus, it is shown that the effect of the electrode porosity on the kinetics of the ORR is physical rather than electrochemical."}
{"main_page": "https://arxiv.org/abs/2404.00800", "pdf": "https://arxiv.org/pdf/2404.00800", "title": "Methane and oxygen from energy-efficient, low temperature in situ  resource utilization enables missions to Mars", "authors": "M. Shahid, B. Chambers, S. Sankarasubramanian", "subjects": "Chemical Physics (physics.chem-ph); Materials Science (cond-mat.mtrl-sci)", "abstract": "NASA mandate is a human mission to Mars in the 2030s and sustained exploration of Mars requires in-situ resource utilization (ISRU). Exploiting the Martian water cycle (alongside perchlorate salts that depress the freezing point of water to less than 213K) and the available 95 volume percent atmospheric CO2, we detail an ultra-low temperature (255K) CO2-H2O electrolyzer to produce methane fuel and life-supporting oxygen on Mars. Methane production is thermodynamically favored across a range of operational pressures and temperatures and our electrolyzer polarization model concurred with reported experimental performance. A hypothetical 10-cell, 100 square cm electrode-area-per-cell electrolyzer produced 0.31g per W per day of CH4 and 3.54g per W per day of O2 at 2V per cell (operating voltage) versus 0.8g per W per day of O2 produced by the Mars Oxygen in-situ Resource Utilization Experiment (MOXIE) from the Mars 2020 mission (MOXIE produces no fuel). Material performance requirements are presented to show that this technology is an energy-efficient complement to the MOXIE high temperature approach."}
