{"main_page": "https://arxiv.org/abs/2404.00073", "pdf": "https://arxiv.org/pdf/2404.00073", "title": "The Twisted Spin Synchrotron", "authors": "Ya.S. Derbenev", "subjects": "Accelerator Physics (physics.acc-ph)", "abstract": "A \"Figure 8\" shaped synchrotron is suggested for use in accelerating polarized protons in the energy range below ~ 20 GeV. The spin tune in such an accelerator does not ramp with energy and is equal to zero . Then the intrinsic spin resonances will not appear. A partial Siberian snake (solenoid) is proposed to be inserted into the ring in order to stabilize the spin against imperfect horizontal magnetic fields and implicate a small constant spin tune. The equilibrium polarization will then be horizontal (longitudinal in the solenoid). The twisted spin synchrotron (TSS) can serve as a booster for high energy accelerators with polarized beams. Possibilities to use the TSS as a storage facility or a collider for proton or other particle beams with readily controlled beam polarization are also noted."}
{"main_page": "https://arxiv.org/abs/2404.00083", "pdf": "https://arxiv.org/pdf/2404.00083", "title": "Frequency splitting in undulator radiation from solid-state crystalline  undulator", "authors": "A. Shchagin, G. Kube, A. Potylitsyn, S. Strokov", "subjects": "Accelerator Physics (physics.acc-ph); Optics (physics.optics)", "abstract": "The set of frequencies and angular properties of radiation emitted from a solid-state crystalline undulator based on the channeling effect are considered. High-frequency and low-frequency branches of the undulator radiation and the angular distribution of the emitted radiation are analyzed. The ranges of frequencies and angles of radiation emitted from the solid-state crystalline undulator based on the channeling effect are found. The frequency splitting and the energy threshold in the production of undulator radiation are shown and discussed."}
{"main_page": "https://arxiv.org/abs/2404.00708", "pdf": "https://arxiv.org/pdf/2404.00708", "title": "Representation of fields in inhomogeneous structured waveguides", "authors": "M. I. Ayzatsky", "subjects": "Accelerator Physics (physics.acc-ph); Computational Physics (physics.comp-ph); Optics (physics.optics)", "abstract": "In this work we present the results of a study of the possibility of using a homogeneous basis and a new generalization of coupled modes theory to describe non-periodic structured waveguides. It was shown that for the studied inhomogeneities the single wave approximation gives good results. Within the framework of single wave approximation, the fields are represented as the sum of two components, one of which is associated with the forward eigen wave, and the second with the backward eigen wave. But this second component is not a backward wave. Because of the coupling, characteristics of this component are determined by the first component, which is significantly larger than the second."}
