{"main_page": "https://arxiv.org/abs/2404.00117", "pdf": "https://arxiv.org/pdf/2404.00117", "title": "Spectral approaches to stress relaxation in epithelial monolayers", "authors": "Natasha Cowley, Christopher K. Revell, Emma Johns, Sarah Woolner, Oliver E. Jensen", "subjects": "Biological Physics (physics.bio-ph); Soft Condensed Matter (cond-mat.soft)", "abstract": "We investigate the viscoelastic relaxation to equilibrium of a disordered planar epithelium described using the cell vertex model. In its standard form, the model is formulated as coupled evolution equations for the locations of vertices of confluent polygonal cells. Exploiting the model's gradient-flow structure, we use singular-value decomposition to project modes of deformation of vertices onto modes of deformation of cells. We show how eigenmodes of discrete Laplacian operators (specified by constitutive assumptions related to dissipation and mechanical energy) provide a spatial basis for evolving fields, and demonstrate how the operators can incorporate approximations of conventional spatial derivatives. We relate the spectrum of relaxation times to the eigenvalues of the Laplacians, modified by corrections that account for the fact that the cell network (and therefore the Laplacians) evolve during relaxation to an equilibrium prestressed state, providing the monolayer with geometric stiffness. While dilational modes of the Laplacians capture rapid relaxation in some circumstances, showing diffusive dynamics, geometric stiffness is typically a dominant source of monolayer rigidity, as we illustrate for monolayers exposed to unsteady stretching deformations."}
{"main_page": "https://arxiv.org/abs/2404.00118", "pdf": "https://arxiv.org/pdf/2404.00118", "title": "Shape dynamics and migration of branched cells on complex networks", "authors": "Jiayi Liu, Javier Boix-Campos, Jonathan E. Ron, Johan M. Kux, Nir S. Gov, Pablo J. Sáez", "subjects": "Biological Physics (physics.bio-ph)", "abstract": "Migratory and tissue resident cells exhibit highly branched morphologies to perform their function and to adapt to the microenvironment. Immune cells, for example, display transient branched shapes while exploring the surrounding tissues. In another example, to properly irrigate the tissues, blood vessels bifurcate thereby forcing the branching of cells moving on top or within the vessels. In both cases microenvironmental constraints force migrating cells to extend several highly dynamic protrusions. Here, we present a theoretical model for the shape dynamics and migration of cells that simultaneously span several junctions, which we validated by using micropatterns with an hexagonal array, and a neuronal network image analysis pipeline to monitor the macrophages and endothelial cell shapes and migration. In our model we describe how the actin retrograde flow controls branch extension, retraction and global cell polarization. We relate the noise in this flow to the residency times and trapping of the cell at the junctions of the network. In addition, we found that macrophages and endothelial cells display very different migration regimes on the network, with macrophages moving faster and having larger changes in cell length in comparison to endothelial cells. These results expose how cellular shapes and migration are intricately coupled inside complex geometries."}
{"main_page": "https://arxiv.org/abs/2404.01062", "pdf": "https://arxiv.org/pdf/2404.01062", "title": "Multiple Modes of Motion for the Effectiveness of Outer Hair Cells", "authors": "Kuni H. Iwasa", "subjects": "Biological Physics (physics.bio-ph)", "abstract": "Outer hair cells (OHCs) are essential for the sensitivity and frequency specificity of the mammalian ear. To perform this function, OHCs need to amplify the motion of the basilar membrane (BM), which is much stiffer than themselves. If OHCs and the BM are components of a single oscillator, this impedance mismatch seriously limits the effectiveness of OHCs. However, the elaborated structure of the organ of Corti can support multiple modes motion. Here, systems of two coupled oscillators are examined as the simplest models of the system with multiple modes of motion. It is found that some of these model systems have conditions, under which an OHC can function as an effective amplifier, overcoming the impedance mismatch. The present examination suggests that the presence of multiple modes of motion is a key to the exquisite performance of the mammalian ear."}
