{"main_page": "https://arxiv.org/abs/2404.01016", "pdf": "https://arxiv.org/pdf/2404.01016", "title": "Numerical modelling of flame spread over thin circular ducts", "authors": "Vipin Kumar, Kambam Naresh, Amit Kumar", "subjects": "Fluid Dynamics (physics.flu-dyn); Numerical Analysis (math.NA)", "abstract": "This paper presents a numerical investigation into the phenomenon of flame spread over thin circular ducts in normal gravity and microgravity environments. Flame spread over such geometry is of significant interest due to its relevance in various practical applications, including tubes for flow purpose in medical system, fire safety in spacecrafts, ducts as well as wiring tubes. This study comprises of a comprehensive investigation of key parameters affecting flame spread rate, including fuel radius and opposed flow speed in normal gravity and microgravity environments. A 2-D axisymmetric flame spread model accounted for char and numerical simulations were performed which revealed valuable insights into the underlying mechanisms governing flame spread over such geometry. The results computed from the numerical model is compared with the experimentally observed flame spread rate to validate the numerical model which can be used to gain a comprehensive understanding of the underlying physical phenomena. As the radius of circular duct increases the flame spread rate increases both in normal gravity and microgravity environments. The conduction heat feedback and radiation heat gain coming from hot char through gas phase at inner core region are the two major mechanisms which controls the flame spread phenomena over the circular duct fuels. The flame spread rate at different flow ranging from quiescent (0 cm/s) to 30 cm/s is also evaluated and 21 % oxygen and found a non-monotonic increasing decreasing trend of flame spread rate at different opposed flow speed in both normal gravity and microgravity environments."}
{"main_page": "https://arxiv.org/abs/2404.01021", "pdf": "https://arxiv.org/pdf/2404.01021", "title": "Oscillating flow around a circular cylindrical post confined between two  parallel plates", "authors": "Antonio José Bárcenas-Luque, Francisco Moral-Pulido, Cándido Gutiérrez-Montes, Wilfried Coenen, Carlos Martínez-Bazán", "subjects": "Fluid Dynamics (physics.flu-dyn); Mathematical Physics (math-ph)", "abstract": "This work is motivated by the interest in determining the effect of the micro-anatomy of the spinal subarachnoid space on the cerebrospinal fluid flow and on the associated transport of solutes. To that aim, we focus on a canonical model problem in which a circular post of radius $a$, confined between two parallel plates separated by a distance $2h$, is subjected to an oscillatory flow. In particular, we are concerned with the steady, viscous, time-averaged flow that persists in the vicinity on the cylinder, when the stroke length of the oscillating flow, $U_{\\infty}/\\omega$ is smaller or comparable to the radius of the post, $a$, where $U_{\\infty}$ and $\\omega$ are the mean velocity amplitude and the corresponding angular frequency, respectively. First, we analyze the asymptotic limit of small values of the stroke length varying the aspect ratio of the post $\\lambda$ and the Womersley number $M$. First-order steady-streaming corrections at leading order have been computed, together with associated Stokes-drift component, the sum of both yielding the mean Lagrangian velocity field. The confinement effect is seen to induce the three-dimensionality of flow. Moreover, in the mid plane the time-averaged steady flow exhibits a recirculating vortex attached to the wall of the post that decreases as $M$ increases for low values of $M$. However, for values of $M$ larger than a critical one, $M_{cr}(\\lambda)$, a second, outer vortex is also formed. The dependence $M_{cr}(\\lambda)$ has been quantified. The analysis has been corroborated experimentally for a fixed aspect ratio. Consideration of an anharmonic oscillating flow shows the fort-and-aft symmetry of the steady flow is broken. Finally, the analysis is experimentally extended to consider an array of equally spaced posts."}
{"main_page": "https://arxiv.org/abs/2404.01172", "pdf": "https://arxiv.org/pdf/2404.01172", "title": "Covering convection with thermal blankets: formation of supercontinents", "authors": "Jinzi Mac Huang", "subjects": "Fluid Dynamics (physics.flu-dyn); Numerical Analysis (math.NA)", "abstract": "The continental plates of Earth are known to drift over a geophysical timescale, and their interactions have lead to some of the most spectacular geoformations of our planet while also causing natural disasters such as earthquakes and volcanic activity. Understanding the dynamics of interacting continental plates is thus significant. In this work, we present a fluid mechanical investigation of the plate motion, interaction, and dynamics. Through numerical experiments, we examine the coupling between a convective fluid and plates floating on top of it. With physical modeling, we show the coupling is both mechanical and thermal, leading to the thermal blanket effect: the floating plate is not only transported by the fluid flow beneath, it also prevents the heat from leaving the fluid, leading to a convective flow that further affects the plate motion. By adding several plates to such a coupled fluid-structure interaction, we also investigate how floating plates interact with each other and show that, under proper conditions, small plates can converge into a supercontinent."}
{"main_page": "https://arxiv.org/abs/2404.01193", "pdf": "https://arxiv.org/pdf/2404.01193", "title": "Inferring parameters and reconstruction of two-dimensional turbulent  flows with physics-informed neural networks", "authors": "Vladimir Parfenyev, Mark Blumenau, Ilya Nikitin", "subjects": "Fluid Dynamics (physics.flu-dyn); Data Analysis, Statistics and Probability (physics.data-an)", "abstract": "Solving inverse problems, which means obtaining model parameters from observed data, using conventional computational fluid dynamics solvers is prohibitively expensive. Here we employ machine learning algorithms to overcome the challenge. As an example, we consider a moderately turbulent fluid flow, excited by a stationary force and described by a two-dimensional Navier-Stokes equation with linear bottom friction. Given sparse and probably noisy data for the velocity and the general form of the model, we reconstruct the dense velocity and pressure fields in the observation domain, infer the driving force, and determine the unknown fluid viscosity and friction coefficient. Our approach involves training a physics-informed neural network by minimizing the loss function, which penalizes deviations from the provided data and violations of the Navier-Stokes equation. The suggested technique extracts additional information from experimental and numerical observations, potentially enhancing the capabilities of particle image/tracking velocimetry."}
