{"main_page": "https://arxiv.org/abs/2404.00754", "pdf": "https://arxiv.org/pdf/2404.00754", "title": "Imitation dynamics and the replicator equation", "authors": "José F. Fontanari", "subjects": "Physics and Society (physics.soc-ph); Adaptation and Self-Organizing Systems (nlin.AO); Populations and Evolution (q-bio.PE)", "abstract": "Evolutionary game theory has impacted many fields of research by providing a mathematical framework for studying the evolution and maintenance of social and moral behaviors. This success is owed in large part to the demonstration that the central equation of this theory - the replicator equation - is the deterministic limit of a stochastic imitation (social learning) dynamics. Here we offer an alternative elementary proof of this result, which holds for the scenario where players compare their instantaneous (not average) payoffs to decide whether to maintain or change their strategies, and only more successful individuals can be imitated."}
{"main_page": "https://arxiv.org/abs/2404.00866", "pdf": "https://arxiv.org/pdf/2404.00866", "title": "Nonlinear trend of COVID-19 infection time series", "authors": "Fumihiko Ishiyama", "subjects": "Physics and Society (physics.soc-ph); Populations and Evolution (q-bio.PE)", "abstract": "We have developed a nonlinear method of time series analysis that allows us to obtain multiple nonlinear trends without harmonics from a given set of numerical data. We propose to apply the method to recognize the ongoing status of COVID-19 infection with an analytical equation for nonlinear trends. We found that there is only a single nonlinear trend, and this result justifies the use of a week-based infection growth rate. In addition, the fit with the obtained analytical equation for the nonlinear trend holds for a duration of more than three months for the Delta variant infection time series. The fitting also visualizes the transition to the Omicron variant."}
{"main_page": "https://arxiv.org/abs/2404.01046", "pdf": "https://arxiv.org/pdf/2404.01046", "title": "Locating influential nodes in hypergraphs via fuzzy collective influence", "authors": "Su-Su Zhang, Xiaoyan Yu, Gui-Quan Sun, Chuang Liu, Xiu-Xiu Zhan", "subjects": "Physics and Society (physics.soc-ph)", "abstract": "Complex contagion phenomena, such as the spread of information or contagious diseases, often occur among the population due to higher-order interactions between individuals. Individuals who can be represented by nodes in a network may play different roles in the spreading process, and thus finding the most influential nodes in a network has become a crucial topic in network science for applications such as viral marketing, rumor suppression, and disease control. To solve the problem of identifying nodes that have high influence in a complex system, we propose a higher-order distance-based fuzzy centrality methods (HDF and EHDF) that are customized for a hypergraph which can characterize higher-order interactions between nodes via hyperedges. The methods we proposed assume that the influence of a node is reliant on the neighboring nodes with a certain higher-order distance. We compare the proposed methods with the baseline centrality methods to verify their effectiveness. Experimental results on six empirical hypergraphs show that the proposed methods could better identify influential nodes, especially showing plausible performance in finding the top influential nodes. Our proposed theoretical framework for identifying influential nodes could provide insights into how higher-order topological structure can be used for tasks such as vital node identification, influence maximization, and network dismantling."}
{"main_page": "https://arxiv.org/abs/2404.01085", "pdf": "https://arxiv.org/pdf/2404.01085", "title": "Analyzing Common Social and Physical Features of Flash-Flood  Vulnerability Hotspots in Urban Areas", "authors": "Allison Clarke, Natalie Coleman, Dr. Ali Mostafavi", "subjects": "Physics and Society (physics.soc-ph)", "abstract": "Flash flooding events, with their intense and sudden nature, present unique challenges for disaster researchers and emergency planners. To quantify the extent to which hotspots of flash flooding share similar social and physical features, the research uses community scale crowdsourced data and k means clustering. Crowdsourced data offers the potential to allocate limited resources, to improve spatial understanding, and to minimize the future effects of natural hazards. The research evaluates the impacts of Tropical Storm Imelda on Houston Metropolitan and Hurricane Ida on New York City. It develops a combined flash flood impact index based on FEMA claims, 311 calls, and Waze traffic reports which is able to capture a combination of crowdsourced data for the societal impact of flash flooding. In addition, k means clustering offers an essential tool for evaluating attributes associated with flash flooding events by grouping data into k number clusters of features. Thus, k means clustering evaluates the significance of a community's socio demographic, social capital, and physical features to the combined flood impact index. To ensure accessibility and replicability to different types of communities, our research uses publicly available datasets to understand how socio demographic data, social capital, and physical connectivity and development affect flash flood resilience. The findings reveal the intricate relationships associated with flash flooding impact as a combination of socio demographic and physical features. For instance, the cluster with the highest scores of the flash flood impact index from Tropical Storm Imelda had the highest percentage of minority population and lower income while the cluster with the second highest score flash flood impact index had the highest percentage of impervious surface and number of POIs."}
