{"main_page": "https://arxiv.org/abs/2404.00071", "pdf": "https://arxiv.org/pdf/2404.00071", "title": "Phase Matching of High-Order Harmonics in Hollow Waveguides", "authors": "Charles G. Durfee III, Andy R. Rundquist, Sterling Backus, Catherine Herne, Margaret M. Murnane, Henry C. Kapteyn", "subjects": "Optics (physics.optics); Atomic Physics (physics.atom-ph); Quantum Physics (quant-ph)", "abstract": "We investigate the case of phase-matched high-harmonic generation in a gas-filled capillary waveguide, comparing in detail theory with experiment. We observe three different regimes of phase matching: one where atomic dispersion balances waveguide dispersion, another corresponding to non-collinear Cerenkov phase-matching, and a third where atomic dispersion and plasma dispersion balance. The role of atomic dispersion is demonstrated by studying the dependence of the harmonic signal for several gases. We also predict and provide preliminary evidence of a regime where phase-matching occurs only at specific fractional ionization levels, leading to an output signal that is sensitive to the absolute phase of the carrier wave."}
{"main_page": "https://arxiv.org/abs/2404.00072", "pdf": "https://arxiv.org/pdf/2404.00072", "title": "Phase-Matching of High-Order Harmonics Driven by Mid- Infrared Light", "authors": "Tenio Popmintchev, Ming-Chang Chen, Oren Cohen, Michael E. Grisham, Jorge J. Rocca, Margaret M. Murnane, Henry C. Kapteyn", "subjects": "Optics (physics.optics); Atomic Physics (physics.atom-ph); Quantum Physics (quant-ph)", "abstract": "We demonstrate that phase-matched frequency upconversion of ultrafast laser light can be extended to shorter wavelengths by using longer driving laser wavelengths. Experimentally, we show that the phase-matching cutoff for harmonic generation in argon increases from 45 to 100 eV when the driving laser wavelength is increased from 0.8 to 1.3 micrometers. Phase matching is also obtained at higher pressures using a longer-wavelength driving laser, mitigating the unfavorable scaling of the single-atom response. Theoretical calculations suggest that phase-matched high harmonic frequency upconversion driven by mid-infrared pulses could be extended to extremely high photon energies."}
{"main_page": "https://arxiv.org/abs/2404.00079", "pdf": "https://arxiv.org/pdf/2404.00079", "title": "Wave-Medium Interactions in Dynamic Matter and Modulation Systems", "authors": "Zhiyu Li, Xikui Ma, Zoé-Lise Deck-Léger, Amir Bahrami, Christophe Caloz", "subjects": "Optics (physics.optics)", "abstract": "Space-time modulation systems have garnered significant attention due to their resemblance to moving-matter systems and promising applications. Unlike conventional moving-matter systems, modulation systems do not involve net motion of matter, and are therefore easier to implement and not restricted to subluminal velocities. However, canonical wave-medium interaction aspects, such as scattering and energy-momentum relations, have remained largely unexplored. In this paper, we address the aforementioned issues for three dynamic systems: moving-matter blocs, moving-perturbation interfaces and moving-perturbation periodic structures, and provide corresponding general formulations along with comparisons. Our investigation reveals the significant roles played by the \"catch-up\" effect between waves and interfaces. Even more interestingly, it reveals different energy and momentum exchanges between moving media and homogenized moving-perturbation structures as a result of conventional and reverse Fresnel-Fizeau drag effects."}
{"main_page": "https://arxiv.org/abs/2404.00134", "pdf": "https://arxiv.org/pdf/2404.00134", "title": "Polarization-based Metalenses with High Numerical Aperture and Focusing  Efficiency Utilizing Silicon-rich Nitride", "authors": "Alireza Khalilian, Bowen Yu, Yasha Yi", "subjects": "Optics (physics.optics); Applied Physics (physics.app-ph)", "abstract": "We explore the cutting-edge application of silicon-rich nitride (SRN) in the realm of high numerical aperture (NA) metalens design, focusing on the crucial role of pitch size optimization in amplifying lens efficiency through advanced simulations. Our investigation unveils how the exceptional tunable high refractive index of SRN can be harnessed to achieve significant advancements in metalens performance. By meticulously designing and simulating two innovative SRN-based metalenses - Mk1, with an NA of 0.9, reaching an impressive 75% focusing efficiency with full width at half maximum (FWHM) of 0.53{\\lambda}, and Mk2, with an NA of 0.99, achieving a 42% efficiency while maintaining an FWHM of 0.48{\\lambda}. We demonstrate the critical influence of reduced pitch size on enhancing efficiency. This study not only highlights the unparalleled potential of SRN in optimizing metalens efficiency but also represents a significant leap forward in the field of nanophotonics, offering new pathways for the development of highly efficient flat photonic devices."}
{"main_page": "https://arxiv.org/abs/2404.00136", "pdf": "https://arxiv.org/pdf/2404.00136", "title": "Tunable X-band opto-electronic synthesizer with ultralow phase noise", "authors": "Igor Kudelin, Pedram Shirmohammadi, William Groman, Samin Hanifi, Megan L. Kelleher, Dahyeon Lee, Takuma Nakamura, Charles A. McLemore, Alexander Lind, Dylan Meyer, Junwu Bai, Joe C. Campbell, Steven M. Bowers, Franklyn Quinlan, Scott A. Diddams", "subjects": "Optics (physics.optics); Signal Processing (eess.SP)", "abstract": "Modern communication, navigation, and radar systems rely on low noise and frequency-agile microwave sources. In this application space, photonic systems provide an attractive alternative to conventional microwave synthesis by leveraging high spectral purity lasers and optical frequency combs to generate microwaves with exceedingly low phase noise. However, these photonic techniques suffer from a lack of frequency tunability, and also have substantial size, weight, and power requirements that largely limit their use to laboratory settings. In this work, we address these shortcomings with a hybrid opto-electronic approach that combines simplified optical frequency division with direct digital synthesis to produce tunable low-phase-noise microwaves across the entire X-band. This results in exceptional phase noise at 10 GHz of -156 dBc/Hz at 10 kHz offset and fractional frequency instability of 1x10^-13 at 0.1 s. Spot tuning away from 10 GHz by 500 MHz, 1 GHz, and 2 GHz, yields phase noise at 10 kHz offset of -150 dBc/Hz, -146 dBc/Hz, and -140 dBc/Hz, respectively. The synthesizer architecture is fully compatible with integrated photonic implementations that will enable a versatile microwave source in a chip-scale package. Together, these advances illustrate an impactful and practical synthesis technique that shares the combined benefits of low timing noise provided by photonics and the frequency agility of established digital synthesis."}
{"main_page": "https://arxiv.org/abs/2404.00148", "pdf": "https://arxiv.org/pdf/2404.00148", "title": "Measurement of nonequilibrium vortex propagation dynamics in a nonlinear  medium", "authors": "Patrick C. Ford, Andrew A. Voitiv, Chuanzhou Zhu, Mark T. Lusk, Mark E. Siemens", "subjects": "Optics (physics.optics); Other Condensed Matter (cond-mat.other); Pattern Formation and Solitons (nlin.PS); Fluid Dynamics (physics.flu-dyn)", "abstract": "We observe and measure the nonequilibrium dynamics of optical vortices as a function of propagation distance through a nonlinear medium. The precession of a tilted-core vortex is quantified as is vortex-core sharpening, where the infinite width of a linear core subsequently shrinks and approaches the healing length of this nonlinear optical fluid. Experiments are performed with a variable-length nonlinear medium: a nonlinear fluid in a tank with an output window on a translating tube. This provides control over the distance the light propagates in the fluid and allows for the measurement of the dynamics throughout the entire propagation range. Results are compared to the predictions of a computational simulator to find the equivalent dimensionless nonlinear coefficient."}
{"main_page": "https://arxiv.org/abs/2404.00229", "pdf": "https://arxiv.org/pdf/2404.00229", "title": "Rotating-modulated Higher-Order Topological States in a Split-ring  Photonic Insulator", "authors": "Hui Chang Li, Xiang Zhou, Hai Lin Chi, Wen Wen Wang, Yun Shen, Xiao Hua Deng", "subjects": "Optics (physics.optics); Applied Physics (physics.app-ph)", "abstract": "The emerging field of topology has brought device effects to a new level. Higher-order topological insulators (HOTIs) go beyond traditional descriptions of bulk-edge correspondence, broadening the understanding of topologically insulating phases. In this paper, a second-order split-ring photonic crystal (SSPC) with zero-dimensional (0D) corner states and one-dimensional (1D) edge states is proposed. Based on the coupling strength determined by the opening direction between the split-rings, the electronic transition strength of the electronic system is imitated, and the topological trivial and non-trivial transformation of the topological two-dimensional (2D) SSH model are realized by using the rotating split-ring lattice. Theory and simulation find that SSPC has non-trivial topological edge states that can be quantified by bulk polarization. As the opening direction of the split-rings gradually changes within one period, there will be transitions between four different topological polarizations of the lowest energy bands, which can be conveniently used to achieve transitions between different topological phases. Our research can be extended to higher dimensions and broaden research paths for higher-order photonic topological insulators and semimetals."}
{"main_page": "https://arxiv.org/abs/2404.00290", "pdf": "https://arxiv.org/pdf/2404.00290", "title": "The sensitivity of refractive index sensors based on defected 1D  photonic crystals: an analytical approach", "authors": "Nikolay A. Vanyushkin, I.M. Efimov, Ashot H. Gevorgyan", "subjects": "Optics (physics.optics)", "abstract": "In this paper, an analytical formula for the sensitivity of optical sensors based on one-dimensional photonic crystals (PCs) with a defect was derived for the first time. Based on this formula, a comparative analysis of the sensitivity of defected PCs with and without mirror symmetry was carried out. In addition, the exact values of sensitivity in the limit of an infinite PC with a quarter-wave unit cell were obtained. It was shown that the sensitivity of a defective PC with an infinitely thick defect layer is equal to that of a perfectly reflecting Fabry-Perot resonator and does not depend on the specific structure of the PC. The results of this work provide a significant simplification of the analysis and optimization of optical sensors based on defective PCs, as well as a better understanding of the numerous numerical results obtained previously."}
{"main_page": "https://arxiv.org/abs/2404.00304", "pdf": "https://arxiv.org/pdf/2404.00304", "title": "Ultrafast Kapitza-Dirac effect", "authors": "Kang Lin, Sebastian Eckart, Hao Liang, Alexander Hartung, Sina Jacob, Qinying Ji, Lothar Ph. H. Schmidt, Markus S. Schöffler, Till Jahnke, Maksim Kunitski, Reinhard Dörner", "subjects": "Optics (physics.optics); Atomic Physics (physics.atom-ph)", "abstract": "Similar to the optical diffraction of light passing through a material grating, the Kapitza-Dirac effect occurs when an electron is diffracted by a standing light wave. In its original description the effect is time-independent. In the present work, we extend the Kapitza-Dirac concept to the time domain. By tracking the spatiotemporal evolution of a pulsed electron wave packet diffracted by a femtosecond (10 15 second) standing wave pulse in a pump-probe scheme, we observe so far unseen time-dependent diffraction patterns. The fringe spacing in the observed pattern differs from that generated by the conventional Kapitza-Dirac effect, moreover it decreases as the pump-probe delay time increases. By exploiting this time-resolved diffraction scheme, we gather access to the time evolution of the previously inaccessible phase properties of a free electron."}
{"main_page": "https://arxiv.org/abs/2404.00355", "pdf": "https://arxiv.org/pdf/2404.00355", "title": "Design and production of a free-form lens for long range LED  illumination", "authors": "Ahmet Bingül, Mehmet Adıyaman", "subjects": "Optics (physics.optics)", "abstract": "In this study, a procedure for designing a free-form lens for long-range LED illumination is presented. The geometrical form of the proposed lens is obtained by minimizing optical path lengths of the rays emitted from a point-like light source. Optical ray tracing simulations of two different LEDs and the free-form lens are performed by using Zemax OpticStudio. In addition, the prototype of the free-form lens is manufactured by the plastic injection molding method using PMMA material. Nine of the lenses are used to build an LED projector in the form of a 3x3 lens matrix. The optical measurements of the projector are compared with the results predicted in the simulations. It is found that the beam divergence of the projector is less than 10 degrees when using suitable LEDs in visible and near infrared regions."}
{"main_page": "https://arxiv.org/abs/2404.00472", "pdf": "https://arxiv.org/pdf/2404.00472", "title": "Chaotic dynamics under the influence of synthetic magnetic field in  optomechanical system", "authors": "Souvik Mondal, Murilo S. Baptista, Kapil Debnath", "subjects": "Optics (physics.optics)", "abstract": "The optomechanical systems produce chaotic behaviour due to nonlinear interaction between photons and phonons, and the same systems are used to understand the synthetic fields as well. Here, we report on the study of chaotic behaviour in the presence of a phononic synthetic magnetic field in a closed loop configuration consisting of a single optical mode and two mechanical modes. The modulation phase of the mechanical coupling between the two mechanical modes plays a critical role in determining the mechanical and optical intensity dynamics in the nonlinear regime. Our study shows the dark mode breaking effect in the presence of a synthetic magnetic field, which brings about a complex way of mechanical energy exchange that causes the cavity field to alternate between chaotic and regular behaviour periodically in temporal domain. Besides, with the advent of advanced fabrication technologies, this study holds promises in developing phase tunable integrated low-power chaotic light sources to support efficient optical secure communication systems."}
{"main_page": "https://arxiv.org/abs/2404.00480", "pdf": "https://arxiv.org/pdf/2404.00480", "title": "A New Thermodynamic Approach to Multimode Fibre Self-cleaning and  Soliton Condensation", "authors": "Mario Zitelli", "subjects": "Optics (physics.optics)", "abstract": "A new thermodynamic theory for optical multimode systems is proposed. Theory is based on a weighted Bose-Einstein law, and includes the state equation, the fundamental equation for the entropy and a metric to measure the accuracy of the thermodynamic approach. The theory is used to compare the experimental results of two propagation regimes in multimode fibres, specifically the self-cleaning in the normal chromatic dispersion region and the soliton condensation in the anomalous dispersion region. Surprising similarities are found in terms of thermodynamic parameters, suggesting a common basis for the thermalisation processes observed in the two propagation regimes."}
{"main_page": "https://arxiv.org/abs/2404.00545", "pdf": "https://arxiv.org/pdf/2404.00545", "title": "Unified, Verifiable Neural Simulators for Electromagnetic Wave Inverse  Problems", "authors": "Charles Dove, Jatearoon Boondicharern, Laura Waller", "subjects": "Optics (physics.optics); Machine Learning (cs.LG); Image and Video Processing (eess.IV)", "abstract": "Simulators based on neural networks offer a path to orders-of-magnitude faster electromagnetic wave simulations. Existing models, however, only address narrowly tailored classes of problems and only scale to systems of a few dozen degrees of freedom (DoFs). Here, we demonstrate a single, unified model capable of addressing scattering simulations with thousands of DoFs, of any wavelength, any illumination wavefront, and freeform materials, within broad configurable bounds. Based on an attentional multi-conditioning strategy, our method also allows non-recurrent supervision on and prediction of intermediate physical states, which provides improved generalization with no additional data-generation cost. Using this O(1)-time intermediate prediction capability, we propose and prove a rigorous, efficiently computable upper bound on prediction error, allowing accuracy guarantees at inference time for all predictions. After training solely on randomized systems, we demonstrate the unified model across a suite of challenging multi-disciplinary inverse problems, finding strong efficacy and speed improvements up to 96% for problems in optical tomography, beam shaping through volumetric random media, and freeform photonic inverse design, with no problem-specific training. Our findings demonstrate a path to universal, verifiably accurate neural surrogates for existing scattering simulators, and our conditioning and training methods are directly applicable to any PDE admitting a time-domain iterative solver."}
{"main_page": "https://arxiv.org/abs/2404.00991", "pdf": "https://arxiv.org/pdf/2404.00991", "title": "Optical solitons in multimode fibers: recent advances", "authors": "Mario Zitelli", "subjects": "Optics (physics.optics); Pattern Formation and Solitons (nlin.PS)", "abstract": "Optical solitons in multimode fibers have been predicted 40 years ago and extensively investigated theoretically. Transmission experiments in nonlinear multimode fibers have gained renewed interest, motivated by their potential to extend the capacity of long-distance transmission systems; only in the last few years, new experiments have revealed unexpected properties of optical solitons propagating in graded-index and step-index multimode fibers, partially re-writing the existing theory. Here we provide an overview of the recent experimental, numerical and theoretical studies which revealed those new properties. It will be shown that multimode fiber solitons form with specific pulse width and energy dependent on the wavelength, and that they naturally evolve toward fundamental-mode Raman solitons. New soliton fission mechanisms, governed by the modal dispersion, will be explained. Possible applications in space-division multiplexed systems will be discussed. A recent thermodynamic approach to soliton condensation will be described."}
