{"main_page": "https://arxiv.org/abs/2404.00001", "pdf": "https://arxiv.org/pdf/2404.00001", "title": "Uso de herramientas digitales matemáticas en la Educación Secundaria", "authors": "José Manuel Fernández-Barroso", "subjects": "Physics Education (physics.ed-ph)", "abstract": "Information and Community Technologies (ICT) are very present in our society nowadays and particularly in the educative field. In just two decades, we have passed from a learning based, in many cases, on the master lessons to one such that methodologies like the flipped classroom or the gamification are stronger than ever. Along this work, we have done a study to teachers and students with the main objective to compare the knowledge on digital tools, their use and their acceptation. We use WxMaxima and Geogebra in order to solve an exercise of \\textit{Evaluaci\\'on de Bachillerato para el Acceso a la Universidad} (EBAU) related with Geometry, comparing their ins and outs with the manual solution. Finally, we expose some conclusions and some possible research lines about digital tools, as well as a proposition of an introductory course on WxMaxima and Geogebra in order to teach the teachers."}
{"main_page": "https://arxiv.org/abs/2404.00009", "pdf": "https://arxiv.org/pdf/2404.00009", "title": "Applying Cognitive Diagnostic Models to Mechanics Concept Inventories", "authors": "Vy Le, Jayson M. Nissen, Xiuxiu Tang, Yuxiao Zhang, Amirreza Mehrabi, Jason W. Morphew, Hua Hua Chang, Ben Van Dusen", "subjects": "Physics Education (physics.ed-ph)", "abstract": "In physics education research, instructors and researchers often use research-based assessments (RBAs) to assess students' skills and knowledge. In this paper, we support the development of a mechanics cognitive diagnostic to test and implement effective and equitable pedagogies for physics instruction. Adaptive assessments using cognitive diagnostic models provide significant advantages over fixed-length RBAs commonly used in physics education research. As part of a broader project to develop a cognitive diagnostic assessment for introductory mechanics within an evidence-centered design framework, we identified and tested student models of four skills that cross content areas in introductory physics: apply vectors, conceptual relationships, algebra, and visualizations. We developed the student models in three steps. First, we based the model on learning objectives from instructors. Second, we coded the items on RBAs using the student models. Lastly, we then tested and refined this coding using a common cognitive diagnostic model, the deterministic inputs, noisy ``and'' gate (DINA) model. The data included 19,889 students who completed either the Force Concept Inventory, Force and Motion Conceptual Evaluation, or Energy and Momentum Conceptual Survey on the LASSO platform. The results indicated a good to adequate fit for the student models with high accuracies for classifying students with many of the skills. The items from these three RBAs do not cover all of the skills in enough detail, however, they will form a useful initial item bank for the development of the mechanics cognitive diagnostic."}
{"main_page": "https://arxiv.org/abs/2404.00014", "pdf": "https://arxiv.org/pdf/2404.00014", "title": "Deep Geometry Handling and Fragment-wise Molecular 3D Graph Generation", "authors": "Odin Zhang, Yufei Huang, Shichen Cheng, Mengyao Yu, Xujun Zhang, Haitao Lin, Yundian Zeng, Mingyang Wang, Zhenxing Wu, Huifeng Zhao, Zaixi Zhang, Chenqing Hua, Yu Kang, Sunliang Cui, Peichen Pan, Chang-Yu Hsieh, Tingjun Hou", "subjects": "Chemical Physics (physics.chem-ph); Artificial Intelligence (cs.AI); Biomolecules (q-bio.BM)", "abstract": "Most earlier 3D structure-based molecular generation approaches follow an atom-wise paradigm, incrementally adding atoms to a partially built molecular fragment within protein pockets. These methods, while effective in designing tightly bound ligands, often overlook other essential properties such as synthesizability. The fragment-wise generation paradigm offers a promising solution. However, a common challenge across both atom-wise and fragment-wise methods lies in their limited ability to co-design plausible chemical and geometrical structures, resulting in distorted conformations. In response to this challenge, we introduce the Deep Geometry Handling protocol, a more abstract design that extends the design focus beyond the model architecture. Through a comprehensive review of existing geometry-related models and their protocols, we propose a novel hybrid strategy, culminating in the development of FragGen - a geometry-reliable, fragment-wise molecular generation method. FragGen marks a significant leap forward in the quality of generated geometry and the synthesis accessibility of molecules. The efficacy of FragGen is further validated by its successful application in designing type II kinase inhibitors at the nanomolar level."}
{"main_page": "https://arxiv.org/abs/2404.00020", "pdf": "https://arxiv.org/pdf/2404.00020", "title": "Interseções entre a Física e os saberes da tradição  ceramista", "authors": "Samuel Antonio Silva do Rosario, Carlos Aldemir Farias da Silva", "subjects": "History and Philosophy of Physics (physics.hist-ph); Physics Education (physics.ed-ph); Physics and Society (physics.soc-ph)", "abstract": "The growing interaction between traditional knowledge and formal sciences emerges as a relevant field of research. In this perspective, the aim of this article is to investigate the intersections between Physics and traditional knowledge in the ceramics practices of Vila Cuera, in Bragan\\c{c}a, state of Para. Using an ethnographic approach, complemented by qualitative analysis, we realize that ceramists use their sensitive intuition and, masterfully, apply thermodynamic principles in the production of handmade ceramics. The results highlight the value of Ethnophysics, underlining that, long before the formal structuring of science as we know it, traditional societies already practiced and understood natural phenomena in tune with contemporary physical principles. We conclude that there is an inherent link between Physics and traditional knowledge with regard to the traditional ceramics practice, grounded on empirical observations and ancestral wisdom, that dialogues with science in a complementary relationship. The study highlights the importance of valuing and recognizing the knowledge of traditional populations by highlighting the knowledge doings of cultures and institutionalized science."}
{"main_page": "https://arxiv.org/abs/2404.00044", "pdf": "https://arxiv.org/pdf/2404.00044", "title": "UAlign: Pushing the Limit of Template-free Retrosynthesis Prediction  with Unsupervised SMILES Alignment", "authors": "Kaipeng Zeng, Xin Zhao, Yu Zhang, Fan Nie, Xiaokang Yang, Yaohui Jin, Yanyan Xu", "subjects": "Chemical Physics (physics.chem-ph); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)", "abstract": "Retrosynthesis planning poses a formidable challenge in the organic chemical industry, particularly in pharmaceuticals. Single-step retrosynthesis prediction, a crucial step in the planning process, has witnessed a surge in interest in recent years due to advancements in AI for science. Various deep learning-based methods have been proposed for this task in recent years, incorporating diverse levels of additional chemical knowledge dependency. This paper introduces UAlign, a template-free graph-to-sequence pipeline for retrosynthesis prediction. By combining graph neural networks and Transformers, our method can more effectively leverage the inherent graph structure of molecules. Based on the fact that the majority of molecule structures remain unchanged during a chemical reaction, we propose a simple yet effective SMILES alignment technique to facilitate the reuse of unchanged structures for reactant generation. Extensive experiments show that our method substantially outperforms state-of-the-art template-free and semi-template-based approaches. Importantly, Our template-free method achieves effectiveness comparable to, or even surpasses, established powerful template-based methods. Scientific contribution: We present a novel graph-to-sequence template-free retrosynthesis prediction pipeline that overcomes the limitations of Transformer-based methods in molecular representation learning and insufficient utilization of chemical information. We propose an unsupervised learning mechanism for establishing product-atom correspondence with reactant SMILES tokens, achieving even better results than supervised SMILES alignment methods. Extensive experiments demonstrate that UAlign significantly outperforms state-of-the-art template-free methods and rivals or surpasses template-based approaches, with up to 5\\% (top-5) and 5.4\\% (top-10) increased accuracy over the strongest baseline."}
{"main_page": "https://arxiv.org/abs/2404.00050", "pdf": "https://arxiv.org/pdf/2404.00050", "title": "Grappa -- A Machine Learned Molecular Mechanics Force Field", "authors": "Leif Seute, Eric Hartmann, Jan Stühmer, Frauke Gräter", "subjects": "Chemical Physics (physics.chem-ph); Machine Learning (cs.LG); Computational Physics (physics.comp-ph)", "abstract": "Simulating large molecular systems over long timescales requires force fields that are both accurate and efficient. In recent years, E(3) equivariant neural networks have lifted the tension between computational efficiency and accuracy of force fields, but they are still several orders of magnitude more expensive than classical molecular mechanics (MM) force fields. Here, we propose a novel machine learning architecture to predict MM parameters from the molecular graph, employing a graph attentional neural network and a transformer with symmetry-preserving positional encoding. The resulting force field, Grappa, outperforms established and other machine-learned MM force fields in terms of accuracy at the same computational efficiency and can be used in existing Molecular Dynamics (MD) engines like GROMACS and OpenMM. It predicts energies and forces of small molecules, peptides, RNA and - showcasing its extensibility to uncharted regions of chemical space - radicals at state-of-the-art MM accuracy. We demonstrate Grappa's transferability to macromolecules in MD simulations, during which large protein are kept stable and small proteins can fold. Our force field sets the stage for biomolecular simulations close to chemical accuracy, but with the same computational cost as established protein force fields."}
{"main_page": "https://arxiv.org/abs/2404.00071", "pdf": "https://arxiv.org/pdf/2404.00071", "title": "Phase Matching of High-Order Harmonics in Hollow Waveguides", "authors": "Charles G. Durfee III, Andy R. Rundquist, Sterling Backus, Catherine Herne, Margaret M. Murnane, Henry C. Kapteyn", "subjects": "Optics (physics.optics); Atomic Physics (physics.atom-ph); Quantum Physics (quant-ph)", "abstract": "We investigate the case of phase-matched high-harmonic generation in a gas-filled capillary waveguide, comparing in detail theory with experiment. We observe three different regimes of phase matching: one where atomic dispersion balances waveguide dispersion, another corresponding to non-collinear Cerenkov phase-matching, and a third where atomic dispersion and plasma dispersion balance. The role of atomic dispersion is demonstrated by studying the dependence of the harmonic signal for several gases. We also predict and provide preliminary evidence of a regime where phase-matching occurs only at specific fractional ionization levels, leading to an output signal that is sensitive to the absolute phase of the carrier wave."}
{"main_page": "https://arxiv.org/abs/2404.00072", "pdf": "https://arxiv.org/pdf/2404.00072", "title": "Phase-Matching of High-Order Harmonics Driven by Mid- Infrared Light", "authors": "Tenio Popmintchev, Ming-Chang Chen, Oren Cohen, Michael E. Grisham, Jorge J. Rocca, Margaret M. Murnane, Henry C. Kapteyn", "subjects": "Optics (physics.optics); Atomic Physics (physics.atom-ph); Quantum Physics (quant-ph)", "abstract": "We demonstrate that phase-matched frequency upconversion of ultrafast laser light can be extended to shorter wavelengths by using longer driving laser wavelengths. Experimentally, we show that the phase-matching cutoff for harmonic generation in argon increases from 45 to 100 eV when the driving laser wavelength is increased from 0.8 to 1.3 micrometers. Phase matching is also obtained at higher pressures using a longer-wavelength driving laser, mitigating the unfavorable scaling of the single-atom response. Theoretical calculations suggest that phase-matched high harmonic frequency upconversion driven by mid-infrared pulses could be extended to extremely high photon energies."}
{"main_page": "https://arxiv.org/abs/2404.00073", "pdf": "https://arxiv.org/pdf/2404.00073", "title": "The Twisted Spin Synchrotron", "authors": "Ya.S. Derbenev", "subjects": "Accelerator Physics (physics.acc-ph)", "abstract": "A \"Figure 8\" shaped synchrotron is suggested for use in accelerating polarized protons in the energy range below ~ 20 GeV. The spin tune in such an accelerator does not ramp with energy and is equal to zero . Then the intrinsic spin resonances will not appear. A partial Siberian snake (solenoid) is proposed to be inserted into the ring in order to stabilize the spin against imperfect horizontal magnetic fields and implicate a small constant spin tune. The equilibrium polarization will then be horizontal (longitudinal in the solenoid). The twisted spin synchrotron (TSS) can serve as a booster for high energy accelerators with polarized beams. Possibilities to use the TSS as a storage facility or a collider for proton or other particle beams with readily controlled beam polarization are also noted."}
{"main_page": "https://arxiv.org/abs/2404.00079", "pdf": "https://arxiv.org/pdf/2404.00079", "title": "Wave-Medium Interactions in Dynamic Matter and Modulation Systems", "authors": "Zhiyu Li, Xikui Ma, Zoé-Lise Deck-Léger, Amir Bahrami, Christophe Caloz", "subjects": "Optics (physics.optics)", "abstract": "Space-time modulation systems have garnered significant attention due to their resemblance to moving-matter systems and promising applications. Unlike conventional moving-matter systems, modulation systems do not involve net motion of matter, and are therefore easier to implement and not restricted to subluminal velocities. However, canonical wave-medium interaction aspects, such as scattering and energy-momentum relations, have remained largely unexplored. In this paper, we address the aforementioned issues for three dynamic systems: moving-matter blocs, moving-perturbation interfaces and moving-perturbation periodic structures, and provide corresponding general formulations along with comparisons. Our investigation reveals the significant roles played by the \"catch-up\" effect between waves and interfaces. Even more interestingly, it reveals different energy and momentum exchanges between moving media and homogenized moving-perturbation structures as a result of conventional and reverse Fresnel-Fizeau drag effects."}
{"main_page": "https://arxiv.org/abs/2404.00083", "pdf": "https://arxiv.org/pdf/2404.00083", "title": "Frequency splitting in undulator radiation from solid-state crystalline  undulator", "authors": "A. Shchagin, G. Kube, A. Potylitsyn, S. Strokov", "subjects": "Accelerator Physics (physics.acc-ph); Optics (physics.optics)", "abstract": "The set of frequencies and angular properties of radiation emitted from a solid-state crystalline undulator based on the channeling effect are considered. High-frequency and low-frequency branches of the undulator radiation and the angular distribution of the emitted radiation are analyzed. The ranges of frequencies and angles of radiation emitted from the solid-state crystalline undulator based on the channeling effect are found. The frequency splitting and the energy threshold in the production of undulator radiation are shown and discussed."}
{"main_page": "https://arxiv.org/abs/2404.00096", "pdf": "https://arxiv.org/pdf/2404.00096", "title": "A theoretical study on the mechanisms of formation of primal carbon  clusters and nanoparticles in space", "authors": "Dobromir A. Kalchevski, Dimitar V. Trifonov, Stefan K. Kolev, Valentin N. Popov, Hristiyan A. Aleksandrov, Teodor I. Milenov", "subjects": "Chemical Physics (physics.chem-ph)", "abstract": "We present a computational study of assembling carbon clusters and nanophases in space from carbon aggregations. Geometry optimizations and Density-functional-based tight-binding (SCC-DFTB) dynamics methods are employed to predict carbon clusters, their time evolution, and their stability. The initial density of the aggregates is found to be of primary importance for the structural properties of the clusters. Aggregates with sufficiently low initial density yield clusters with approximately equal prevalence of sp and sp2 hybridized states and almost missing sp3 ones. The increase in the initial density results in sp2-dominant molecules that resemble the carbon skeleton of polycyclic aromatic hydrocarbons (PAHs). Larger initial aggregations with tetrahedral interatomic orientation result in sp2-dominant multi-dimensional polymers. Such materials are highly porous and resemble axially bound nanotubes. Some resultant clusters resemble fullerene building blocks. Spheroid nanoparticles resembling improper fullerenes are predicted by metadynamics, aimed at inter-fragment coupling reactions. One such structure has the lowest binding energy per atom among the studied molecules. All zero-dimensional forms, obtained by the simulations, conform to the experimentally detected types of molecules in space. The theoretical IR spectrum of the clusters closely resembles that of fullerene C70 and therefore such imperfect structures may be mistaken for known fullerenes in experimental infrared (IR) telescope studies."}
{"main_page": "https://arxiv.org/abs/2404.00106", "pdf": "https://arxiv.org/pdf/2404.00106", "title": "Precise Control of Process Parameters for >23% Efficiency Perovskite  Solar Cells in Ambient Air Using an Automated Device Acceleration Platform", "authors": "Jiyun Zhang, Anastasia Barabash, Tian Du, Jianchang Wu, Vincent M. Le Corre, Yicheng Zhao, Shudi Qiu, Kaicheng Zhang, Frederik Schmitt, Zijian Peng, Jingjing Tian, Chaohui Li, Chao Liu, Thomas Heumueller, Larry Lüer, Jens A. Hauch, Christoph J. Brabec", "subjects": "Applied Physics (physics.app-ph); Materials Science (cond-mat.mtrl-sci)", "abstract": "Achieving high-performance perovskite photovoltaics, especially in ambient air relies heavily on optimizing process parameters. However, traditional manual methods often struggle to effectively control the key variables. This inherent challenge requires a paradigm shift toward automated platforms capable of precise and reproducible experiments. Herein, we use a fully automated device acceleration platform (DAP) to optimize the process parameters for preparing full perovskite devices using a two-step method in ambient air. Eight process parameters that have the potential to significantly influence device performance are systematically optimized. Specifically, we delve into the impact of the dispense speed of organic ammonium halide, a parameter that is difficult to control manually, on both perovskite film and device performance. Through the targeted design of experiments, we reveal that the dispense speed significantly affects device performance primarily by adjusting the residual PbI2 content in the films. We find that moderate dispense speeds, e.g., 50 {\\mu}l/s, contribute to top-performance devices. Conversely, too fast or too slow speeds result in devices with relatively poorer performance and lower reproducibility. The optimized parameter set enables us to establish a Standard Operation Procedure (SOP) for additive-free perovskite processing under ambient conditions, which yield devices with efficiencies surpassing 23%, satisfactory reproducibility, and state-of-the-art photo-thermal stability. This research underscores the importance of understanding the causality of process parameters in enhancing perovskite photovoltaic performance. Furthermore, our study highlights the pivotal role of automated platforms in discovering innovative workflows and accelerating the development of high-performing perovskite photovoltaic technologies."}
{"main_page": "https://arxiv.org/abs/2404.00117", "pdf": "https://arxiv.org/pdf/2404.00117", "title": "Spectral approaches to stress relaxation in epithelial monolayers", "authors": "Natasha Cowley, Christopher K. Revell, Emma Johns, Sarah Woolner, Oliver E. Jensen", "subjects": "Biological Physics (physics.bio-ph); Soft Condensed Matter (cond-mat.soft)", "abstract": "We investigate the viscoelastic relaxation to equilibrium of a disordered planar epithelium described using the cell vertex model. In its standard form, the model is formulated as coupled evolution equations for the locations of vertices of confluent polygonal cells. Exploiting the model's gradient-flow structure, we use singular-value decomposition to project modes of deformation of vertices onto modes of deformation of cells. We show how eigenmodes of discrete Laplacian operators (specified by constitutive assumptions related to dissipation and mechanical energy) provide a spatial basis for evolving fields, and demonstrate how the operators can incorporate approximations of conventional spatial derivatives. We relate the spectrum of relaxation times to the eigenvalues of the Laplacians, modified by corrections that account for the fact that the cell network (and therefore the Laplacians) evolve during relaxation to an equilibrium prestressed state, providing the monolayer with geometric stiffness. While dilational modes of the Laplacians capture rapid relaxation in some circumstances, showing diffusive dynamics, geometric stiffness is typically a dominant source of monolayer rigidity, as we illustrate for monolayers exposed to unsteady stretching deformations."}
{"main_page": "https://arxiv.org/abs/2404.00118", "pdf": "https://arxiv.org/pdf/2404.00118", "title": "Shape dynamics and migration of branched cells on complex networks", "authors": "Jiayi Liu, Javier Boix-Campos, Jonathan E. Ron, Johan M. Kux, Nir S. Gov, Pablo J. Sáez", "subjects": "Biological Physics (physics.bio-ph)", "abstract": "Migratory and tissue resident cells exhibit highly branched morphologies to perform their function and to adapt to the microenvironment. Immune cells, for example, display transient branched shapes while exploring the surrounding tissues. In another example, to properly irrigate the tissues, blood vessels bifurcate thereby forcing the branching of cells moving on top or within the vessels. In both cases microenvironmental constraints force migrating cells to extend several highly dynamic protrusions. Here, we present a theoretical model for the shape dynamics and migration of cells that simultaneously span several junctions, which we validated by using micropatterns with an hexagonal array, and a neuronal network image analysis pipeline to monitor the macrophages and endothelial cell shapes and migration. In our model we describe how the actin retrograde flow controls branch extension, retraction and global cell polarization. We relate the noise in this flow to the residency times and trapping of the cell at the junctions of the network. In addition, we found that macrophages and endothelial cells display very different migration regimes on the network, with macrophages moving faster and having larger changes in cell length in comparison to endothelial cells. These results expose how cellular shapes and migration are intricately coupled inside complex geometries."}
{"main_page": "https://arxiv.org/abs/2404.00134", "pdf": "https://arxiv.org/pdf/2404.00134", "title": "Polarization-based Metalenses with High Numerical Aperture and Focusing  Efficiency Utilizing Silicon-rich Nitride", "authors": "Alireza Khalilian, Bowen Yu, Yasha Yi", "subjects": "Optics (physics.optics); Applied Physics (physics.app-ph)", "abstract": "We explore the cutting-edge application of silicon-rich nitride (SRN) in the realm of high numerical aperture (NA) metalens design, focusing on the crucial role of pitch size optimization in amplifying lens efficiency through advanced simulations. Our investigation unveils how the exceptional tunable high refractive index of SRN can be harnessed to achieve significant advancements in metalens performance. By meticulously designing and simulating two innovative SRN-based metalenses - Mk1, with an NA of 0.9, reaching an impressive 75% focusing efficiency with full width at half maximum (FWHM) of 0.53{\\lambda}, and Mk2, with an NA of 0.99, achieving a 42% efficiency while maintaining an FWHM of 0.48{\\lambda}. We demonstrate the critical influence of reduced pitch size on enhancing efficiency. This study not only highlights the unparalleled potential of SRN in optimizing metalens efficiency but also represents a significant leap forward in the field of nanophotonics, offering new pathways for the development of highly efficient flat photonic devices."}
{"main_page": "https://arxiv.org/abs/2404.00136", "pdf": "https://arxiv.org/pdf/2404.00136", "title": "Tunable X-band opto-electronic synthesizer with ultralow phase noise", "authors": "Igor Kudelin, Pedram Shirmohammadi, William Groman, Samin Hanifi, Megan L. Kelleher, Dahyeon Lee, Takuma Nakamura, Charles A. McLemore, Alexander Lind, Dylan Meyer, Junwu Bai, Joe C. Campbell, Steven M. Bowers, Franklyn Quinlan, Scott A. Diddams", "subjects": "Optics (physics.optics); Signal Processing (eess.SP)", "abstract": "Modern communication, navigation, and radar systems rely on low noise and frequency-agile microwave sources. In this application space, photonic systems provide an attractive alternative to conventional microwave synthesis by leveraging high spectral purity lasers and optical frequency combs to generate microwaves with exceedingly low phase noise. However, these photonic techniques suffer from a lack of frequency tunability, and also have substantial size, weight, and power requirements that largely limit their use to laboratory settings. In this work, we address these shortcomings with a hybrid opto-electronic approach that combines simplified optical frequency division with direct digital synthesis to produce tunable low-phase-noise microwaves across the entire X-band. This results in exceptional phase noise at 10 GHz of -156 dBc/Hz at 10 kHz offset and fractional frequency instability of 1x10^-13 at 0.1 s. Spot tuning away from 10 GHz by 500 MHz, 1 GHz, and 2 GHz, yields phase noise at 10 kHz offset of -150 dBc/Hz, -146 dBc/Hz, and -140 dBc/Hz, respectively. The synthesizer architecture is fully compatible with integrated photonic implementations that will enable a versatile microwave source in a chip-scale package. Together, these advances illustrate an impactful and practical synthesis technique that shares the combined benefits of low timing noise provided by photonics and the frequency agility of established digital synthesis."}
{"main_page": "https://arxiv.org/abs/2404.00148", "pdf": "https://arxiv.org/pdf/2404.00148", "title": "Measurement of nonequilibrium vortex propagation dynamics in a nonlinear  medium", "authors": "Patrick C. Ford, Andrew A. Voitiv, Chuanzhou Zhu, Mark T. Lusk, Mark E. Siemens", "subjects": "Optics (physics.optics); Other Condensed Matter (cond-mat.other); Pattern Formation and Solitons (nlin.PS); Fluid Dynamics (physics.flu-dyn)", "abstract": "We observe and measure the nonequilibrium dynamics of optical vortices as a function of propagation distance through a nonlinear medium. The precession of a tilted-core vortex is quantified as is vortex-core sharpening, where the infinite width of a linear core subsequently shrinks and approaches the healing length of this nonlinear optical fluid. Experiments are performed with a variable-length nonlinear medium: a nonlinear fluid in a tank with an output window on a translating tube. This provides control over the distance the light propagates in the fluid and allows for the measurement of the dynamics throughout the entire propagation range. Results are compared to the predictions of a computational simulator to find the equivalent dimensionless nonlinear coefficient."}
{"main_page": "https://arxiv.org/abs/2404.00167", "pdf": "https://arxiv.org/pdf/2404.00167", "title": "Electrical double layer and capacitance of TiO2 electrolyte interfaces  from first principles simulations", "authors": "Chunyi Zhang, Marcos Calegari Andrade, Zachary K. Goldsmith, Abhinav S. Raman, Yifan Li, Pablo Piaggi, Xifan Wu, Roberto Car, Annabella Selloni", "subjects": "Chemical Physics (physics.chem-ph)", "abstract": "The electrical double layer (EDL) at aqueous solution-metal oxide interfaces critically affects many fundamental processes in electrochemistry, geology and biology, yet understanding its microscopic structure is challenging for both theory and experiments. Here we employ ab initio-based machine learning potentials including long-range electrostatics in large-scale atomistic simulations of the EDL at the TiO2-electrolyte interface. Our simulations provide a molecular-scale picture of the EDL that demonstrates the limitations of standard mean-field models. We further develop a method to accurately calculate the electrostatic potential drop at the interface. The computed capacitance originating from the adsorbed charges and the potential drop agrees with experiments, supporting the reliability of our description of the EDL. The larger interfacial capacitance of basic relative to acidic solutions originates from the higher affinity of the cations for the oxide surface and gives rise to distinct charging mechanisms on negative and positive surfaces."}
{"main_page": "https://arxiv.org/abs/2404.00229", "pdf": "https://arxiv.org/pdf/2404.00229", "title": "Rotating-modulated Higher-Order Topological States in a Split-ring  Photonic Insulator", "authors": "Hui Chang Li, Xiang Zhou, Hai Lin Chi, Wen Wen Wang, Yun Shen, Xiao Hua Deng", "subjects": "Optics (physics.optics); Applied Physics (physics.app-ph)", "abstract": "The emerging field of topology has brought device effects to a new level. Higher-order topological insulators (HOTIs) go beyond traditional descriptions of bulk-edge correspondence, broadening the understanding of topologically insulating phases. In this paper, a second-order split-ring photonic crystal (SSPC) with zero-dimensional (0D) corner states and one-dimensional (1D) edge states is proposed. Based on the coupling strength determined by the opening direction between the split-rings, the electronic transition strength of the electronic system is imitated, and the topological trivial and non-trivial transformation of the topological two-dimensional (2D) SSH model are realized by using the rotating split-ring lattice. Theory and simulation find that SSPC has non-trivial topological edge states that can be quantified by bulk polarization. As the opening direction of the split-rings gradually changes within one period, there will be transitions between four different topological polarizations of the lowest energy bands, which can be conveniently used to achieve transitions between different topological phases. Our research can be extended to higher dimensions and broaden research paths for higher-order photonic topological insulators and semimetals."}
{"main_page": "https://arxiv.org/abs/2404.00290", "pdf": "https://arxiv.org/pdf/2404.00290", "title": "The sensitivity of refractive index sensors based on defected 1D  photonic crystals: an analytical approach", "authors": "Nikolay A. Vanyushkin, I.M. Efimov, Ashot H. Gevorgyan", "subjects": "Optics (physics.optics)", "abstract": "In this paper, an analytical formula for the sensitivity of optical sensors based on one-dimensional photonic crystals (PCs) with a defect was derived for the first time. Based on this formula, a comparative analysis of the sensitivity of defected PCs with and without mirror symmetry was carried out. In addition, the exact values of sensitivity in the limit of an infinite PC with a quarter-wave unit cell were obtained. It was shown that the sensitivity of a defective PC with an infinitely thick defect layer is equal to that of a perfectly reflecting Fabry-Perot resonator and does not depend on the specific structure of the PC. The results of this work provide a significant simplification of the analysis and optimization of optical sensors based on defective PCs, as well as a better understanding of the numerous numerical results obtained previously."}
{"main_page": "https://arxiv.org/abs/2404.00304", "pdf": "https://arxiv.org/pdf/2404.00304", "title": "Ultrafast Kapitza-Dirac effect", "authors": "Kang Lin, Sebastian Eckart, Hao Liang, Alexander Hartung, Sina Jacob, Qinying Ji, Lothar Ph. H. Schmidt, Markus S. Schöffler, Till Jahnke, Maksim Kunitski, Reinhard Dörner", "subjects": "Optics (physics.optics); Atomic Physics (physics.atom-ph)", "abstract": "Similar to the optical diffraction of light passing through a material grating, the Kapitza-Dirac effect occurs when an electron is diffracted by a standing light wave. In its original description the effect is time-independent. In the present work, we extend the Kapitza-Dirac concept to the time domain. By tracking the spatiotemporal evolution of a pulsed electron wave packet diffracted by a femtosecond (10 15 second) standing wave pulse in a pump-probe scheme, we observe so far unseen time-dependent diffraction patterns. The fringe spacing in the observed pattern differs from that generated by the conventional Kapitza-Dirac effect, moreover it decreases as the pump-probe delay time increases. By exploiting this time-resolved diffraction scheme, we gather access to the time evolution of the previously inaccessible phase properties of a free electron."}
{"main_page": "https://arxiv.org/abs/2404.00315", "pdf": "https://arxiv.org/pdf/2404.00315", "title": "Predicting the statistical error of analog particle tracing Monte Carlo", "authors": "Vince Maes, Ignace Bossuyt, Hannes Vandecasteele, Wouter Dekeyser, Julian Koellermeier, Martine Baelmans, Giovanni Samaey", "subjects": "Computational Physics (physics.comp-ph); Numerical Analysis (math.NA)", "abstract": "Large particle systems are often described by high-dimensional (linear) kinetic equations that are simulated using Monte Carlo methods for which the asymptotic convergence rate is independent of the dimensionality. Even though the asymptotic convergence rate is known, predicting the actual value of the statistical error remains a challenging problem. In this paper, we show how the statistical error of an analog particle tracing Monte Carlo method can be calculated (expensive) and predicted a priori (cheap) when estimating quantities of interest (QoI) on a histogram. We consider two types of QoI estimators: point estimators for which each particle provides one independent contribution to the QoI estimates, and analog estimators for which each particle provides multiple correlated contributions to the QoI estimates. The developed statistical error predictors can be applied to other QoI estimators and nonanalog simulation routines as well. The error analysis is based on interpreting the number of particle visits to a histogram bin as the result of a (correlated) binomial experiment. The resulting expressions can be used to optimize (non)analog particle tracing Monte Carlo methods and hybrid simulation methods involving a Monte Carlo component, as well as to select an optimal particle tracing Monte Carlo method from several available options. Additionally, the cheap statistical error predictors can be used to determine a priori the number of particles N that is needed to reach a desired accuracy. We illustrate the theory using a linear kinetic equation describing neutral particles in the plasma edge of a fusion device and show numerical results. The code used to perform the numerical experiments is openly available."}
{"main_page": "https://arxiv.org/abs/2404.00317", "pdf": "https://arxiv.org/pdf/2404.00317", "title": "Single track orbit determination analysis for low Earth orbit with  approximated J2 dynamics", "authors": "Jose M. Montilla, Jan A. Siminski, Rafael Vazquez", "subjects": "Space Physics (physics.space-ph)", "abstract": "In the domain of Space Situational Awareness (SSA), the challenges pertaining to orbit determination and catalog correlation are notably pronounced, partly attributable to the escalating presence of non-cooperative satellites engaging in unspecified maneuvers at irregular intervals. This study introduces an initial orbit determination methodology reliant upon data obtained from a single surveillance radar, such as the Spanish Space Surveillance and Tracking Surveillance Radar (S3TSR). The need for fast algorithms within an operational context is considered here as the main design driver. The result is a least-squares fitting procedure that incorporates an analytically formulated approximation of the dynamics under the J2 perturbation, valid for short-term propagation. The algorithm makes use of all available observables, including range-rate, which makes it distinct from other similar methods. The method is compared in a battery of synthetic tests against a classical range and angles fitting method (GTDS) to study the effect of the track length and density of measurements on the full state estimation. The presented methodology is quite versatile, and it is leveraged to improve the estimation quality by adding information of the object's orbital plane obtained from predictions. The resulting method has been named OPOD."}
{"main_page": "https://arxiv.org/abs/2404.00331", "pdf": "https://arxiv.org/pdf/2404.00331", "title": "Investigation of self-focusing of Gaussian laser beams within magnetized  plasma via source-dependent expansion method", "authors": "A. A. Molavi Choobini, S. S. Ghaffari-Oskooei", "subjects": "Plasma Physics (physics.plasm-ph)", "abstract": "Self-focusing emerges as a nonlinear optical phenomenon resulting from an intense laser field and plasma interaction. This study investigates the self-focusing behavior of Gaussian laser beams within magnetized plasma environments utilizing a novel approach, source-dependent expansion. By employing source-dependent expansion, we explore the intricate dynamics of laser beam propagation, considering the influence of plasma density and external magnetic fields. The interplay between the beam's Gaussian profile and the self-focusing mechanism through rigorous mathematical analysis and numerical simulations, particularly in the presence of plasma-induced nonlinearities are elucidated here. Our findings reveal crucial insights into the evolution of laser beams under diverse parameters, the ponderomotive force, relativistic factors, plasma frequency, polarization states, external magnetic field, wavelength, and laser intensity. This research not only contributes to advancing our fundamental understanding of laser-plasma interactions but also holds promise for optimizing laser-driven applications."}
{"main_page": "https://arxiv.org/abs/2404.00355", "pdf": "https://arxiv.org/pdf/2404.00355", "title": "Design and production of a free-form lens for long range LED  illumination", "authors": "Ahmet Bingül, Mehmet Adıyaman", "subjects": "Optics (physics.optics)", "abstract": "In this study, a procedure for designing a free-form lens for long-range LED illumination is presented. The geometrical form of the proposed lens is obtained by minimizing optical path lengths of the rays emitted from a point-like light source. Optical ray tracing simulations of two different LEDs and the free-form lens are performed by using Zemax OpticStudio. In addition, the prototype of the free-form lens is manufactured by the plastic injection molding method using PMMA material. Nine of the lenses are used to build an LED projector in the form of a 3x3 lens matrix. The optical measurements of the projector are compared with the results predicted in the simulations. It is found that the beam divergence of the projector is less than 10 degrees when using suitable LEDs in visible and near infrared regions."}
{"main_page": "https://arxiv.org/abs/2404.00388", "pdf": "https://arxiv.org/pdf/2404.00388", "title": "Approximation of the electronic terms of diatomic molecules by the Morse  function. The role of anharmonicity. II. Simple terms", "authors": "G. S. Denisov, R. E. Asfin", "subjects": "Chemical Physics (physics.chem-ph)", "abstract": "This article continues the series of works by the authors on the approximation of the electronic terms of diatomic molecules by the Morse formula, which is the simplest anharmonic approximation of the real term U(r). Depending on the choice of parameters, the approximation has two alternative solutions M1(r) and M2(r), with different patterns of deviations from the real term and its vibrational structure. The difference {\\delta}(r)=U(r)-M(r) quantitatively shows the changes in the shape of the terms during approximation. We introduced an empirical anharmonicity function -2{\\omega}_e x(v), which characterizes the positions of vibrational levels in the potential well; it demonstrates the distortion of the vibrational structure of the term U(r) during the approximation. Based on the data from literature, the functions {\\delta}(r) and -2{\\omega}_e x(v) were constructed for more than 20 molecules. Here we present a group of simple terms with minimal deviations from the Morse shape."}
{"main_page": "https://arxiv.org/abs/2404.00411", "pdf": "https://arxiv.org/pdf/2404.00411", "title": "Aardvark Weather: end-to-end data-driven weather forecasting", "authors": "Anna Vaughan, Stratis Markou, Will Tebbutt, James Requeima, Wessel P. Bruinsma, Tom R. Andersson, Michael Herzog, Nicholas D. Lane, J. Scott Hosking, Richard E. Turner", "subjects": "Atmospheric and Oceanic Physics (physics.ao-ph); Machine Learning (cs.LG)", "abstract": "Machine learning is revolutionising medium-range weather prediction. However it has only been applied to specific and individual components of the weather prediction pipeline. Consequently these data-driven approaches are unable to be deployed without input from conventional operational numerical weather prediction (NWP) systems, which is computationally costly and does not support end-to-end optimisation. In this work, we take a radically different approach and replace the entire NWP pipeline with a machine learning model. We present Aardvark Weather, the first end-to-end data-driven forecasting system which takes raw observations as input and provides both global and local forecasts. These global forecasts are produced for 24 variables at multiple pressure levels at one-degree spatial resolution and 24 hour temporal resolution, and are skillful with respect to hourly climatology at five to seven day lead times. Local forecasts are produced for temperature, mean sea level pressure, and wind speed at a geographically diverse set of weather stations, and are skillful with respect to an IFS-HRES interpolation baseline at multiple lead-times. Aardvark, by virtue of its simplicity and scalability, opens the door to a new paradigm for performing accurate and efficient data-driven medium-range weather forecasting."}
{"main_page": "https://arxiv.org/abs/2404.00413", "pdf": "https://arxiv.org/pdf/2404.00413", "title": "Language Models are Spacecraft Operators", "authors": "Victor Rodriguez-Fernandez, Alejandro Carrasco, Jason Cheng, Eli Scharf, Peng Mun Siew, Richard Linares", "subjects": "Space Physics (physics.space-ph); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)", "abstract": "Recent trends are emerging in the use of Large Language Models (LLMs) as autonomous agents that take actions based on the content of the user text prompts. We intend to apply these concepts to the field of Guidance, Navigation, and Control in space, enabling LLMs to have a significant role in the decision-making process for autonomous satellite operations. As a first step towards this goal, we have developed a pure LLM-based solution for the Kerbal Space Program Differential Games (KSPDG) challenge, a public software design competition where participants create autonomous agents for maneuvering satellites involved in non-cooperative space operations, running on the KSP game engine. Our approach leverages prompt engineering, few-shot prompting, and fine-tuning techniques to create an effective LLM-based agent that ranked 2nd in the competition. To the best of our knowledge, this work pioneers the integration of LLM agents into space research. Code is available at https://github.com/ARCLab-MIT/kspdg."}
{"main_page": "https://arxiv.org/abs/2404.00453", "pdf": "https://arxiv.org/pdf/2404.00453", "title": "Predictability of climate anomalies in the regions of Northern Eurasia  in the spring-summer months in 2024 in connection with El Nino", "authors": "I.I. Mokhov", "subjects": "Atmospheric and Oceanic Physics (physics.ao-ph)", "abstract": "The predictability of climate anomalies in the regions of Northern Eurasia in connection with El Nino phenomena is analyzed. Particular attention is paid to the most likely transition in 2024 from an El Nino phase at the beginning of the year to a La Nina phase at the end of the year, with the greatest probability of high temperatures and dry conditions in European Russia during the spring and summer months, as in 2010. The predictability levels of regional climate anomalies using different El Nino indices are compared. The relationship of the noted seasonal anomalies with atmospheric blockings is considered, taking into account the different phases of the key modes of climate variability like El Nino phenomena and the Pacific Decadal Oscillation. Changes in the predictability of regional climate anomalies under global climate change are discussed."}
{"main_page": "https://arxiv.org/abs/2404.00467", "pdf": "https://arxiv.org/pdf/2404.00467", "title": "Characterization of uncertainties in electron-argon collision cross  sections under statistical principles", "authors": "Seung Whan Chung, Todd A. Oliver, Laxminarayan L. Raja, Robert D. Moser", "subjects": "Plasma Physics (physics.plasm-ph); Data Analysis, Statistics and Probability (physics.data-an)", "abstract": "The predictive capability of a plasma discharge model depends on accurate representations of electron-impact collision cross sections, which determine the key reaction rates and transport properties of the plasma. Although many cross sections have been identified through experiments and quantum mechanical simulations, their uncertainties are not well-investigated. We characterize the uncertainties in electron-argon collision cross sections using a Bayesian framework. Six collision processes -- elastic momentum transfer, ionization, and four excitations -- are characterized with semi-empirical models, whose parametric uncertainties effectively capture the features important to the macroscopic properties of the plasma, namely transport properties and chemical reaction rates. The method is designed to capture the effects of systematic errors that lead to large discrepancies between some data sets. Specifically, for the purposes of Bayesian inference, each of the parametric cross section models is augmented with a Gaussian process representing systematic measurement errors as well as model inadequacies in the parametric form. The results show that the method is able to capture scatter in the data between the electron-beam experiments and ab-initio quantum simulations. The calibrated cross section models are further validated against measurements from swarm-parameter experiments."}
{"main_page": "https://arxiv.org/abs/2404.00471", "pdf": "https://arxiv.org/pdf/2404.00471", "title": "Score-Based Diffusion Models for Photoacoustic Tomography Image  Reconstruction", "authors": "Sreemanti Dey, Snigdha Saha, Berthy T. Feng, Manxiu Cui, Laure Delisle, Oscar Leong, Lihong V. Wang, Katherine L. Bouman", "subjects": "Medical Physics (physics.med-ph); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Image and Video Processing (eess.IV)", "abstract": "Photoacoustic tomography (PAT) is a rapidly-evolving medical imaging modality that combines optical absorption contrast with ultrasound imaging depth. One challenge in PAT is image reconstruction with inadequate acoustic signals due to limited sensor coverage or due to the density of the transducer array. Such cases call for solving an ill-posed inverse reconstruction problem. In this work, we use score-based diffusion models to solve the inverse problem of reconstructing an image from limited PAT measurements. The proposed approach allows us to incorporate an expressive prior learned by a diffusion model on simulated vessel structures while still being robust to varying transducer sparsity conditions."}
{"main_page": "https://arxiv.org/abs/2404.00472", "pdf": "https://arxiv.org/pdf/2404.00472", "title": "Chaotic dynamics under the influence of synthetic magnetic field in  optomechanical system", "authors": "Souvik Mondal, Murilo S. Baptista, Kapil Debnath", "subjects": "Optics (physics.optics)", "abstract": "The optomechanical systems produce chaotic behaviour due to nonlinear interaction between photons and phonons, and the same systems are used to understand the synthetic fields as well. Here, we report on the study of chaotic behaviour in the presence of a phononic synthetic magnetic field in a closed loop configuration consisting of a single optical mode and two mechanical modes. The modulation phase of the mechanical coupling between the two mechanical modes plays a critical role in determining the mechanical and optical intensity dynamics in the nonlinear regime. Our study shows the dark mode breaking effect in the presence of a synthetic magnetic field, which brings about a complex way of mechanical energy exchange that causes the cavity field to alternate between chaotic and regular behaviour periodically in temporal domain. Besides, with the advent of advanced fabrication technologies, this study holds promises in developing phase tunable integrated low-power chaotic light sources to support efficient optical secure communication systems."}
{"main_page": "https://arxiv.org/abs/2404.00480", "pdf": "https://arxiv.org/pdf/2404.00480", "title": "A New Thermodynamic Approach to Multimode Fibre Self-cleaning and  Soliton Condensation", "authors": "Mario Zitelli", "subjects": "Optics (physics.optics)", "abstract": "A new thermodynamic theory for optical multimode systems is proposed. Theory is based on a weighted Bose-Einstein law, and includes the state equation, the fundamental equation for the entropy and a metric to measure the accuracy of the thermodynamic approach. The theory is used to compare the experimental results of two propagation regimes in multimode fibres, specifically the self-cleaning in the normal chromatic dispersion region and the soliton condensation in the anomalous dispersion region. Surprising similarities are found in terms of thermodynamic parameters, suggesting a common basis for the thermalisation processes observed in the two propagation regimes."}
{"main_page": "https://arxiv.org/abs/2404.00545", "pdf": "https://arxiv.org/pdf/2404.00545", "title": "Unified, Verifiable Neural Simulators for Electromagnetic Wave Inverse  Problems", "authors": "Charles Dove, Jatearoon Boondicharern, Laura Waller", "subjects": "Optics (physics.optics); Machine Learning (cs.LG); Image and Video Processing (eess.IV)", "abstract": "Simulators based on neural networks offer a path to orders-of-magnitude faster electromagnetic wave simulations. Existing models, however, only address narrowly tailored classes of problems and only scale to systems of a few dozen degrees of freedom (DoFs). Here, we demonstrate a single, unified model capable of addressing scattering simulations with thousands of DoFs, of any wavelength, any illumination wavefront, and freeform materials, within broad configurable bounds. Based on an attentional multi-conditioning strategy, our method also allows non-recurrent supervision on and prediction of intermediate physical states, which provides improved generalization with no additional data-generation cost. Using this O(1)-time intermediate prediction capability, we propose and prove a rigorous, efficiently computable upper bound on prediction error, allowing accuracy guarantees at inference time for all predictions. After training solely on randomized systems, we demonstrate the unified model across a suite of challenging multi-disciplinary inverse problems, finding strong efficacy and speed improvements up to 96% for problems in optical tomography, beam shaping through volumetric random media, and freeform photonic inverse design, with no problem-specific training. Our findings demonstrate a path to universal, verifiably accurate neural surrogates for existing scattering simulators, and our conditioning and training methods are directly applicable to any PDE admitting a time-domain iterative solver."}
{"main_page": "https://arxiv.org/abs/2404.00556", "pdf": "https://arxiv.org/pdf/2404.00556", "title": "Restriction-induced time-dependent transcytolemmal water exchange:  Revisiting the Kärger exchange model", "authors": "Diwei Shi, Fan Liu, Sisi Li, Li Chen, Xiaoyu Jiang, John C. Gore, Quanshui Zheng, Hua Guo, Junzhong Xu", "subjects": "Medical Physics (physics.med-ph); Biological Physics (physics.bio-ph)", "abstract": "The K\\\"arger model and its derivatives have been widely used to incorporate transcytolemmal water exchange rate, an essential characteristic of living cells, into analyses of diffusion MRI (dMRI) signals from tissues. The K\\\"arger model consists of two homogeneous exchanging components coupled by an exchange rate constant and assumes measurements are made with sufficiently long diffusion time and slow water exchange. Despite successful applications, it remains unclear whether these assumptions are generally valid for practical dMRI sequences and biological tissues. In particular, barrier-induced restrictions to diffusion produce inhomogeneous magnetization distributions in relatively large-sized compartments such as cancer cells, violating the above assumptions. The effects of this inhomogeneity are usually overlooked. We performed computer simulations to quantify how restriction effects, which in images produce edge enhancements at compartment boundaries, influence different variants of the K\\\"arger-model. The results show that the edge enhancement effect will produce larger, time-dependent estimates of exchange rates in e.g., tumors with relatively large cell sizes (>10 {\\mu}m), resulting in overestimations of water exchange as previously reported. Moreover, stronger diffusion gradients, longer diffusion gradient durations, and larger cell sizes, all cause more pronounced edge enhancement effects. This helps us to better understand the feasibility of the K\\\"arger model in estimating water exchange in different tissue types and provides useful guidance on signal acquisition methods that may mitigate the edge enhancement effect. This work also indicates the need to correct the overestimated transcytolemmal water exchange rates obtained assuming the K\\\"arger-model."}
{"main_page": "https://arxiv.org/abs/2404.00616", "pdf": "https://arxiv.org/pdf/2404.00616", "title": "Prospects of nuclear-coupled-dark-matter detection via correlation  spectroscopy of I$_2^+$ and Ca$^+$", "authors": "Eric Madge, Gilad Perez, Ziv Meir", "subjects": "Atomic Physics (physics.atom-ph); High Energy Physics - Phenomenology (hep-ph)", "abstract": "The nature of dark matter (DM) and its interaction with the Standard Model (SM) is one of the biggest open questions in physics nowadays. The vast majority of theoretically-motivated Ultralight-DM (ULDM) models predict that ULDM couples dominantly to the SM strong/nuclear sector. This coupling leads to oscillations of nuclear parameters that are detectable by comparing clocks with different sensitivities to these nature's constants. Vibrational transitions of molecular clocks are more sensitive to a change in the nuclear parameters than the electronic transitions of atomic clocks. Here, we propose the iodine molecular ion, I$_2^+$, as a sensitive detector for such a class of ULDM models. The iodine's dense spectrum allows us to match its transition frequency to that of an optical atomic clock (Ca$^+$) and perform correlation spectroscopy between the two clock species. With this technique, we project a few-orders-of-magnitude improvement over the most sensitive clock comparisons performed to date. We also briefly consider the robustness of the corresponding \"Earth-bound\" under modifications of the $Z_N$-QCD axion model."}
{"main_page": "https://arxiv.org/abs/2404.00705", "pdf": "https://arxiv.org/pdf/2404.00705", "title": "Small-angle scattering interferometry with neutron orbital angular  momentum states", "authors": "Dusan Sarenac, Melissa E. Henderson, Huseyin Ekinci, Charles W. Clark, David G. Cory, Lisa DeBeer-Schmitt, Michael G. Huber, Owen Lailey, Jonathan S. White, Kirill Zhernenkov, Dmitry A. Pushin", "subjects": "Applied Physics (physics.app-ph); Optics (physics.optics)", "abstract": "Access to the neutron orbital degree of freedom has been enabled by the recent actualization of methods to prepare and characterize neutron helical waves carrying orbital angular momentum (OAM) at small-angle neutron scattering (SANS) facilities. This provides new avenues of exploration in fundamental science experiments as well as in material characterization applications. However, it remains a challenge to recover phase profiles from SANS measurements. We introduce and demonstrate a novel neutron interferometry technique for extracting phase information that is typically lost in SANS measurements. An array of reference beams, with complementary structured phase profiles, are put into a coherent superposition with the array of object beams, thereby manifesting the phase information in the far-field intensity profile. We demonstrate this by resolving petal-structure signatures of helical wave interference for the first time: an implementation of the long-sought recovery of phase information from small-angle scattering measurements."}
{"main_page": "https://arxiv.org/abs/2404.00708", "pdf": "https://arxiv.org/pdf/2404.00708", "title": "Representation of fields in inhomogeneous structured waveguides", "authors": "M. I. Ayzatsky", "subjects": "Accelerator Physics (physics.acc-ph); Computational Physics (physics.comp-ph); Optics (physics.optics)", "abstract": "In this work we present the results of a study of the possibility of using a homogeneous basis and a new generalization of coupled modes theory to describe non-periodic structured waveguides. It was shown that for the studied inhomogeneities the single wave approximation gives good results. Within the framework of single wave approximation, the fields are represented as the sum of two components, one of which is associated with the forward eigen wave, and the second with the backward eigen wave. But this second component is not a backward wave. Because of the coupling, characteristics of this component are determined by the first component, which is significantly larger than the second."}
{"main_page": "https://arxiv.org/abs/2404.00730", "pdf": "https://arxiv.org/pdf/2404.00730", "title": "Long-range dipole-dipole exchange-induced atomic grating", "authors": "Xuan-Qian Bao, Xue-Dong Tian, Dong-Xiao Li, Yi-Mou Liu", "subjects": "Atomic Physics (physics.atom-ph); Quantum Physics (quant-ph)", "abstract": "We propose a theoretical scheme for dipole exchange-induced grating (DEIG) based on a hybrid system consisting of ultra-cold Rubidium ($^{87}$Rb) atomic ensemble and movable Rydberg spin atoms. The optical response of the grating appears as a superposition of three- and four-level configurations, similar to the cooperative optical nonlinear effect caused by the dipole blockade effect. However, such Rydberg atomic grating uniquely responds to the spatial positions of spin atoms, offering a novel approach to dynamically control electromagnetically induced gratings (EIG) except for input probe intensity."}
{"main_page": "https://arxiv.org/abs/2404.00749", "pdf": "https://arxiv.org/pdf/2404.00749", "title": "Causal dependencies and Shannon entropy budget -- Analysis of a reduced  order atmospheric model", "authors": "Stéphane Vannitsem, Carlos A. Pires, David Docquier", "subjects": "Atmospheric and Oceanic Physics (physics.ao-ph); Chaotic Dynamics (nlin.CD)", "abstract": "The information entropy budget and the rate of information transfer between variables is studied in the context of a nonlinear reduced-order atmospheric model. The key ingredients of the dynamics are present in this model, namely the baroclinic and barotropic instabilities, the instability related to the presence of an orography, the dissipation related to the surface friction, and the large-scale meridional imbalance of energy. For the parameter chosen, the solutions of this system display a chaotic dynamics reminiscent of the large-scale atmospheric dynamics in the extra-tropics. The detailed information entropy budget analysis of this system reveals that the linear rotation terms plays a minor role in the generation of uncertainties as compared to the orography and the surface friction. Additionally, the dominant contribution comes from the nonlinear advection terms, and their decomposition in synergetic (co-variability) and single (impact of each single variable on the target one) components reveals that for some variables the co-variability dominates the information transfer. The estimation of the rate of information transfer based on time series is also discussed, and an extension of the Liang's approach to nonlinear observables, is proposed."}
{"main_page": "https://arxiv.org/abs/2404.00754", "pdf": "https://arxiv.org/pdf/2404.00754", "title": "Imitation dynamics and the replicator equation", "authors": "José F. Fontanari", "subjects": "Physics and Society (physics.soc-ph); Adaptation and Self-Organizing Systems (nlin.AO); Populations and Evolution (q-bio.PE)", "abstract": "Evolutionary game theory has impacted many fields of research by providing a mathematical framework for studying the evolution and maintenance of social and moral behaviors. This success is owed in large part to the demonstration that the central equation of this theory - the replicator equation - is the deterministic limit of a stochastic imitation (social learning) dynamics. Here we offer an alternative elementary proof of this result, which holds for the scenario where players compare their instantaneous (not average) payoffs to decide whether to maintain or change their strategies, and only more successful individuals can be imitated."}
{"main_page": "https://arxiv.org/abs/2404.00770", "pdf": "https://arxiv.org/pdf/2404.00770", "title": "Low-loss liquid metal interconnects for modular superconducting quantum  systems", "authors": "Zhancheng Yao, Martin Sandberg, David W. Abraham, David J. Bishop", "subjects": "Applied Physics (physics.app-ph); Quantum Physics (quant-ph)", "abstract": "Building modular architecture with superconducting quantum computing chips is one of the means to achieve qubit scalability, allowing the screening, selection, replacement, and integration of individual qubit modules into large quantum systems. However, the non-destructive replacement of modules within a compact architecture remains a challenge. Liquid metals (LM), specifically gallium alloys, can be alternatives to solid-state galvanic interconnects. This is motivated by their self-healing, self-aligning, and other desirable fluidic properties, potentially enabling non-destructive replacement of modules at room temperatures, even after operating the entire system at millikelvin regimes. In this study, we present high-internal-quality-factor coplanar waveguide resonators (CPWR) interconnected by gallium alloy droplets, demonstrating performance on par with the continuous solid-state CPWRs. Leveraging the desirable fluidic properties of gallium alloys at room temperature and their compact design, we envision a modular quantum system enabled by liquid metals."}
{"main_page": "https://arxiv.org/abs/2404.00772", "pdf": "https://arxiv.org/pdf/2404.00772", "title": "One Stone, Two Birds: Using Vapor Kinetic Energy to Detect and  Understand Atmospheric Rivers", "authors": "Hing Ong, Da Yang", "subjects": "Atmospheric and Oceanic Physics (physics.ao-ph)", "abstract": "Poleward water vapor transport in the midlatitudes mainly occurs in meandering filaments of intense water vapor transport, spanning thousands of kilometers long and hundreds of kilometers wide and drifting eastward. The water vapor filaments are known as atmospheric rivers (ARs). They can cause extreme wind gusts, intense precipitation, and flooding along densely populated coastal regions. Many recent studies about ARs focused on the statistical analyses of ARs, but a process-level understanding of ARs remains elusive. Here we show that ARs are streams of air with enhanced vapor kinetic energy (VKE) and derive a governing equation for Integrated VKE (IVKE) to understand what contributes to the evolution of ARs. We find that ARs grow mainly because of potential energy conversion to kinetic energy, decay largely owing to condensation and turbulence, and the eastward drift is primarily due to horizontal advection of VKE. Our VKE framework complements the integrated vapor transport framework, which is popular for identifying ARs but lacks a prognostic equation for understanding the physical processes."}
{"main_page": "https://arxiv.org/abs/2404.00787", "pdf": "https://arxiv.org/pdf/2404.00787", "title": "Effect of cathode porosity on the Lithium air cell oxygen reduction  reaction", "authors": "Jeongwook Seo, Shrihari Sankarasubramanian, Nikhilendra Singh, Fuminori Mizuno, Kensuke Takechi, Jai Prakash", "subjects": "Chemical Physics (physics.chem-ph); Materials Science (cond-mat.mtrl-sci)", "abstract": "The kinetics of the oxygen reduction reaction (ORR) on the practical air cathode in a Lithium air cell, which is conventionally composed of porous carbon with or without catalysts supported on it, was investigated. The mechanism and kinetics of the oxygen reduction reaction (ORR) was studied on a porous carbon electrode in an oxygen saturated solution of 0.1M Lithium bis-trifluoromethanesulfonimidate (LiTFSI) in Dimethoxyethane (DME) using cyclic voltammetery (CV) and the rotating ring-disk electrode (RRDE) technique. The oxygen reduction and evolution reactions were found to occur at similar potentials to those observed on a smooth, planar glassy carbon (GC) electrode. The effect of the porosity and the resultant increase in surface area were readily observed in the increase in the transient time required for the intermediates to reach the ring and the much larger disk currents (compared to smooth, planar GC) recorded respectively. The RRDE data was analyzed using a kinetic model previously developed by us and the rate constant of the elementary reactions calculated. The rates constant for the electrochemical reactions were found to be similar in magnitude to the rate constants calculated for smooth GC disks. The porosity of the electrode was found to decrease the rate of desorption of the intermediate and the product and delay their diffusion by shifting it from a Fickian regime in the electrolyte bulk to the Knudsen regime in the film pores. Thus, it is shown that the effect of the electrode porosity on the kinetics of the ORR is physical rather than electrochemical."}
{"main_page": "https://arxiv.org/abs/2404.00800", "pdf": "https://arxiv.org/pdf/2404.00800", "title": "Methane and oxygen from energy-efficient, low temperature in situ  resource utilization enables missions to Mars", "authors": "M. Shahid, B. Chambers, S. Sankarasubramanian", "subjects": "Chemical Physics (physics.chem-ph); Materials Science (cond-mat.mtrl-sci)", "abstract": "NASA mandate is a human mission to Mars in the 2030s and sustained exploration of Mars requires in-situ resource utilization (ISRU). Exploiting the Martian water cycle (alongside perchlorate salts that depress the freezing point of water to less than 213K) and the available 95 volume percent atmospheric CO2, we detail an ultra-low temperature (255K) CO2-H2O electrolyzer to produce methane fuel and life-supporting oxygen on Mars. Methane production is thermodynamically favored across a range of operational pressures and temperatures and our electrolyzer polarization model concurred with reported experimental performance. A hypothetical 10-cell, 100 square cm electrode-area-per-cell electrolyzer produced 0.31g per W per day of CH4 and 3.54g per W per day of O2 at 2V per cell (operating voltage) versus 0.8g per W per day of O2 produced by the Mars Oxygen in-situ Resource Utilization Experiment (MOXIE) from the Mars 2020 mission (MOXIE produces no fuel). Material performance requirements are presented to show that this technology is an energy-efficient complement to the MOXIE high temperature approach."}
{"main_page": "https://arxiv.org/abs/2404.00802", "pdf": "https://arxiv.org/pdf/2404.00802", "title": "The Mechanics and Physics of Twisted and Coiled Polymer Actuators", "authors": "Qiong Wang, Anan Ghrayeb, SeongHyeon Kim, Liuyang Cheng, Sameh Tawfick", "subjects": "Applied Physics (physics.app-ph)", "abstract": "Twisted and coiled polymer actuators (TCPAs) generate large contractile mechanical work mimicking natural muscles, which makes them suitable for robotics and health-assistive devices. Understanding the mechanism of nylon TCPA remains challenging due to the interplay between their intricate geometry, chirality, residual stresses, and material microstructure. This study integrates a material microstructure model with rod theory to analytically predict the equilibrium helical shape of the nylon TCPA after fabrication and to explain the observed contraction mechanism upon stimulation. The first ingredient of the model is to treat nylon as a two-phase thermomechanical microstructure system capable of storing strain energy and exchanging it among the two phases. This is validated by characterizing the torsional actuation response of twisted and annealed nylon fibers. The second ingredient of the model is to use the classic Kirchhoff Rod Theory and add a necessary term that couples the bending and twisting energy. Validation with experiments shows that the model captures the equilibrium and longitudinal stiffness of the TCPA in both active and passive states, and the stimulated contraction under external load. Importantly, the model quantifies the influence of the stored energy level on the actuation performance. These concepts can be extended to other types of TCPAs and could enable new material design."}
{"main_page": "https://arxiv.org/abs/2404.00813", "pdf": "https://arxiv.org/pdf/2404.00813", "title": "Unraveling subsurface crustal dynamics: exploring electrical and seismic  refraction methods from theories to existing and machine learning-based  emerging prospects", "authors": "Adedibu Sunny Akingboye", "subjects": "Geophysics (physics.geo-ph)", "abstract": "This comprehensive review explores electrical and seismic refraction methods, including their emerging techniques, namely electrical resistivity tomography (ERT) and seismic refraction tomography (SRT). It discusses their crucial roles in understanding surface-subsurface crustal dynamics, outlining their principles, strengths, and limitations. Additionally, it provides insights into the induced polarization method and briefly discusses the self-potential method. The review thoroughly examines the mapping of surface-subsurface resistivity and velocity structures, crucial for comprehending Earth's surface, deep crustal, and hazard processes. Despite the numerous benefits of these techniques, challenges persist, necessitating multidisciplinary approaches due to lithology heterogeneities, geological process nuances, and geophysical data uncertainties. Hence, the emergence of machine learning and deep learning in ERT and SRT significantly enhances their accuracy in inversion modeling and geological feature identification. This integration of domain-specific knowledge with data- and image-driven approaches effectively addresses subsurface characterization challenges. Case studies utilizing real-time field electrical and seismic P-wave velocity datasets illustrate concepts, accompanied by the development of new methodological frameworks and analytical modeling. These frameworks provide systematic data modeling, facilitating velocity-resistivity relationships for enhanced geological characterization. This evidence underscores the importance of leveraging state-of-the-art techniques to obtain a broader range of parameters for subsurface structure delineation, environmental risk assessment, and informed decision-making. Ongoing research innovation is anticipated to continue improving capabilities in subsurface geophysical exploration."}
{"main_page": "https://arxiv.org/abs/2404.00817", "pdf": "https://arxiv.org/pdf/2404.00817", "title": "CRES-Based Non-destructive Electron Momentum Estimation for the PTOLEMY  Relic Neutrino Detector", "authors": "Yuno Iwasaki, Andi Tan, Christopher G. Tully (PTOLEMY Collaboration)", "subjects": "Instrumentation and Detectors (physics.ins-det); Nuclear Experiment (nucl-ex)", "abstract": "The novel electron spectrometry method proposed by the PTOLEMY relic neutrino experiment requires a real-time, non-destructive estimate of the parallel and transverse momentum splits of tritium $\\beta$-decay electrons. We propose to obtain this estimate using cyclotron-radiation emission spectroscopy (CRES), in which the kinetic energy of a charged particle is determined by measuring the relativistic frequency shift of the cyclotron radiation emitted by the particle in a magnetic field. This paper presents the first design for a configuration that can be feasibly integrated directly into the existing design for the transverse drift filter proposed by the PTOLEMY collaboration. We propose a geometry incorporating a cavity resonator to enhance a ${\\sim}\\mathcal{O}(1) \\hspace{1mm}\\mathrm{fW}$ cyclotron radiation signal and derive key features of the expected observed radiation specific to our RF tracking configuration. We estimate the performance of our design using electromagnetic simulations and present a general signal reconstruction algorithm capable of matching an observed signal to electron kinematic parameters. The projected SNR of this technique demonstrates for the first time that a non-destructive RF tracking system is applicable for the suppression of backgrounds in a differential energy measurement of tritium endpoint electrons."}
{"main_page": "https://arxiv.org/abs/2404.00866", "pdf": "https://arxiv.org/pdf/2404.00866", "title": "Nonlinear trend of COVID-19 infection time series", "authors": "Fumihiko Ishiyama", "subjects": "Physics and Society (physics.soc-ph); Populations and Evolution (q-bio.PE)", "abstract": "We have developed a nonlinear method of time series analysis that allows us to obtain multiple nonlinear trends without harmonics from a given set of numerical data. We propose to apply the method to recognize the ongoing status of COVID-19 infection with an analytical equation for nonlinear trends. We found that there is only a single nonlinear trend, and this result justifies the use of a week-based infection growth rate. In addition, the fit with the obtained analytical equation for the nonlinear trend holds for a duration of more than three months for the Delta variant infection time series. The fitting also visualizes the transition to the Omicron variant."}
{"main_page": "https://arxiv.org/abs/2404.00905", "pdf": "https://arxiv.org/pdf/2404.00905", "title": "Continuously tunable uniaxial strain control of van der Waals  heterostructure devices", "authors": "Zhaoyu Liu, Xuetao Ma, John Cenker, Jiaqi Cai, Zaiyao Fei, Paul Malinowski, Joshua Mutch, Yuzho Zhao, Kyle Hwangbo, Zhong Lin, Arnab Manna, Jihui Yang, David Cobden, Xiaodong Xu, Matthew Yankowitz, Jiun-Haw Chu", "subjects": "Instrumentation and Detectors (physics.ins-det)", "abstract": "Uniaxial strain has been widely used as a powerful tool for investigating and controlling the properties of quantum materials. However, existing strain techniques have so far mostly been limited to use with bulk crystals. Although recent progress has been made in extending the application of strain to two-dimensional van der Waals (vdW) heterostructures, these techniques have been limited to optical characterization and extremely simple electrical device geometries. Here, we report a piezoelectric-based in-situ uniaxial strain technique enabling simultaneous electrical transport and optical spectroscopy characterization of dual-gated vdW heterostructure devices. Critically, our technique remains compatible with vdW heterostructure devices of arbitrary complexity fabricated on conventional silicon/silicon dioxide wafer substrates. We demonstrate a large and continuously tunable strain of up to $0.15$\\% at millikelvin temperatures, with larger strain values also likely achievable. We quantify the strain transmission from the silicon wafer to the vdW heterostructure, and further demonstrate the ability of strain to modify the electronic properties of twisted bilayer graphene. Our technique provides a highly versatile new method for exploring the effect of uniaxial strain on both the electrical and optical properties of vdW heterostructures, and can be easily extended to include additional characterization techniques."}
{"main_page": "https://arxiv.org/abs/2404.00948", "pdf": "https://arxiv.org/pdf/2404.00948", "title": "On the absolute entropy of monatomic bodies", "authors": "Pascal Marquet, Max Planck", "subjects": "History and Philosophy of Physics (physics.hist-ph)", "abstract": "This is an English (annotated) translation of the German paper by Max Planck (1916) \"On the absolute entropy of monatomic bodies\" (\\\"Uber die absolute Entropie einatomiger K\\\"orper)."}
{"main_page": "https://arxiv.org/abs/2404.00952", "pdf": "https://arxiv.org/pdf/2404.00952", "title": "The quantum hypothesis for molecules with multiple degrees of freedom;  Remarks on the entropy constant of diatomic gases", "authors": "Pascal Marquet, Max Planck", "subjects": "History and Philosophy of Physics (physics.hist-ph)", "abstract": "An English (2024) translation by P. Marquet of 3 German papers about \"Die Quantenhypothese f\\\"ur Molekeln mit mehreren Freiheitsgraden (The quantum hypothesis for molecules with multiple degrees of freedom)\" and \"Bemerkung \\\"uber die Entropiekonstante zweiatomiger Gase (Remarks on the entropy constant of diatomic gases)\" by Max Planck (1915,a,b,c)"}
{"main_page": "https://arxiv.org/abs/2404.00967", "pdf": "https://arxiv.org/pdf/2404.00967", "title": "Designing gradient coils with the shape derivative and the closed  B-spline curves", "authors": "Toru Takahashi", "subjects": "Medical Physics (physics.med-ph); Optimization and Control (math.OC)", "abstract": "This study proposes a versatile and efficient optimisation method for discrete coils that induce a magnetic field by their steady currents. The prime target is gradient coils for MRI (Magnetic Resonance Imaging). The derivative (gradient) of the $z$-component the magnetic field, which is calculated by the Biot--Savart's law, with respect to the $z$-coordinate in the Cartesian $xyz$ coordinate system is considered as the objective function. Then, the derivative of the objective function with respect to a change of coils in shape is formulated according to the concept of shape optimisation. The resulting shape derivative (as well as the Biot--Savart's law) is smoothly discretised with the closed B-spline curves. In this case, the control points (CPs) of the curves are naturally selected as the design variables. As a consequence, the shape derivative is discretised to the sensitivities of the objective function with respect to the CPs. Those sensitivities are available to solve the present shape-optimisation problem with a certain gradient-based nonlinear-programming solver. The numerical examples exhibit the mathematical reliability, computational efficiency, and engineering applicability of the proposed methodology based on the shape derivative/sensitivities and the closed B-spline curves."}
{"main_page": "https://arxiv.org/abs/2404.00975", "pdf": "https://arxiv.org/pdf/2404.00975", "title": "On the Superiority of the University of Arizona's Physics Club", "authors": "E. Jesina, M. Harrison, H. Andras-Letanovszky, D. Krug, A. Golinkin, B. Kohn, T. Brown, A. Rose, P. Chiploonkar", "subjects": "Popular Physics (physics.pop-ph)", "abstract": "We present an analysis on Physics Club's supremacy over the Astronomy Club at the University of Arizona. Through a thorough investigation of each club's history and content, and subsequent diligent calculations, we have proven without a doubt that the Physics Club is superior to Astronomy Club."}
{"main_page": "https://arxiv.org/abs/2404.00976", "pdf": "https://arxiv.org/pdf/2404.00976", "title": "Yet anOther Dose Algorithm (YODA) for independent computations of dose  and dose changes due to anatomical changes", "authors": "Tiberiu Burlacu, Danny Lathouwers, Zoltán Perkó", "subjects": "Medical Physics (physics.med-ph)", "abstract": "$\\textbf{Purpose:}$ To assess the viability of a physics-based, deterministic and adjoint-capable algorithm for performing treatment planning system independent dose calculations and for computing dosimetric differences caused by anatomical changes. $\\textbf{Methods:}$ A semi-numerical approach is employed to solve two partial differential equations for the proton phase-space density which determines the deposited dose. Lateral hetereogeneities are accounted for by an optimized (Gaussian) beam splitting scheme. Adjoint theory is applied to approximate the change in the deposited dose caused by a new underlying patient anatomy. $\\textbf{Results:}$ The quality of the dose engine was benchmarked through three-dimensional gamma index comparisons against Monte Carlo simulations done in TOPAS. The worst passing rate for the gamma index with (1 mm, 1 %, 10 % dose cut-off) criteria is 95.62 %. The effect of delivering treatment plans on repeat CTs was also tested. For a non-robustly optimized plan the adjoint component was accurate to 6.2 % while for a robustly optimized plan it was accurate to 1 %. $\\textbf{Conclusions:}$ YODA is capable of accurate dose computations in both single and multi spot irradiations when compared to TOPAS. Moreover, it is able to compute dosimetric differences due to anatomical changes with small to moderate errors thereby facilitating its use for patient-specific quality assurance in online adaptive proton therapy."}
{"main_page": "https://arxiv.org/abs/2404.00991", "pdf": "https://arxiv.org/pdf/2404.00991", "title": "Optical solitons in multimode fibers: recent advances", "authors": "Mario Zitelli", "subjects": "Optics (physics.optics); Pattern Formation and Solitons (nlin.PS)", "abstract": "Optical solitons in multimode fibers have been predicted 40 years ago and extensively investigated theoretically. Transmission experiments in nonlinear multimode fibers have gained renewed interest, motivated by their potential to extend the capacity of long-distance transmission systems; only in the last few years, new experiments have revealed unexpected properties of optical solitons propagating in graded-index and step-index multimode fibers, partially re-writing the existing theory. Here we provide an overview of the recent experimental, numerical and theoretical studies which revealed those new properties. It will be shown that multimode fiber solitons form with specific pulse width and energy dependent on the wavelength, and that they naturally evolve toward fundamental-mode Raman solitons. New soliton fission mechanisms, governed by the modal dispersion, will be explained. Possible applications in space-division multiplexed systems will be discussed. A recent thermodynamic approach to soliton condensation will be described."}
{"main_page": "https://arxiv.org/abs/2404.01006", "pdf": "https://arxiv.org/pdf/2404.01006", "title": "Transforming the Synthesis of Carbon Nanotubes with Machine Learning  Models and Automation", "authors": "Yue Li, Shurui Wang, Zhou Lv, Zhaoji Wang, Yunbiao Zhao, Ying Xie, Yang Xu, Liu Qian, Yaodong Yang, Ziqiang Zhao, Jin Zhang", "subjects": "Applied Physics (physics.app-ph); Chemical Physics (physics.chem-ph)", "abstract": "Carbon-based nanomaterials (CBNs) are showing significant potential in various fields, such as electronics, energy, and mechanics. However, their practical applications face synthesis challenges stemming from the complexities of structural control, large-area uniformity, and high yield. Current research methodologies fall short in addressing the multi-variable, coupled interactions inherent to CBNs production. Machine learning methods excel at navigating such complexities. Their integration with automated synthesis platforms has demonstrated remarkable potential in accelerating chemical synthesis research, but remains underexplored in the nanomaterial domain. Here we introduce Carbon Copilot (CARCO), an artificial intelligence (AI)-driven platform that integrates transformer-based language models tailored for carbon materials, robotic chemical vapor deposition (CVD), and data-driven machine learning models, empowering accelerated research of CBNs synthesis. Employing CARCO, we demonstrate innovative catalyst discovery by predicting a superior Titanium-Platinum bimetallic catalyst for high-density horizontally aligned carbon nanotube (HACNT) array synthesis, validated through over 500 experiments. Furthermore, with the assistance of millions of virtual experiments, we achieved an unprecedented 56.25% precision in synthesizing HACNT arrays with predetermined densities in the real world. All were accomplished within just 43 days. This work not only advances the field of HACNT arrays but also exemplifies the integration of AI with human expertise to overcome the limitations of traditional experimental approaches, marking a paradigm shift in nanomaterials research and paving the way for broader applications."}
{"main_page": "https://arxiv.org/abs/2404.01016", "pdf": "https://arxiv.org/pdf/2404.01016", "title": "Numerical modelling of flame spread over thin circular ducts", "authors": "Vipin Kumar, Kambam Naresh, Amit Kumar", "subjects": "Fluid Dynamics (physics.flu-dyn); Numerical Analysis (math.NA)", "abstract": "This paper presents a numerical investigation into the phenomenon of flame spread over thin circular ducts in normal gravity and microgravity environments. Flame spread over such geometry is of significant interest due to its relevance in various practical applications, including tubes for flow purpose in medical system, fire safety in spacecrafts, ducts as well as wiring tubes. This study comprises of a comprehensive investigation of key parameters affecting flame spread rate, including fuel radius and opposed flow speed in normal gravity and microgravity environments. A 2-D axisymmetric flame spread model accounted for char and numerical simulations were performed which revealed valuable insights into the underlying mechanisms governing flame spread over such geometry. The results computed from the numerical model is compared with the experimentally observed flame spread rate to validate the numerical model which can be used to gain a comprehensive understanding of the underlying physical phenomena. As the radius of circular duct increases the flame spread rate increases both in normal gravity and microgravity environments. The conduction heat feedback and radiation heat gain coming from hot char through gas phase at inner core region are the two major mechanisms which controls the flame spread phenomena over the circular duct fuels. The flame spread rate at different flow ranging from quiescent (0 cm/s) to 30 cm/s is also evaluated and 21 % oxygen and found a non-monotonic increasing decreasing trend of flame spread rate at different opposed flow speed in both normal gravity and microgravity environments."}
{"main_page": "https://arxiv.org/abs/2404.01021", "pdf": "https://arxiv.org/pdf/2404.01021", "title": "Oscillating flow around a circular cylindrical post confined between two  parallel plates", "authors": "Antonio José Bárcenas-Luque, Francisco Moral-Pulido, Cándido Gutiérrez-Montes, Wilfried Coenen, Carlos Martínez-Bazán", "subjects": "Fluid Dynamics (physics.flu-dyn); Mathematical Physics (math-ph)", "abstract": "This work is motivated by the interest in determining the effect of the micro-anatomy of the spinal subarachnoid space on the cerebrospinal fluid flow and on the associated transport of solutes. To that aim, we focus on a canonical model problem in which a circular post of radius $a$, confined between two parallel plates separated by a distance $2h$, is subjected to an oscillatory flow. In particular, we are concerned with the steady, viscous, time-averaged flow that persists in the vicinity on the cylinder, when the stroke length of the oscillating flow, $U_{\\infty}/\\omega$ is smaller or comparable to the radius of the post, $a$, where $U_{\\infty}$ and $\\omega$ are the mean velocity amplitude and the corresponding angular frequency, respectively. First, we analyze the asymptotic limit of small values of the stroke length varying the aspect ratio of the post $\\lambda$ and the Womersley number $M$. First-order steady-streaming corrections at leading order have been computed, together with associated Stokes-drift component, the sum of both yielding the mean Lagrangian velocity field. The confinement effect is seen to induce the three-dimensionality of flow. Moreover, in the mid plane the time-averaged steady flow exhibits a recirculating vortex attached to the wall of the post that decreases as $M$ increases for low values of $M$. However, for values of $M$ larger than a critical one, $M_{cr}(\\lambda)$, a second, outer vortex is also formed. The dependence $M_{cr}(\\lambda)$ has been quantified. The analysis has been corroborated experimentally for a fixed aspect ratio. Consideration of an anharmonic oscillating flow shows the fort-and-aft symmetry of the steady flow is broken. Finally, the analysis is experimentally extended to consider an array of equally spaced posts."}
{"main_page": "https://arxiv.org/abs/2404.01046", "pdf": "https://arxiv.org/pdf/2404.01046", "title": "Locating influential nodes in hypergraphs via fuzzy collective influence", "authors": "Su-Su Zhang, Xiaoyan Yu, Gui-Quan Sun, Chuang Liu, Xiu-Xiu Zhan", "subjects": "Physics and Society (physics.soc-ph)", "abstract": "Complex contagion phenomena, such as the spread of information or contagious diseases, often occur among the population due to higher-order interactions between individuals. Individuals who can be represented by nodes in a network may play different roles in the spreading process, and thus finding the most influential nodes in a network has become a crucial topic in network science for applications such as viral marketing, rumor suppression, and disease control. To solve the problem of identifying nodes that have high influence in a complex system, we propose a higher-order distance-based fuzzy centrality methods (HDF and EHDF) that are customized for a hypergraph which can characterize higher-order interactions between nodes via hyperedges. The methods we proposed assume that the influence of a node is reliant on the neighboring nodes with a certain higher-order distance. We compare the proposed methods with the baseline centrality methods to verify their effectiveness. Experimental results on six empirical hypergraphs show that the proposed methods could better identify influential nodes, especially showing plausible performance in finding the top influential nodes. Our proposed theoretical framework for identifying influential nodes could provide insights into how higher-order topological structure can be used for tasks such as vital node identification, influence maximization, and network dismantling."}
{"main_page": "https://arxiv.org/abs/2404.01056", "pdf": "https://arxiv.org/pdf/2404.01056", "title": "Detangling the quantum tapestry of intra-channel interference in  below-threshold nonsequential double ionization with few-cycle laser pulses", "authors": "S. Hashim, R. Tenney, C. Figueira de Morisson Faria", "subjects": "Atomic Physics (physics.atom-ph)", "abstract": "We perform a systematic analysis of single-channel quantum interference in laser-induced nonsequential double ionization with few-cycle pulses, using the strong-field approximation. We focus on a below-threshold intensity for which the recollision-excitation with subsequent ionization (RESI) mechanism is prevalent. We derive and classify several analytic interference conditions for single-channel RESI in arbitrary driving fields, and address specific issues for few-cycle pulses. Since the cycles in a short pulse are no longer equivalent, there are several events whose dominance varies. We quantify this dominance for single excitation channels by proposing a dominance parameter. Moreover, there will be many more types of superimposed interference fringes that must be taken into consideration. We find an intricate tapestry of patterns arising from phase differences related to symmetrization, temporal shifts and a combination of exchange and event interference."}
{"main_page": "https://arxiv.org/abs/2404.01062", "pdf": "https://arxiv.org/pdf/2404.01062", "title": "Multiple Modes of Motion for the Effectiveness of Outer Hair Cells", "authors": "Kuni H. Iwasa", "subjects": "Biological Physics (physics.bio-ph)", "abstract": "Outer hair cells (OHCs) are essential for the sensitivity and frequency specificity of the mammalian ear. To perform this function, OHCs need to amplify the motion of the basilar membrane (BM), which is much stiffer than themselves. If OHCs and the BM are components of a single oscillator, this impedance mismatch seriously limits the effectiveness of OHCs. However, the elaborated structure of the organ of Corti can support multiple modes motion. Here, systems of two coupled oscillators are examined as the simplest models of the system with multiple modes of motion. It is found that some of these model systems have conditions, under which an OHC can function as an effective amplifier, overcoming the impedance mismatch. The present examination suggests that the presence of multiple modes of motion is a key to the exquisite performance of the mammalian ear."}
{"main_page": "https://arxiv.org/abs/2404.01085", "pdf": "https://arxiv.org/pdf/2404.01085", "title": "Analyzing Common Social and Physical Features of Flash-Flood  Vulnerability Hotspots in Urban Areas", "authors": "Allison Clarke, Natalie Coleman, Dr. Ali Mostafavi", "subjects": "Physics and Society (physics.soc-ph)", "abstract": "Flash flooding events, with their intense and sudden nature, present unique challenges for disaster researchers and emergency planners. To quantify the extent to which hotspots of flash flooding share similar social and physical features, the research uses community scale crowdsourced data and k means clustering. Crowdsourced data offers the potential to allocate limited resources, to improve spatial understanding, and to minimize the future effects of natural hazards. The research evaluates the impacts of Tropical Storm Imelda on Houston Metropolitan and Hurricane Ida on New York City. It develops a combined flash flood impact index based on FEMA claims, 311 calls, and Waze traffic reports which is able to capture a combination of crowdsourced data for the societal impact of flash flooding. In addition, k means clustering offers an essential tool for evaluating attributes associated with flash flooding events by grouping data into k number clusters of features. Thus, k means clustering evaluates the significance of a community's socio demographic, social capital, and physical features to the combined flood impact index. To ensure accessibility and replicability to different types of communities, our research uses publicly available datasets to understand how socio demographic data, social capital, and physical connectivity and development affect flash flood resilience. The findings reveal the intricate relationships associated with flash flooding impact as a combination of socio demographic and physical features. For instance, the cluster with the highest scores of the flash flood impact index from Tropical Storm Imelda had the highest percentage of minority population and lower income while the cluster with the second highest score flash flood impact index had the highest percentage of impervious surface and number of POIs."}
{"main_page": "https://arxiv.org/abs/2404.01098", "pdf": "https://arxiv.org/pdf/2404.01098", "title": "Measurement of three-body recombination coefficient of ultracold lithium  and strontium atoms", "authors": "Bo-Yang Wang, Yi-Fan Wang, Zi-He An, Li-Yang Xie, Zhu-Xiong Ye, Yi Zhang, Meng Khoon Tey", "subjects": "Atomic Physics (physics.atom-ph); Quantum Gases (cond-mat.quant-gas)", "abstract": "We report on the observation of a conspicuous loss in an ultracold mixture of $^{7}$Li and $^{88}$Sr atoms confined in a far-off-resonance optical dipole trap. We attribute the trap loss to the three-body inelastic Li-Sr-Sr collision and extract the corresponding three-body recombination coefficient $K_3$ at $T\\sim 18.5,45,70,600$ $\\mu K$. The measured three-body recombination coefficient is about two to three orders of magnitude larger than the typical values convenient for realizing quantum degenerate gases. It also indicates a potentially large $s$-wave scattering length between the bosonic $^{7}$Li and $^{88}$Sr atoms, and essentially rules out the prospect of realizing $^7$Li and $^{88}$Sr mixtures of high phase space density."}
{"main_page": "https://arxiv.org/abs/2404.01144", "pdf": "https://arxiv.org/pdf/2404.01144", "title": "Electrical-controllable antiferromagnet-based tunnel junction", "authors": "Lei Han, Xuming Luo, Yingqian Xu, Hua Bai, Wenxuan Zhu, Yuxiang Zhu, Guoqiang Yu, Cheng Song, Feng Pan", "subjects": "Applied Physics (physics.app-ph); Materials Science (cond-mat.mtrl-sci)", "abstract": "Electrical-controllable antiferromagnet tunnel junction is a key goal in spintronics, holding immense promise for ultra-dense and ultra-stable antiferromagnetic memory with high processing speed for modern information technology. Here, we have advanced towards this goal by achieving an electrical-controllable antiferromagnet-based tunnel junction of Pt/Co/Pt/Co/IrMn/MgO/Pt. The exchange coupling between antiferromagnetic IrMn and Co/Pt perpendicular magnetic multilayers results in the formation of interfacial exchange bias and exchange spring in IrMn. Encoding information states 0 and 1 is realized through the exchange spring in IrMn, which can be electrically written by spin-orbit torque switching with high cyclability and electrically read by antiferromagnetic tunneling anisotropic magnetoresistance. Combining spin-orbit torque switching of both exchange spring andexchange bias, 16 Boolean logic operation is successfully demonstrated. With both memory and logic functionalities integrated into our electrical-controllable antiferromagnetic-based tunnel junction, we chart the course toward high-performance antiferromagnetic logic-in-memory."}
{"main_page": "https://arxiv.org/abs/2404.01172", "pdf": "https://arxiv.org/pdf/2404.01172", "title": "Covering convection with thermal blankets: formation of supercontinents", "authors": "Jinzi Mac Huang", "subjects": "Fluid Dynamics (physics.flu-dyn); Numerical Analysis (math.NA)", "abstract": "The continental plates of Earth are known to drift over a geophysical timescale, and their interactions have lead to some of the most spectacular geoformations of our planet while also causing natural disasters such as earthquakes and volcanic activity. Understanding the dynamics of interacting continental plates is thus significant. In this work, we present a fluid mechanical investigation of the plate motion, interaction, and dynamics. Through numerical experiments, we examine the coupling between a convective fluid and plates floating on top of it. With physical modeling, we show the coupling is both mechanical and thermal, leading to the thermal blanket effect: the floating plate is not only transported by the fluid flow beneath, it also prevents the heat from leaving the fluid, leading to a convective flow that further affects the plate motion. By adding several plates to such a coupled fluid-structure interaction, we also investigate how floating plates interact with each other and show that, under proper conditions, small plates can converge into a supercontinent."}
{"main_page": "https://arxiv.org/abs/2404.01187", "pdf": "https://arxiv.org/pdf/2404.01187", "title": "Modeling the low-pressure high-voltage branch of the Paschen curve for  hydrogen and deuterium", "authors": "Alexander V. Khrabrov, David. J. Smith, Igor D. Kaganovich", "subjects": "Plasma Physics (physics.plasm-ph)", "abstract": "A physical and numerical model of the Townsend discharge in molecular hydrogen and deuterium has been developed to meet the needs of designing a plasma-based switching device for power grid application. The model allows to predict the low-pressure branch of the Paschen curve for applied voltage in the range of several hundred kiloVolts. In the regime of interest, electrons are in a runaway state and ionization by ions and fast neutrals sustains the discharge. It was essential to correctly account for both gas-phase and surface interactions (electron emission and electron back-scattering), especially in terms of their dependence on particle energy. The model yields results consistent with prior data obtained for lower voltage. The three-species (electrons, ions and fast neutrals) model successfully captures the essential physics of the process."}
{"main_page": "https://arxiv.org/abs/2404.01193", "pdf": "https://arxiv.org/pdf/2404.01193", "title": "Inferring parameters and reconstruction of two-dimensional turbulent  flows with physics-informed neural networks", "authors": "Vladimir Parfenyev, Mark Blumenau, Ilya Nikitin", "subjects": "Fluid Dynamics (physics.flu-dyn); Data Analysis, Statistics and Probability (physics.data-an)", "abstract": "Solving inverse problems, which means obtaining model parameters from observed data, using conventional computational fluid dynamics solvers is prohibitively expensive. Here we employ machine learning algorithms to overcome the challenge. As an example, we consider a moderately turbulent fluid flow, excited by a stationary force and described by a two-dimensional Navier-Stokes equation with linear bottom friction. Given sparse and probably noisy data for the velocity and the general form of the model, we reconstruct the dense velocity and pressure fields in the observation domain, infer the driving force, and determine the unknown fluid viscosity and friction coefficient. Our approach involves training a physics-informed neural network by minimizing the loss function, which penalizes deviations from the provided data and violations of the Navier-Stokes equation. The suggested technique extracts additional information from experimental and numerical observations, potentially enhancing the capabilities of particle image/tracking velocimetry."}
{"main_page": "https://arxiv.org/abs/2404.01199", "pdf": "https://arxiv.org/pdf/2404.01199", "title": "Evaluation of the systematic error induced by quadratic Zeeman effect  using hyperfine ground state exchange method in a long-baseline dual-species  atom interferometer", "authors": "Yu-Hang Ji, Chuan He, Si-Tong Yan, Jun-Jie Jiang, Jia-Qi Lei, Lu Zhou, Lin Zhou, Xi Chen, Jin Wang, Ming-Sheng Zhan", "subjects": "Atomic Physics (physics.atom-ph); Quantum Physics (quant-ph)", "abstract": "The systematic error induced by the quadratic Zeeman effect is non-negligible in atom interferometers and must be precisely evaluated. We theoretically analyze the phase shift induced by the Zeeman effect, and use a hyperfine ground state exchange (HGSE) method to evaluate the systematic error in the long-baseline $^{85}$Rb-$^{87}$Rb dual-species atom interferometer due to the quadratic Zeeman effect. Compared to the two evaluation methods, mapping the absolute magnetic field in the interference region and performing phase measurements at different bias fields, the HGSE method could obtain the systematic error in real time in case of slow drifts of either the ambient magnetic field or other systematic effects irrelevant to the hyperfine ground states. To validate the effectiveness of the HGSE method, we also employ the mapping magnetic field method and modulating bias field method independently to cross-check and yield consistent results of three methods within an accuracy of $10^{-11}$ level. The HGSE method is helpful in evaluating and suppressing the quadratic Zeeman-effect-induced systematic error in long-baseline atom interferometer-based precision measurements, such as equivalence principle tests."}
{"main_page": "https://arxiv.org/abs/2404.01208", "pdf": "https://arxiv.org/pdf/2404.01208", "title": "TOFHIR2: The readout ASIC of the CMS Barrel MIP Timing Detector", "authors": "E. Albuquerque (5), M. Araújo (4), A. Benaglia (3), A. Boletti (4), R. Bugalho (5), T. Coutinho (5), F. De Guio (3 and 6), P. Faccioli (4), L. Ferramacho (5), M. Firlej (1), T. Fiutowski (1), R. Francisco (5), M. Gallinaro (4), A. Ghezzi (3 and 6), J. Hollar (4), M. Idzik (1), H. Legoinha (4), N. Leonardo (4), C. Leong (5), M.T. Lucchini (3), M. Malberti (3), G. Marozzo (4), G. Da Molin (4), J. Moron (1), T. Niknejad (4 and 5), L. Oliveira (2), N. Oliveira (5), S. Palluotto (3 and 6), M. Pisano (4), N. Redaelli (3), C. Silva (4), J. C. Silva (4 and 5), R. Silva (4 and 5), M. Silveira (5), K. Swientek (1), T. Tabarelli de Fatis (3 and 6), S. Tavernier (5), J. Varela (4 and 5), V. Varela (5), S. White (7), J. Wulff (4) ((1) AGH University of Krakow, Faculty of Physics and Applied Computer Science, Krakow, Poland, (2) DEE, CTS-UNINOVA, FCT-UNL, Caparica, Portugal, (3) INFN Sez. Milano Bicocca, Italy, (4) LIP, Lisbon, Portugal, (5) PETsys Electronics, Oeiras, Portugal, (6) University of Milano-Bicocca, Milano, Italy, (7) University of Virginia, Charlottesville, Virginia, USA)", "subjects": "Instrumentation and Detectors (physics.ins-det); High Energy Physics - Experiment (hep-ex)", "abstract": "The CMS detector will be upgraded for the HL-LHC to include a MIP Timing Detector (MTD). The MTD will consist of barrel and endcap timing layers, BTL and ETL respectively, providing precision timing of charged particles. The BTL sensors are based on LYSO:Ce scintillation crystals coupled to SiPMs with TOFHIR2 ASICs for the front-end readout. A resolution of 30-60 ps for MIP signals at a rate of 2.5 Mhit/s per channel is expected along the HL-LHC lifetime. We present an overview of the TOFHIR2 requirements and design, simulation results and measurements with TOFHIR2 ASICs. The measurements of TOFHIR2 associated to sensor modules were performed in different test setups using internal test pulses or blue and UV laser pulses emulating the signals expected in the experiment. The measurements show a time resolution of 24 ps initially during Beginning of Operation (BoO) and 58 ps at End of Operation (EoO) conditions, matching well the BTL requirements. We also showed that the time resolution is stable up to the highest expected MIP rate. Extensive radiation tests were performed, both with x-rays and heavy ions, showing that TOFHIR2 is not affected by the radiation environment during the experiment lifetime."}
