{"main_page": "https://arxiv.org/abs/2404.00471", "pdf": "https://arxiv.org/pdf/2404.00471", "title": "Score-Based Diffusion Models for Photoacoustic Tomography Image  Reconstruction", "authors": "Sreemanti Dey, Snigdha Saha, Berthy T. Feng, Manxiu Cui, Laure Delisle, Oscar Leong, Lihong V. Wang, Katherine L. Bouman", "subjects": "Medical Physics (physics.med-ph); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Image and Video Processing (eess.IV)", "abstract": "Photoacoustic tomography (PAT) is a rapidly-evolving medical imaging modality that combines optical absorption contrast with ultrasound imaging depth. One challenge in PAT is image reconstruction with inadequate acoustic signals due to limited sensor coverage or due to the density of the transducer array. Such cases call for solving an ill-posed inverse reconstruction problem. In this work, we use score-based diffusion models to solve the inverse problem of reconstructing an image from limited PAT measurements. The proposed approach allows us to incorporate an expressive prior learned by a diffusion model on simulated vessel structures while still being robust to varying transducer sparsity conditions."}
{"main_page": "https://arxiv.org/abs/2404.00556", "pdf": "https://arxiv.org/pdf/2404.00556", "title": "Restriction-induced time-dependent transcytolemmal water exchange:  Revisiting the Kärger exchange model", "authors": "Diwei Shi, Fan Liu, Sisi Li, Li Chen, Xiaoyu Jiang, John C. Gore, Quanshui Zheng, Hua Guo, Junzhong Xu", "subjects": "Medical Physics (physics.med-ph); Biological Physics (physics.bio-ph)", "abstract": "The K\\\"arger model and its derivatives have been widely used to incorporate transcytolemmal water exchange rate, an essential characteristic of living cells, into analyses of diffusion MRI (dMRI) signals from tissues. The K\\\"arger model consists of two homogeneous exchanging components coupled by an exchange rate constant and assumes measurements are made with sufficiently long diffusion time and slow water exchange. Despite successful applications, it remains unclear whether these assumptions are generally valid for practical dMRI sequences and biological tissues. In particular, barrier-induced restrictions to diffusion produce inhomogeneous magnetization distributions in relatively large-sized compartments such as cancer cells, violating the above assumptions. The effects of this inhomogeneity are usually overlooked. We performed computer simulations to quantify how restriction effects, which in images produce edge enhancements at compartment boundaries, influence different variants of the K\\\"arger-model. The results show that the edge enhancement effect will produce larger, time-dependent estimates of exchange rates in e.g., tumors with relatively large cell sizes (>10 {\\mu}m), resulting in overestimations of water exchange as previously reported. Moreover, stronger diffusion gradients, longer diffusion gradient durations, and larger cell sizes, all cause more pronounced edge enhancement effects. This helps us to better understand the feasibility of the K\\\"arger model in estimating water exchange in different tissue types and provides useful guidance on signal acquisition methods that may mitigate the edge enhancement effect. This work also indicates the need to correct the overestimated transcytolemmal water exchange rates obtained assuming the K\\\"arger-model."}
{"main_page": "https://arxiv.org/abs/2404.00967", "pdf": "https://arxiv.org/pdf/2404.00967", "title": "Designing gradient coils with the shape derivative and the closed  B-spline curves", "authors": "Toru Takahashi", "subjects": "Medical Physics (physics.med-ph); Optimization and Control (math.OC)", "abstract": "This study proposes a versatile and efficient optimisation method for discrete coils that induce a magnetic field by their steady currents. The prime target is gradient coils for MRI (Magnetic Resonance Imaging). The derivative (gradient) of the $z$-component the magnetic field, which is calculated by the Biot--Savart's law, with respect to the $z$-coordinate in the Cartesian $xyz$ coordinate system is considered as the objective function. Then, the derivative of the objective function with respect to a change of coils in shape is formulated according to the concept of shape optimisation. The resulting shape derivative (as well as the Biot--Savart's law) is smoothly discretised with the closed B-spline curves. In this case, the control points (CPs) of the curves are naturally selected as the design variables. As a consequence, the shape derivative is discretised to the sensitivities of the objective function with respect to the CPs. Those sensitivities are available to solve the present shape-optimisation problem with a certain gradient-based nonlinear-programming solver. The numerical examples exhibit the mathematical reliability, computational efficiency, and engineering applicability of the proposed methodology based on the shape derivative/sensitivities and the closed B-spline curves."}
{"main_page": "https://arxiv.org/abs/2404.00976", "pdf": "https://arxiv.org/pdf/2404.00976", "title": "Yet anOther Dose Algorithm (YODA) for independent computations of dose  and dose changes due to anatomical changes", "authors": "Tiberiu Burlacu, Danny Lathouwers, Zoltán Perkó", "subjects": "Medical Physics (physics.med-ph)", "abstract": "$\\textbf{Purpose:}$ To assess the viability of a physics-based, deterministic and adjoint-capable algorithm for performing treatment planning system independent dose calculations and for computing dosimetric differences caused by anatomical changes. $\\textbf{Methods:}$ A semi-numerical approach is employed to solve two partial differential equations for the proton phase-space density which determines the deposited dose. Lateral hetereogeneities are accounted for by an optimized (Gaussian) beam splitting scheme. Adjoint theory is applied to approximate the change in the deposited dose caused by a new underlying patient anatomy. $\\textbf{Results:}$ The quality of the dose engine was benchmarked through three-dimensional gamma index comparisons against Monte Carlo simulations done in TOPAS. The worst passing rate for the gamma index with (1 mm, 1 %, 10 % dose cut-off) criteria is 95.62 %. The effect of delivering treatment plans on repeat CTs was also tested. For a non-robustly optimized plan the adjoint component was accurate to 6.2 % while for a robustly optimized plan it was accurate to 1 %. $\\textbf{Conclusions:}$ YODA is capable of accurate dose computations in both single and multi spot irradiations when compared to TOPAS. Moreover, it is able to compute dosimetric differences due to anatomical changes with small to moderate errors thereby facilitating its use for patient-specific quality assurance in online adaptive proton therapy."}
