{"main_page": "https://arxiv.org/abs/2404.00616", "pdf": "https://arxiv.org/pdf/2404.00616", "title": "Prospects of nuclear-coupled-dark-matter detection via correlation  spectroscopy of I$_2^+$ and Ca$^+$", "authors": "Eric Madge, Gilad Perez, Ziv Meir", "subjects": "Atomic Physics (physics.atom-ph); High Energy Physics - Phenomenology (hep-ph)", "abstract": "The nature of dark matter (DM) and its interaction with the Standard Model (SM) is one of the biggest open questions in physics nowadays. The vast majority of theoretically-motivated Ultralight-DM (ULDM) models predict that ULDM couples dominantly to the SM strong/nuclear sector. This coupling leads to oscillations of nuclear parameters that are detectable by comparing clocks with different sensitivities to these nature's constants. Vibrational transitions of molecular clocks are more sensitive to a change in the nuclear parameters than the electronic transitions of atomic clocks. Here, we propose the iodine molecular ion, I$_2^+$, as a sensitive detector for such a class of ULDM models. The iodine's dense spectrum allows us to match its transition frequency to that of an optical atomic clock (Ca$^+$) and perform correlation spectroscopy between the two clock species. With this technique, we project a few-orders-of-magnitude improvement over the most sensitive clock comparisons performed to date. We also briefly consider the robustness of the corresponding \"Earth-bound\" under modifications of the $Z_N$-QCD axion model."}
{"main_page": "https://arxiv.org/abs/2404.00730", "pdf": "https://arxiv.org/pdf/2404.00730", "title": "Long-range dipole-dipole exchange-induced atomic grating", "authors": "Xuan-Qian Bao, Xue-Dong Tian, Dong-Xiao Li, Yi-Mou Liu", "subjects": "Atomic Physics (physics.atom-ph); Quantum Physics (quant-ph)", "abstract": "We propose a theoretical scheme for dipole exchange-induced grating (DEIG) based on a hybrid system consisting of ultra-cold Rubidium ($^{87}$Rb) atomic ensemble and movable Rydberg spin atoms. The optical response of the grating appears as a superposition of three- and four-level configurations, similar to the cooperative optical nonlinear effect caused by the dipole blockade effect. However, such Rydberg atomic grating uniquely responds to the spatial positions of spin atoms, offering a novel approach to dynamically control electromagnetically induced gratings (EIG) except for input probe intensity."}
{"main_page": "https://arxiv.org/abs/2404.01056", "pdf": "https://arxiv.org/pdf/2404.01056", "title": "Detangling the quantum tapestry of intra-channel interference in  below-threshold nonsequential double ionization with few-cycle laser pulses", "authors": "S. Hashim, R. Tenney, C. Figueira de Morisson Faria", "subjects": "Atomic Physics (physics.atom-ph)", "abstract": "We perform a systematic analysis of single-channel quantum interference in laser-induced nonsequential double ionization with few-cycle pulses, using the strong-field approximation. We focus on a below-threshold intensity for which the recollision-excitation with subsequent ionization (RESI) mechanism is prevalent. We derive and classify several analytic interference conditions for single-channel RESI in arbitrary driving fields, and address specific issues for few-cycle pulses. Since the cycles in a short pulse are no longer equivalent, there are several events whose dominance varies. We quantify this dominance for single excitation channels by proposing a dominance parameter. Moreover, there will be many more types of superimposed interference fringes that must be taken into consideration. We find an intricate tapestry of patterns arising from phase differences related to symmetrization, temporal shifts and a combination of exchange and event interference."}
{"main_page": "https://arxiv.org/abs/2404.01098", "pdf": "https://arxiv.org/pdf/2404.01098", "title": "Measurement of three-body recombination coefficient of ultracold lithium  and strontium atoms", "authors": "Bo-Yang Wang, Yi-Fan Wang, Zi-He An, Li-Yang Xie, Zhu-Xiong Ye, Yi Zhang, Meng Khoon Tey", "subjects": "Atomic Physics (physics.atom-ph); Quantum Gases (cond-mat.quant-gas)", "abstract": "We report on the observation of a conspicuous loss in an ultracold mixture of $^{7}$Li and $^{88}$Sr atoms confined in a far-off-resonance optical dipole trap. We attribute the trap loss to the three-body inelastic Li-Sr-Sr collision and extract the corresponding three-body recombination coefficient $K_3$ at $T\\sim 18.5,45,70,600$ $\\mu K$. The measured three-body recombination coefficient is about two to three orders of magnitude larger than the typical values convenient for realizing quantum degenerate gases. It also indicates a potentially large $s$-wave scattering length between the bosonic $^{7}$Li and $^{88}$Sr atoms, and essentially rules out the prospect of realizing $^7$Li and $^{88}$Sr mixtures of high phase space density."}
{"main_page": "https://arxiv.org/abs/2404.01199", "pdf": "https://arxiv.org/pdf/2404.01199", "title": "Evaluation of the systematic error induced by quadratic Zeeman effect  using hyperfine ground state exchange method in a long-baseline dual-species  atom interferometer", "authors": "Yu-Hang Ji, Chuan He, Si-Tong Yan, Jun-Jie Jiang, Jia-Qi Lei, Lu Zhou, Lin Zhou, Xi Chen, Jin Wang, Ming-Sheng Zhan", "subjects": "Atomic Physics (physics.atom-ph); Quantum Physics (quant-ph)", "abstract": "The systematic error induced by the quadratic Zeeman effect is non-negligible in atom interferometers and must be precisely evaluated. We theoretically analyze the phase shift induced by the Zeeman effect, and use a hyperfine ground state exchange (HGSE) method to evaluate the systematic error in the long-baseline $^{85}$Rb-$^{87}$Rb dual-species atom interferometer due to the quadratic Zeeman effect. Compared to the two evaluation methods, mapping the absolute magnetic field in the interference region and performing phase measurements at different bias fields, the HGSE method could obtain the systematic error in real time in case of slow drifts of either the ambient magnetic field or other systematic effects irrelevant to the hyperfine ground states. To validate the effectiveness of the HGSE method, we also employ the mapping magnetic field method and modulating bias field method independently to cross-check and yield consistent results of three methods within an accuracy of $10^{-11}$ level. The HGSE method is helpful in evaluating and suppressing the quadratic Zeeman-effect-induced systematic error in long-baseline atom interferometer-based precision measurements, such as equivalence principle tests."}
