{"main_page": "https://arxiv.org/abs/2404.00813", "pdf": "https://arxiv.org/pdf/2404.00813", "title": "Unraveling subsurface crustal dynamics: exploring electrical and seismic  refraction methods from theories to existing and machine learning-based  emerging prospects", "authors": "Adedibu Sunny Akingboye", "subjects": "Geophysics (physics.geo-ph)", "abstract": "This comprehensive review explores electrical and seismic refraction methods, including their emerging techniques, namely electrical resistivity tomography (ERT) and seismic refraction tomography (SRT). It discusses their crucial roles in understanding surface-subsurface crustal dynamics, outlining their principles, strengths, and limitations. Additionally, it provides insights into the induced polarization method and briefly discusses the self-potential method. The review thoroughly examines the mapping of surface-subsurface resistivity and velocity structures, crucial for comprehending Earth's surface, deep crustal, and hazard processes. Despite the numerous benefits of these techniques, challenges persist, necessitating multidisciplinary approaches due to lithology heterogeneities, geological process nuances, and geophysical data uncertainties. Hence, the emergence of machine learning and deep learning in ERT and SRT significantly enhances their accuracy in inversion modeling and geological feature identification. This integration of domain-specific knowledge with data- and image-driven approaches effectively addresses subsurface characterization challenges. Case studies utilizing real-time field electrical and seismic P-wave velocity datasets illustrate concepts, accompanied by the development of new methodological frameworks and analytical modeling. These frameworks provide systematic data modeling, facilitating velocity-resistivity relationships for enhanced geological characterization. This evidence underscores the importance of leveraging state-of-the-art techniques to obtain a broader range of parameters for subsurface structure delineation, environmental risk assessment, and informed decision-making. Ongoing research innovation is anticipated to continue improving capabilities in subsurface geophysical exploration."}
