{"main_page": "https://arxiv.org/abs/2404.00106", "pdf": "https://arxiv.org/pdf/2404.00106", "title": "Precise Control of Process Parameters for >23% Efficiency Perovskite  Solar Cells in Ambient Air Using an Automated Device Acceleration Platform", "authors": "Jiyun Zhang, Anastasia Barabash, Tian Du, Jianchang Wu, Vincent M. Le Corre, Yicheng Zhao, Shudi Qiu, Kaicheng Zhang, Frederik Schmitt, Zijian Peng, Jingjing Tian, Chaohui Li, Chao Liu, Thomas Heumueller, Larry Lüer, Jens A. Hauch, Christoph J. Brabec", "subjects": "Applied Physics (physics.app-ph); Materials Science (cond-mat.mtrl-sci)", "abstract": "Achieving high-performance perovskite photovoltaics, especially in ambient air relies heavily on optimizing process parameters. However, traditional manual methods often struggle to effectively control the key variables. This inherent challenge requires a paradigm shift toward automated platforms capable of precise and reproducible experiments. Herein, we use a fully automated device acceleration platform (DAP) to optimize the process parameters for preparing full perovskite devices using a two-step method in ambient air. Eight process parameters that have the potential to significantly influence device performance are systematically optimized. Specifically, we delve into the impact of the dispense speed of organic ammonium halide, a parameter that is difficult to control manually, on both perovskite film and device performance. Through the targeted design of experiments, we reveal that the dispense speed significantly affects device performance primarily by adjusting the residual PbI2 content in the films. We find that moderate dispense speeds, e.g., 50 {\\mu}l/s, contribute to top-performance devices. Conversely, too fast or too slow speeds result in devices with relatively poorer performance and lower reproducibility. The optimized parameter set enables us to establish a Standard Operation Procedure (SOP) for additive-free perovskite processing under ambient conditions, which yield devices with efficiencies surpassing 23%, satisfactory reproducibility, and state-of-the-art photo-thermal stability. This research underscores the importance of understanding the causality of process parameters in enhancing perovskite photovoltaic performance. Furthermore, our study highlights the pivotal role of automated platforms in discovering innovative workflows and accelerating the development of high-performing perovskite photovoltaic technologies."}
{"main_page": "https://arxiv.org/abs/2404.00705", "pdf": "https://arxiv.org/pdf/2404.00705", "title": "Small-angle scattering interferometry with neutron orbital angular  momentum states", "authors": "Dusan Sarenac, Melissa E. Henderson, Huseyin Ekinci, Charles W. Clark, David G. Cory, Lisa DeBeer-Schmitt, Michael G. Huber, Owen Lailey, Jonathan S. White, Kirill Zhernenkov, Dmitry A. Pushin", "subjects": "Applied Physics (physics.app-ph); Optics (physics.optics)", "abstract": "Access to the neutron orbital degree of freedom has been enabled by the recent actualization of methods to prepare and characterize neutron helical waves carrying orbital angular momentum (OAM) at small-angle neutron scattering (SANS) facilities. This provides new avenues of exploration in fundamental science experiments as well as in material characterization applications. However, it remains a challenge to recover phase profiles from SANS measurements. We introduce and demonstrate a novel neutron interferometry technique for extracting phase information that is typically lost in SANS measurements. An array of reference beams, with complementary structured phase profiles, are put into a coherent superposition with the array of object beams, thereby manifesting the phase information in the far-field intensity profile. We demonstrate this by resolving petal-structure signatures of helical wave interference for the first time: an implementation of the long-sought recovery of phase information from small-angle scattering measurements."}
{"main_page": "https://arxiv.org/abs/2404.00770", "pdf": "https://arxiv.org/pdf/2404.00770", "title": "Low-loss liquid metal interconnects for modular superconducting quantum  systems", "authors": "Zhancheng Yao, Martin Sandberg, David W. Abraham, David J. Bishop", "subjects": "Applied Physics (physics.app-ph); Quantum Physics (quant-ph)", "abstract": "Building modular architecture with superconducting quantum computing chips is one of the means to achieve qubit scalability, allowing the screening, selection, replacement, and integration of individual qubit modules into large quantum systems. However, the non-destructive replacement of modules within a compact architecture remains a challenge. Liquid metals (LM), specifically gallium alloys, can be alternatives to solid-state galvanic interconnects. This is motivated by their self-healing, self-aligning, and other desirable fluidic properties, potentially enabling non-destructive replacement of modules at room temperatures, even after operating the entire system at millikelvin regimes. In this study, we present high-internal-quality-factor coplanar waveguide resonators (CPWR) interconnected by gallium alloy droplets, demonstrating performance on par with the continuous solid-state CPWRs. Leveraging the desirable fluidic properties of gallium alloys at room temperature and their compact design, we envision a modular quantum system enabled by liquid metals."}
{"main_page": "https://arxiv.org/abs/2404.00802", "pdf": "https://arxiv.org/pdf/2404.00802", "title": "The Mechanics and Physics of Twisted and Coiled Polymer Actuators", "authors": "Qiong Wang, Anan Ghrayeb, SeongHyeon Kim, Liuyang Cheng, Sameh Tawfick", "subjects": "Applied Physics (physics.app-ph)", "abstract": "Twisted and coiled polymer actuators (TCPAs) generate large contractile mechanical work mimicking natural muscles, which makes them suitable for robotics and health-assistive devices. Understanding the mechanism of nylon TCPA remains challenging due to the interplay between their intricate geometry, chirality, residual stresses, and material microstructure. This study integrates a material microstructure model with rod theory to analytically predict the equilibrium helical shape of the nylon TCPA after fabrication and to explain the observed contraction mechanism upon stimulation. The first ingredient of the model is to treat nylon as a two-phase thermomechanical microstructure system capable of storing strain energy and exchanging it among the two phases. This is validated by characterizing the torsional actuation response of twisted and annealed nylon fibers. The second ingredient of the model is to use the classic Kirchhoff Rod Theory and add a necessary term that couples the bending and twisting energy. Validation with experiments shows that the model captures the equilibrium and longitudinal stiffness of the TCPA in both active and passive states, and the stimulated contraction under external load. Importantly, the model quantifies the influence of the stored energy level on the actuation performance. These concepts can be extended to other types of TCPAs and could enable new material design."}
{"main_page": "https://arxiv.org/abs/2404.01006", "pdf": "https://arxiv.org/pdf/2404.01006", "title": "Transforming the Synthesis of Carbon Nanotubes with Machine Learning  Models and Automation", "authors": "Yue Li, Shurui Wang, Zhou Lv, Zhaoji Wang, Yunbiao Zhao, Ying Xie, Yang Xu, Liu Qian, Yaodong Yang, Ziqiang Zhao, Jin Zhang", "subjects": "Applied Physics (physics.app-ph); Chemical Physics (physics.chem-ph)", "abstract": "Carbon-based nanomaterials (CBNs) are showing significant potential in various fields, such as electronics, energy, and mechanics. However, their practical applications face synthesis challenges stemming from the complexities of structural control, large-area uniformity, and high yield. Current research methodologies fall short in addressing the multi-variable, coupled interactions inherent to CBNs production. Machine learning methods excel at navigating such complexities. Their integration with automated synthesis platforms has demonstrated remarkable potential in accelerating chemical synthesis research, but remains underexplored in the nanomaterial domain. Here we introduce Carbon Copilot (CARCO), an artificial intelligence (AI)-driven platform that integrates transformer-based language models tailored for carbon materials, robotic chemical vapor deposition (CVD), and data-driven machine learning models, empowering accelerated research of CBNs synthesis. Employing CARCO, we demonstrate innovative catalyst discovery by predicting a superior Titanium-Platinum bimetallic catalyst for high-density horizontally aligned carbon nanotube (HACNT) array synthesis, validated through over 500 experiments. Furthermore, with the assistance of millions of virtual experiments, we achieved an unprecedented 56.25% precision in synthesizing HACNT arrays with predetermined densities in the real world. All were accomplished within just 43 days. This work not only advances the field of HACNT arrays but also exemplifies the integration of AI with human expertise to overcome the limitations of traditional experimental approaches, marking a paradigm shift in nanomaterials research and paving the way for broader applications."}
{"main_page": "https://arxiv.org/abs/2404.01144", "pdf": "https://arxiv.org/pdf/2404.01144", "title": "Electrical-controllable antiferromagnet-based tunnel junction", "authors": "Lei Han, Xuming Luo, Yingqian Xu, Hua Bai, Wenxuan Zhu, Yuxiang Zhu, Guoqiang Yu, Cheng Song, Feng Pan", "subjects": "Applied Physics (physics.app-ph); Materials Science (cond-mat.mtrl-sci)", "abstract": "Electrical-controllable antiferromagnet tunnel junction is a key goal in spintronics, holding immense promise for ultra-dense and ultra-stable antiferromagnetic memory with high processing speed for modern information technology. Here, we have advanced towards this goal by achieving an electrical-controllable antiferromagnet-based tunnel junction of Pt/Co/Pt/Co/IrMn/MgO/Pt. The exchange coupling between antiferromagnetic IrMn and Co/Pt perpendicular magnetic multilayers results in the formation of interfacial exchange bias and exchange spring in IrMn. Encoding information states 0 and 1 is realized through the exchange spring in IrMn, which can be electrically written by spin-orbit torque switching with high cyclability and electrically read by antiferromagnetic tunneling anisotropic magnetoresistance. Combining spin-orbit torque switching of both exchange spring andexchange bias, 16 Boolean logic operation is successfully demonstrated. With both memory and logic functionalities integrated into our electrical-controllable antiferromagnetic-based tunnel junction, we chart the course toward high-performance antiferromagnetic logic-in-memory."}
