{"main_page": "https://arxiv.org/abs/2404.00467", "pdf": "https://arxiv.org/pdf/2404.00467", "title": "Characterization of uncertainties in electron-argon collision cross  sections under statistical principles", "authors": "Seung Whan Chung, Todd A. Oliver, Laxminarayan L. Raja, Robert D. Moser", "subjects": "Plasma Physics (physics.plasm-ph); Data Analysis, Statistics and Probability (physics.data-an)", "abstract": "The predictive capability of a plasma discharge model depends on accurate representations of electron-impact collision cross sections, which determine the key reaction rates and transport properties of the plasma. Although many cross sections have been identified through experiments and quantum mechanical simulations, their uncertainties are not well-investigated. We characterize the uncertainties in electron-argon collision cross sections using a Bayesian framework. Six collision processes -- elastic momentum transfer, ionization, and four excitations -- are characterized with semi-empirical models, whose parametric uncertainties effectively capture the features important to the macroscopic properties of the plasma, namely transport properties and chemical reaction rates. The method is designed to capture the effects of systematic errors that lead to large discrepancies between some data sets. Specifically, for the purposes of Bayesian inference, each of the parametric cross section models is augmented with a Gaussian process representing systematic measurement errors as well as model inadequacies in the parametric form. The results show that the method is able to capture scatter in the data between the electron-beam experiments and ab-initio quantum simulations. The calibrated cross section models are further validated against measurements from swarm-parameter experiments."}
{"main_page": "https://arxiv.org/abs/2404.01071", "pdf": "https://arxiv.org/pdf/2404.01071", "title": "Machine Learning in High Energy Physics: A review of heavy-flavor jet  tagging at the LHC", "authors": "Spandan Mondal, Luca Mastrolorenzo", "subjects": "High Energy Physics - Experiment (hep-ex); Data Analysis, Statistics and Probability (physics.data-an)", "abstract": "The application of machine learning (ML) in high energy physics (HEP), specifically in heavy-flavor jet tagging at Large Hadron Collider (LHC) experiments, has experienced remarkable growth and innovation in the past decade. This review provides a detailed examination of current and past ML techniques in this domain. It starts by exploring various data representation methods and ML architectures, encompassing traditional ML algorithms and advanced deep learning techniques. Subsequent sections discuss specific instances of successful ML applications in jet flavor tagging in the ATLAS and CMS experiments at the LHC, ranging from basic fully-connected layers to graph neural networks employing attention mechanisms. To systematically categorize the advancements over the LHC's three runs, the paper classifies jet tagging algorithms into three generations, each characterized by specific data representation techniques and ML architectures. This classification aims to provide an overview of the chronological evolution in this field. Finally, a brief discussion about anticipated future developments and potential research directions in the field is presented."}
{"main_page": "https://arxiv.org/abs/2404.01193", "pdf": "https://arxiv.org/pdf/2404.01193", "title": "Inferring parameters and reconstruction of two-dimensional turbulent  flows with physics-informed neural networks", "authors": "Vladimir Parfenyev, Mark Blumenau, Ilya Nikitin", "subjects": "Fluid Dynamics (physics.flu-dyn); Data Analysis, Statistics and Probability (physics.data-an)", "abstract": "Solving inverse problems, which means obtaining model parameters from observed data, using conventional computational fluid dynamics solvers is prohibitively expensive. Here we employ machine learning algorithms to overcome the challenge. As an example, we consider a moderately turbulent fluid flow, excited by a stationary force and described by a two-dimensional Navier-Stokes equation with linear bottom friction. Given sparse and probably noisy data for the velocity and the general form of the model, we reconstruct the dense velocity and pressure fields in the observation domain, infer the driving force, and determine the unknown fluid viscosity and friction coefficient. Our approach involves training a physics-informed neural network by minimizing the loss function, which penalizes deviations from the provided data and violations of the Navier-Stokes equation. The suggested technique extracts additional information from experimental and numerical observations, potentially enhancing the capabilities of particle image/tracking velocimetry."}
