{"main_page": "https://arxiv.org/abs/2404.00020", "pdf": "https://arxiv.org/pdf/2404.00020", "title": "Interseções entre a Física e os saberes da tradição  ceramista", "authors": "Samuel Antonio Silva do Rosario, Carlos Aldemir Farias da Silva", "subjects": "History and Philosophy of Physics (physics.hist-ph); Physics Education (physics.ed-ph); Physics and Society (physics.soc-ph)", "abstract": "The growing interaction between traditional knowledge and formal sciences emerges as a relevant field of research. In this perspective, the aim of this article is to investigate the intersections between Physics and traditional knowledge in the ceramics practices of Vila Cuera, in Bragan\\c{c}a, state of Para. Using an ethnographic approach, complemented by qualitative analysis, we realize that ceramists use their sensitive intuition and, masterfully, apply thermodynamic principles in the production of handmade ceramics. The results highlight the value of Ethnophysics, underlining that, long before the formal structuring of science as we know it, traditional societies already practiced and understood natural phenomena in tune with contemporary physical principles. We conclude that there is an inherent link between Physics and traditional knowledge with regard to the traditional ceramics practice, grounded on empirical observations and ancestral wisdom, that dialogues with science in a complementary relationship. The study highlights the importance of valuing and recognizing the knowledge of traditional populations by highlighting the knowledge doings of cultures and institutionalized science."}
{"main_page": "https://arxiv.org/abs/2404.00948", "pdf": "https://arxiv.org/pdf/2404.00948", "title": "On the absolute entropy of monatomic bodies", "authors": "Pascal Marquet, Max Planck", "subjects": "History and Philosophy of Physics (physics.hist-ph)", "abstract": "This is an English (annotated) translation of the German paper by Max Planck (1916) \"On the absolute entropy of monatomic bodies\" (\\\"Uber die absolute Entropie einatomiger K\\\"orper)."}
{"main_page": "https://arxiv.org/abs/2404.00952", "pdf": "https://arxiv.org/pdf/2404.00952", "title": "The quantum hypothesis for molecules with multiple degrees of freedom;  Remarks on the entropy constant of diatomic gases", "authors": "Pascal Marquet, Max Planck", "subjects": "History and Philosophy of Physics (physics.hist-ph)", "abstract": "An English (2024) translation by P. Marquet of 3 German papers about \"Die Quantenhypothese f\\\"ur Molekeln mit mehreren Freiheitsgraden (The quantum hypothesis for molecules with multiple degrees of freedom)\" and \"Bemerkung \\\"uber die Entropiekonstante zweiatomiger Gase (Remarks on the entropy constant of diatomic gases)\" by Max Planck (1915,a,b,c)"}
