{"main_page": "https://arxiv.org/abs/2404.00817", "pdf": "https://arxiv.org/pdf/2404.00817", "title": "CRES-Based Non-destructive Electron Momentum Estimation for the PTOLEMY  Relic Neutrino Detector", "authors": "Yuno Iwasaki, Andi Tan, Christopher G. Tully (PTOLEMY Collaboration)", "subjects": "Instrumentation and Detectors (physics.ins-det); Nuclear Experiment (nucl-ex)", "abstract": "The novel electron spectrometry method proposed by the PTOLEMY relic neutrino experiment requires a real-time, non-destructive estimate of the parallel and transverse momentum splits of tritium $\\beta$-decay electrons. We propose to obtain this estimate using cyclotron-radiation emission spectroscopy (CRES), in which the kinetic energy of a charged particle is determined by measuring the relativistic frequency shift of the cyclotron radiation emitted by the particle in a magnetic field. This paper presents the first design for a configuration that can be feasibly integrated directly into the existing design for the transverse drift filter proposed by the PTOLEMY collaboration. We propose a geometry incorporating a cavity resonator to enhance a ${\\sim}\\mathcal{O}(1) \\hspace{1mm}\\mathrm{fW}$ cyclotron radiation signal and derive key features of the expected observed radiation specific to our RF tracking configuration. We estimate the performance of our design using electromagnetic simulations and present a general signal reconstruction algorithm capable of matching an observed signal to electron kinematic parameters. The projected SNR of this technique demonstrates for the first time that a non-destructive RF tracking system is applicable for the suppression of backgrounds in a differential energy measurement of tritium endpoint electrons."}
{"main_page": "https://arxiv.org/abs/2404.00905", "pdf": "https://arxiv.org/pdf/2404.00905", "title": "Continuously tunable uniaxial strain control of van der Waals  heterostructure devices", "authors": "Zhaoyu Liu, Xuetao Ma, John Cenker, Jiaqi Cai, Zaiyao Fei, Paul Malinowski, Joshua Mutch, Yuzho Zhao, Kyle Hwangbo, Zhong Lin, Arnab Manna, Jihui Yang, David Cobden, Xiaodong Xu, Matthew Yankowitz, Jiun-Haw Chu", "subjects": "Instrumentation and Detectors (physics.ins-det)", "abstract": "Uniaxial strain has been widely used as a powerful tool for investigating and controlling the properties of quantum materials. However, existing strain techniques have so far mostly been limited to use with bulk crystals. Although recent progress has been made in extending the application of strain to two-dimensional van der Waals (vdW) heterostructures, these techniques have been limited to optical characterization and extremely simple electrical device geometries. Here, we report a piezoelectric-based in-situ uniaxial strain technique enabling simultaneous electrical transport and optical spectroscopy characterization of dual-gated vdW heterostructure devices. Critically, our technique remains compatible with vdW heterostructure devices of arbitrary complexity fabricated on conventional silicon/silicon dioxide wafer substrates. We demonstrate a large and continuously tunable strain of up to $0.15$\\% at millikelvin temperatures, with larger strain values also likely achievable. We quantify the strain transmission from the silicon wafer to the vdW heterostructure, and further demonstrate the ability of strain to modify the electronic properties of twisted bilayer graphene. Our technique provides a highly versatile new method for exploring the effect of uniaxial strain on both the electrical and optical properties of vdW heterostructures, and can be easily extended to include additional characterization techniques."}
{"main_page": "https://arxiv.org/abs/2404.01208", "pdf": "https://arxiv.org/pdf/2404.01208", "title": "TOFHIR2: The readout ASIC of the CMS Barrel MIP Timing Detector", "authors": "E. Albuquerque (5), M. Araújo (4), A. Benaglia (3), A. Boletti (4), R. Bugalho (5), T. Coutinho (5), F. De Guio (3 and 6), P. Faccioli (4), L. Ferramacho (5), M. Firlej (1), T. Fiutowski (1), R. Francisco (5), M. Gallinaro (4), A. Ghezzi (3 and 6), J. Hollar (4), M. Idzik (1), H. Legoinha (4), N. Leonardo (4), C. Leong (5), M.T. Lucchini (3), M. Malberti (3), G. Marozzo (4), G. Da Molin (4), J. Moron (1), T. Niknejad (4 and 5), L. Oliveira (2), N. Oliveira (5), S. Palluotto (3 and 6), M. Pisano (4), N. Redaelli (3), C. Silva (4), J. C. Silva (4 and 5), R. Silva (4 and 5), M. Silveira (5), K. Swientek (1), T. Tabarelli de Fatis (3 and 6), S. Tavernier (5), J. Varela (4 and 5), V. Varela (5), S. White (7), J. Wulff (4) ((1) AGH University of Krakow, Faculty of Physics and Applied Computer Science, Krakow, Poland, (2) DEE, CTS-UNINOVA, FCT-UNL, Caparica, Portugal, (3) INFN Sez. Milano Bicocca, Italy, (4) LIP, Lisbon, Portugal, (5) PETsys Electronics, Oeiras, Portugal, (6) University of Milano-Bicocca, Milano, Italy, (7) University of Virginia, Charlottesville, Virginia, USA)", "subjects": "Instrumentation and Detectors (physics.ins-det); High Energy Physics - Experiment (hep-ex)", "abstract": "The CMS detector will be upgraded for the HL-LHC to include a MIP Timing Detector (MTD). The MTD will consist of barrel and endcap timing layers, BTL and ETL respectively, providing precision timing of charged particles. The BTL sensors are based on LYSO:Ce scintillation crystals coupled to SiPMs with TOFHIR2 ASICs for the front-end readout. A resolution of 30-60 ps for MIP signals at a rate of 2.5 Mhit/s per channel is expected along the HL-LHC lifetime. We present an overview of the TOFHIR2 requirements and design, simulation results and measurements with TOFHIR2 ASICs. The measurements of TOFHIR2 associated to sensor modules were performed in different test setups using internal test pulses or blue and UV laser pulses emulating the signals expected in the experiment. The measurements show a time resolution of 24 ps initially during Beginning of Operation (BoO) and 58 ps at End of Operation (EoO) conditions, matching well the BTL requirements. We also showed that the time resolution is stable up to the highest expected MIP rate. Extensive radiation tests were performed, both with x-rays and heavy ions, showing that TOFHIR2 is not affected by the radiation environment during the experiment lifetime."}
