{"main_page": "https://arxiv.org/abs/2404.00110", "pdf": "https://arxiv.org/pdf/2404.00110", "title": "Microbial assessment in a rare Norwegian book collection: a One Health  approach to cultural heritage", "authors": "Sílvia O. Sequeira, Ekaterina Pasnak, Carla Viegas, Bianca Gomes, Marta Dias, Renata Cervantes, Pedro Pena, Magdalena Twarużek, Robert Kosicki, Susana Viegas, Liliana Aranha Caetano, Maria João Penetra, Inês Santos, Ana Teresa Caldeira, Catarina Pinheiro", "subjects": "Populations and Evolution (q-bio.PE); Biomolecules (q-bio.BM)", "abstract": "Microbial contamination poses a threat to both the preservation of library and archival collections and the health of staff and users. This study investigated the microbial communities and potential health risks associated with the UNESCO-classified Norwegian Sea Trade Archive (NSTA) collection exhibiting visible microbial colonization and staff health concerns. Dust samples from book surfaces and the storage environment were analysed using culturing methods, qPCR, Next Generation Sequencing, and mycotoxin, cytotoxicity and azole resistance assays. Penicillium sp., Aspergillus sp., and Cladosporium sp. were the most common fungi identified, with some potentially toxic species like Stachybotrys sp., Toxicladosporium sp. and Aspergillus section Fumigati. Fungal resistance to azoles was not detected. Only one mycotoxin, sterigmatocystin, was found in a heavily contaminated book. Dust extracts from books exhibited moderate to high cytotoxicity on human lung cells, suggesting a potential respiratory risk. The collection had higher contamination levels compared to the storage environment, likely due to improved storage conditions. Even though, overall low contamination levels were obtained, which might be underestimated due to the presence of salt (from cod preservation) that could have interfered with the analyses. This study underlines the importance of monitoring microbial communities and implementing proper storage measures to safeguard cultural heritage and staff well-being."}
{"main_page": "https://arxiv.org/abs/2404.00365", "pdf": "https://arxiv.org/pdf/2404.00365", "title": "An age-distributed immuno-epidemiological model with information-based  vaccination decision", "authors": "Samiran Ghosh, Malay Banerjee, Vitaly Volpert", "subjects": "Populations and Evolution (q-bio.PE); Dynamical Systems (math.DS)", "abstract": "A new age-distributed immuno-epidemiological model with information-based vaccine uptake suggested in this work represents a system of integro-differential equations for the numbers of susceptible individuals, infected individuals, vaccinated individuals and recovered individuals. This model describes the influence of vaccination decision on epidemic progression in different age groups. We prove the existence and uniqueness of a positive solution using the fixed point theory. In a particular case of age-independent model, we determine the final size of epidemic, that is, the limiting number of susceptible individuals at asymptotically large time. Numerical simulations show that the information-based vaccine acceptance can significantly influence the epidemic progression. Though the initial stage of epidemic progression is the same for all memory kernels, as the epidemic progresses and more information about the disease becomes available, further epidemic progression strongly depends on the memory effect. Short-range memory kernel appears to be more effective in restraining the epidemic outbreaks because it allows for more responsive and adaptive vaccination decisions based on the most recent information about the disease."}
{"main_page": "https://arxiv.org/abs/2404.00822", "pdf": "https://arxiv.org/pdf/2404.00822", "title": "Impact of heterogeneity on infection probability: Insights from  single-hit dose-response models", "authors": "Francisco J. Perez-Reche", "subjects": "Populations and Evolution (q-bio.PE); Probability (math.PR)", "abstract": "The process of infection of a host is complex, influenced by factors such as microbial variation within and between hosts as well as differences in dose across hosts. This study uses dose-response and microbial growth models to delve into the impact of these factors on infection probability. It is rigorously demonstrated that within-host heterogeneity in microbial infectivity enhances the probability of infection. The effect of infectivity and dose variation between hosts is studied in terms of the expected value of the probability of infection. General analytical findings, derived under the assumption of small infectivity, reveal that both types of heterogeneity reduce the expected infection probability. Interestingly, this trend appears consistent across specific dose-response models, suggesting a limited role for the small infectivity condition. Additionally, the vital dynamics behind heterogeneous infectivity are investigated with a microbial growth model which enhances the biological significance of single-hit dose-response models. Testing these mathematical predictions inspire new and challenging laboratory experiments that could deepen our understanding of infections."}
