{"main_page": "https://arxiv.org/abs/2404.00111", "pdf": "https://arxiv.org/pdf/2404.00111", "title": "Variational design of sensory feedback for powerstroke-recovery systems", "authors": "Zhuojun Yu, Peter J. Thomas", "subjects": "Neurons and Cognition (q-bio.NC)", "abstract": "Although the raison d'etre of the brain is the survival of the body, there are relatively few theoretical studies of closed-loop rhythmic motor control systems. In this paper we provide a unified framework, based on variational analysis, for investigating the dual goals of performance and robustness in powerstroke-recovery systems. We augment two previously published closed-loop motor control models by equipping each model with a performance measure based on the rate of progress of the system relative to a spatially extended external substrate -- such as progress relative to the ground for a locomotor task. The sensitivity measure quantifies the ability of the system to maintain performance in response to external perturbations. Motivated by a search for optimal design principles for feedback control achieving the complementary requirements of efficiency and robustness, we discuss the performance-sensitivity patterns of the systems featuring different sensory feedback architectures. In a paradigmatic half-center oscillator (HCO)-motor system, we observe that the excitation-inhibition property of feedback mechanisms determines the sensitivity pattern while the activation-inactivation property determines the performance pattern. Moreover, we show that the nonlinearity of the sigmoid activation of feedback signals allows the existence of optimal combinations of performance and sensitivity. In a detailed hindlimb locomotor system, we find that a force-dependent feedback can simultaneously optimize both performance and robustness, while length-dependent feedback variations result in significant performance-versus-sensitivity tradeoffs. Thus, this work provides an analytical framework for studying feedback control of oscillations in nonlinear dynamical systems, leading to several insights that have the potential to inform the design of control or rehabilitation systems."}
{"main_page": "https://arxiv.org/abs/2404.01183", "pdf": "https://arxiv.org/pdf/2404.01183", "title": "Positioning is All You Need", "authors": "Xin Li", "subjects": "Neurons and Cognition (q-bio.NC); Adaptation and Self-Organizing Systems (nlin.AO)", "abstract": "One can drive around safely using a GPS without memorizing a world map (not to mention the dark regions that humans have never explored) because we only pay attention to the next instruction of turning. Such simple observation with attention mechanism has a profound implication on our understanding of how the brain works. The nonlinear effects generated by inhibitory networks have long been known to provide a ``winner-take-all'' mechanism for localized attention. This attention mechanism, at the system level, implements the selection/positioning operation needed by the hippocampus to provide spatio-temporal context to the neocortex. The localized receptive field of sensory organs, when inspected under the framework of embodied cognition, turns from a constraint to an advantage. Since we only need access to a local map, positioning works better than reconstruction. Such simple intuition implies that the attention mechanism is all you need to understand the flexible behavior generated by hippocampal-neocortical systems. Geometrically, we present a novel manifold positioning framework to explain the principle of localized embodied cognition. Through the co-evolution of the hippocampus and the neocortex, the positioning operation implemented by the attention mechanism can be interpreted as a nonlinear projection linking the discovery of local subspace structure by the neocortex (a sensorimotor machine generating the world map) with the navigation task in mind and $without$ discovering global manifold topology by the hippocampus (the neocortex's map index)."}
{"main_page": "https://arxiv.org/abs/2404.01250", "pdf": "https://arxiv.org/pdf/2404.01250", "title": "Image Reconstruction from Electroencephalography Using Latent Diffusion", "authors": "Teng Fei, Virginia de Sa", "subjects": "Neurons and Cognition (q-bio.NC); Human-Computer Interaction (cs.HC)", "abstract": "In this work, we have adopted the diffusion-based image reconstruction pipeline previously used for fMRI image reconstruction and applied it to Electroencephalography (EEG). The EEG encoding method is very simple, and forms a baseline from which more sophisticated EEG encoding methods can be compared. We have also evaluated the fidelity of the generated image using the same metrics used in the previous functional magnetic resonance imaging (fMRI) and magnetoencephalography (MEG) works. Our results show that while the reconstruction from EEG recorded to rapidly presented images is not as good as reconstructions from fMRI to slower presented images, it holds a surprising amount of information that could be applied in specific use cases. Also, EEG-based image reconstruction works better in some categories-such as land animals and food-than others, shedding new light on previous findings of EEG's sensitivity to those categories and revealing potential for these methods to further understand EEG responses to human visual coding. More investigation should use longer-duration image stimulations to elucidate the later components that might be salient to the different image categories."}
