{"main_page": "https://arxiv.org/abs/2403.19087", "pdf": "https://arxiv.org/pdf/2403.19087", "title": "Just-DNA-Seq, open-source personal genomics platform: longevity science  for everyone", "authors": "Kulaga Anton (1,2,3,4), Borysova Olga (4,6), Karmazin Alexey (4,7), Koval Maria (3,4), Usanov Nikolay (3,4), Fedorova Alina (3), Evfratov Sergey (3), Pushkareva Malvina (3), Ryangguk Kim (8), Tacutu Robi (2, 5) ((1) Institute for Biostatistics and Informatics in Medicine and Ageing Research (2), (3) Institute of Biochemistry of the Romanian Academy, (4) International Longevity Alliance (ILA), (5) SecvADN SRL, (6) CellFabrik SRL, (7) MitoSpace, (8) M. Glushkov Institute of Cybernetics of National Academy of Sciences of Ukraine, (8) Oak Bioinformatics LLC)", "subjects": "Genomics (q-bio.GN)", "abstract": "Genomic data has become increasingly accessible to the general public with the advent of companies offering whole genome sequencing at a relatively low cost. However, their reports are not verifiable due to a lack of crucial details and transparency: polygenic risk scores do not always mention all the polymorphisms involved. Simultaneously, tackling the manual investigation and interpretation of data proves challenging for individuals lacking a background in genetics. Currently, there is no open-source or commercial solution that provides comprehensive longevity reports surpassing a limited number of polymorphisms. Additionally, there are no ready-made, out-of-the-box solutions available that require minimal expertise to generate reports independently. To address these issues, we have developed the Just-DNA-Seq open-source genomic platform. Just-DNA-Seq aims to provide a user-friendly solution to genome annotation by allowing users to upload their own VCF files and receive annotations of their genetic variants and polygenic risk scores related to longevity. We also created GeneticsGenie custom GPT that can answer genetics questions based on our modules. With the Just-DNA-Seq platform, we want to provide full information regarding the genetics of long life: disease-predisposing variants, that can reduce lifespan and manifest at different age (cardiovascular, oncological, neurodegenerative diseases, etc.), pro-longevity variants and longevity drug pharmacokinetics. In this research article, we will discuss the features and capabilities of Just-DNA-Seq, and how it can benefit individuals looking to understand and improve their health. It's crucial to note that the Just-DNA-Seq platform is exclusively intended for scientific and informational purposes and is not suitable for medical applications."}
{"main_page": "https://arxiv.org/abs/2403.19416", "pdf": "https://arxiv.org/pdf/2403.19416", "title": "Navigating Eukaryotic Genome Annotation Pipelines: A Route Map to  BRAKER, Galba, and TSEBRA", "authors": "Tomáš Brůna, Lars Gabriel, Katharina J. Hoff", "subjects": "Genomics (q-bio.GN)", "abstract": "Annotating the structure of protein-coding genes represents a major challenge in the analysis of eukaryotic genomes. This task sets the groundwork for subsequent genomic studies aimed at understanding the functions of individual genes. BRAKER and Galba are two fully automated and containerized pipelines designed to perform accurate genome annotation. BRAKER integrates the GeneMark-ETP and AUGUSTUS gene finders, employing the TSEBRA combiner to attain high sensitivity and precision. BRAKER is adept at handling genomes of any size, provided that it has access to both transcript expression sequencing data and an extensive protein database from the target clade. In particular, BRAKER demonstrates high accuracy even with only one type of these extrinsic evidence sources, although it should be noted that accuracy diminishes for larger genomes under such conditions. In contrast, Galba adopts a distinct methodology utilizing the outcomes of direct protein-to-genome spliced alignments using miniprot to generate training genes and evidence for gene prediction in AUGUSTUS. Galba has superior accuracy in large genomes if protein sequences are the only source of evidence. This chapter provides practical guidelines for employing both pipelines in the annotation of eukaryotic genomes, with a focus on insect genomes."}
