{"main_page": "https://arxiv.org/abs/2404.00183", "pdf": "https://arxiv.org/pdf/2404.00183", "title": "Shared Hardships Strengthen Bonds: Negative Shocks, Embeddedness and  Employee Retention", "authors": "Andrew Balthrop, Hyunseok Jung", "subjects": "General Economics (econ.GN)", "abstract": "Unexpected events -- \"shocks\" -- are the motive force in explaining changes in embeddedness and retention within the unfolding model of labor turnover. Substantial research effort has examined strategies for insulating valued employees from adverse shocks. However, this paper provides empirical evidence that unambiguously negative shocks can increase employee retention when underlying firm and employee incentives with respect to these shocks are aligned. Using survival analysis on a unique data set of 466,236 communication records and 45,873 employment spells from 21 trucking companies, we show how equipment-related shocks tend to increase the duration of employment. Equipment shocks also generate paradoxically positive sentiments that demonstrate an increase in employees' affective commitment to the firm. Our results highlight the important moderating role aligned incentives have in how shocks ultimately translate into retention. Shared hardships strengthen bonds in employment as in other areas."}
{"main_page": "https://arxiv.org/abs/2404.00806", "pdf": "https://arxiv.org/pdf/2404.00806", "title": "Algorithmic Collusion by Large Language Models", "authors": "Sara Fish, Yannai A. Gonczarowski, Ran I. Shorrer", "subjects": "General Economics (econ.GN); Artificial Intelligence (cs.AI); Computer Science and Game Theory (cs.GT)", "abstract": "The rise of algorithmic pricing raises concerns of algorithmic collusion. We conduct experiments with algorithmic pricing agents based on Large Language Models (LLMs), and specifically GPT-4. We find that (1) LLM-based agents are adept at pricing tasks, (2) LLM-based pricing agents autonomously collude in oligopoly settings to the detriment of consumers, and (3) variation in seemingly innocuous phrases in LLM instructions (\"prompts\") may increase collusion. These results extend to auction settings. Our findings underscore the need for antitrust regulation regarding algorithmic pricing, and uncover regulatory challenges unique to LLM-based pricing agents."}
