{"main_page": "https://arxiv.org/abs/2404.00187", "pdf": "https://arxiv.org/pdf/2404.00187", "title": "Portfolio management using graph centralities: Review and comparison", "authors": "Bahar Arslan, Vanni Noferini, Spyridon Vrontos", "subjects": "Portfolio Management (q-fin.PM); Combinatorics (math.CO); Computational Finance (q-fin.CP)", "abstract": "We investigate an application of network centrality measures to portfolio optimization, by generalizing the method in [Pozzi, Di Matteo and Aste, \\emph{Spread of risks across financial markets: better to invest in the peripheries}, Scientific Reports 3:1665, 2013], that however had significant limitations with respect to the state of the art in network theory. In this paper, we systematically compare many possible variants of the originally proposed method on S\\&P 500 stocks. We use daily data from twenty-seven years as training set and their following year as test set. We thus select the best network-based methods according to different viewpoints including for instance the highest Sharpe Ratio and the highest expected return. We give emphasis in new centrality measures and we also conduct a thorough analysis, which reveals significantly stronger results compared to those with more traditional methods. According to our analysis, this graph-theoretical approach to investment can be used successfully by investors with different investment profiles leading to high risk-adjusted returns."}
{"main_page": "https://arxiv.org/abs/2404.00825", "pdf": "https://arxiv.org/pdf/2404.00825", "title": "Using Machine Learning to Forecast Market Direction with Efficient  Frontier Coefficients", "authors": "Nolan Alexander, William Scherer", "subjects": "Portfolio Management (q-fin.PM)", "abstract": "We propose a novel method to improve estimation of asset returns for portfolio optimization. This approach first performs a monthly directional market forecast using an online decision tree. The decision tree is trained on a novel set of features engineered from portfolio theory: the efficient frontier functional coefficients. Efficient frontiers can be decomposed to their functional form, a square-root second-order polynomial, and the coefficients of this function captures the information of all the constituents that compose the market in the current time period. To make these forecasts actionable, these directional forecasts are integrated to a portfolio optimization framework using expected returns conditional on the market forecast as an estimate for the return vector. This conditional expectation is calculated using the inverse Mills ratio, and the Capital Asset Pricing Model is used to translate the market forecast to individual asset forecasts. This novel method outperforms baseline portfolios, as well as other feature sets including technical indicators and the Fama-French factors. To empirically validate the proposed model, we employ a set of market sector ETFs."}
