{"main_page": "https://arxiv.org/abs/2404.00028", "pdf": "https://arxiv.org/pdf/2404.00028", "title": "Antinetwork among China A-shares", "authors": "Peng Liu", "subjects": "Statistical Finance (q-fin.ST); General Economics (econ.GN); Physics and Society (physics.soc-ph); General Finance (q-fin.GN)", "abstract": "The correlation-based financial networks, constructed with the correlation relationships among the time series of fluctuations of daily logarithmic prices of stocks, are intensively studied. However, these studies ignore the importance of negative correlations. This paper is the first time to consider the negative and positive correlations separately, and accordingly to construct weighted temporal antinetwork and network among stocks listed in the Shanghai and Shenzhen stock exchanges. For (anti)networks during the first 24 years of the 21st century, the node's degree and strength, the assortativity coefficient, the average local clustering coefficient, and the average shortest path length are analyzed systematically. This paper unveils some essential differences in these topological measurements between antinetwork and network. The findings of the differences between antinetwork and network have an important role in understanding the dynamics of a financial complex system. The observation of antinetwork is of great importance in optimizing investment portfolios and risk management. More importantly, this paper proposes a new direction for studying complex systems, namely the correlation-based antinetwork."}
{"main_page": "https://arxiv.org/abs/2404.00034", "pdf": "https://arxiv.org/pdf/2404.00034", "title": "Investigating Similarities Across Decentralized Financial (DeFi)  Services", "authors": "Junliang Luo, Stefan Kitzler, Pietro Saggese", "subjects": "Statistical Finance (q-fin.ST); Machine Learning (cs.LG); General Finance (q-fin.GN)", "abstract": "We explore the adoption of graph representation learning (GRL) algorithms to investigate similarities across services offered by Decentralized Finance (DeFi) protocols. Following existing literature, we use Ethereum transaction data to identify the DeFi building blocks. These are sets of protocol-specific smart contracts that are utilized in combination within single transactions and encapsulate the logic to conduct specific financial services such as swapping or lending cryptoassets. We propose a method to categorize these blocks into clusters based on their smart contract attributes and the graph structure of their smart contract calls. We employ GRL to create embedding vectors from building blocks and agglomerative models for clustering them. To evaluate whether they are effectively grouped in clusters of similar functionalities, we associate them with eight financial functionality categories and use this information as the target label. We find that in the best-case scenario purity reaches .888. We use additional information to associate the building blocks with protocol-specific target labels, obtaining comparable purity (.864) but higher V-Measure (.571); we discuss plausible explanations for this difference. In summary, this method helps categorize existing financial products offered by DeFi protocols, and can effectively automatize the detection of similar DeFi services, especially within protocols."}
