{"main_page": "https://arxiv.org/abs/2404.00012", "pdf": "https://arxiv.org/pdf/2404.00012", "title": "Stress index strategy enhanced with financial news sentiment analysis  for the equity markets", "authors": "Baptiste Lefort, Eric Benhamou, Jean-Jacques Ohana, David Saltiel, Beatrice Guez, Thomas Jacquot", "subjects": "Statistical Finance (q-fin.ST); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Risk Management (q-fin.RM)", "abstract": "This paper introduces a new risk-on risk-off strategy for the stock market, which combines a financial stress indicator with a sentiment analysis done by ChatGPT reading and interpreting Bloomberg daily market summaries. Forecasts of market stress derived from volatility and credit spreads are enhanced when combined with the financial news sentiment derived from GPT-4. As a result, the strategy shows improved performance, evidenced by higher Sharpe ratio and reduced maximum drawdowns. The improved performance is consistent across the NASDAQ, the S&P 500 and the six major equity markets, indicating that the method generalises across equities markets."}
{"main_page": "https://arxiv.org/abs/2404.00015", "pdf": "https://arxiv.org/pdf/2404.00015", "title": "Empowering Credit Scoring Systems with Quantum-Enhanced Machine Learning", "authors": "Javier Mancilla, André Sequeira, Iraitz Montalbán, Tomas Tagliani, Frnacisco Llaneza, Claudio Beiza", "subjects": "Risk Management (q-fin.RM); Machine Learning (cs.LG); Statistical Finance (q-fin.ST); Quantum Physics (quant-ph); Machine Learning (stat.ML)", "abstract": "Quantum Kernels are projected to provide early-stage usefulness for quantum machine learning. However, highly sophisticated classical models are hard to surpass without losing interpretability, particularly when vast datasets can be exploited. Nonetheless, classical models struggle once data is scarce and skewed. Quantum feature spaces are projected to find better links between data features and the target class to be predicted even in such challenging scenarios and most importantly, enhanced generalization capabilities. In this work, we propose a novel approach called Systemic Quantum Score (SQS) and provide preliminary results indicating potential advantage over purely classical models in a production grade use case for the Finance sector. SQS shows in our specific study an increased capacity to extract patterns out of fewer data points as well as improved performance over data-hungry algorithms such as XGBoost, providing advantage in a competitive market as it is the FinTech and Neobank regime."}
{"main_page": "https://arxiv.org/abs/2404.00028", "pdf": "https://arxiv.org/pdf/2404.00028", "title": "Antinetwork among China A-shares", "authors": "Peng Liu", "subjects": "Statistical Finance (q-fin.ST); General Economics (econ.GN); Physics and Society (physics.soc-ph); General Finance (q-fin.GN)", "abstract": "The correlation-based financial networks, constructed with the correlation relationships among the time series of fluctuations of daily logarithmic prices of stocks, are intensively studied. However, these studies ignore the importance of negative correlations. This paper is the first time to consider the negative and positive correlations separately, and accordingly to construct weighted temporal antinetwork and network among stocks listed in the Shanghai and Shenzhen stock exchanges. For (anti)networks during the first 24 years of the 21st century, the node's degree and strength, the assortativity coefficient, the average local clustering coefficient, and the average shortest path length are analyzed systematically. This paper unveils some essential differences in these topological measurements between antinetwork and network. The findings of the differences between antinetwork and network have an important role in understanding the dynamics of a financial complex system. The observation of antinetwork is of great importance in optimizing investment portfolios and risk management. More importantly, this paper proposes a new direction for studying complex systems, namely the correlation-based antinetwork."}
{"main_page": "https://arxiv.org/abs/2404.00034", "pdf": "https://arxiv.org/pdf/2404.00034", "title": "Investigating Similarities Across Decentralized Financial (DeFi)  Services", "authors": "Junliang Luo, Stefan Kitzler, Pietro Saggese", "subjects": "Statistical Finance (q-fin.ST); Machine Learning (cs.LG); General Finance (q-fin.GN)", "abstract": "We explore the adoption of graph representation learning (GRL) algorithms to investigate similarities across services offered by Decentralized Finance (DeFi) protocols. Following existing literature, we use Ethereum transaction data to identify the DeFi building blocks. These are sets of protocol-specific smart contracts that are utilized in combination within single transactions and encapsulate the logic to conduct specific financial services such as swapping or lending cryptoassets. We propose a method to categorize these blocks into clusters based on their smart contract attributes and the graph structure of their smart contract calls. We employ GRL to create embedding vectors from building blocks and agglomerative models for clustering them. To evaluate whether they are effectively grouped in clusters of similar functionalities, we associate them with eight financial functionality categories and use this information as the target label. We find that in the best-case scenario purity reaches .888. We use additional information to associate the building blocks with protocol-specific target labels, obtaining comparable purity (.864) but higher V-Measure (.571); we discuss plausible explanations for this difference. In summary, this method helps categorize existing financial products offered by DeFi protocols, and can effectively automatize the detection of similar DeFi services, especially within protocols."}
{"main_page": "https://arxiv.org/abs/2404.00060", "pdf": "https://arxiv.org/pdf/2404.00060", "title": "Temporal Graph Networks for Graph Anomaly Detection in Financial  Networks", "authors": "Yejin Kim, Youngbin Lee, Minyoung Choe, Sungju Oh, Yongjae Lee", "subjects": "Statistical Finance (q-fin.ST); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)", "abstract": "This paper explores the utilization of Temporal Graph Networks (TGN) for financial anomaly detection, a pressing need in the era of fintech and digitized financial transactions. We present a comprehensive framework that leverages TGN, capable of capturing dynamic changes in edges within financial networks, for fraud detection. Our study compares TGN's performance against static Graph Neural Network (GNN) baselines, as well as cutting-edge hypergraph neural network baselines using DGraph dataset for a realistic financial context. Our results demonstrate that TGN significantly outperforms other models in terms of AUC metrics. This superior performance underlines TGN's potential as an effective tool for detecting financial fraud, showcasing its ability to adapt to the dynamic and complex nature of modern financial systems. We also experimented with various graph embedding modules within the TGN framework and compared the effectiveness of each module. In conclusion, we demonstrated that, even with variations within TGN, it is possible to achieve good performance in the anomaly detection task."}
{"main_page": "https://arxiv.org/abs/2404.00183", "pdf": "https://arxiv.org/pdf/2404.00183", "title": "Shared Hardships Strengthen Bonds: Negative Shocks, Embeddedness and  Employee Retention", "authors": "Andrew Balthrop, Hyunseok Jung", "subjects": "General Economics (econ.GN)", "abstract": "Unexpected events -- \"shocks\" -- are the motive force in explaining changes in embeddedness and retention within the unfolding model of labor turnover. Substantial research effort has examined strategies for insulating valued employees from adverse shocks. However, this paper provides empirical evidence that unambiguously negative shocks can increase employee retention when underlying firm and employee incentives with respect to these shocks are aligned. Using survival analysis on a unique data set of 466,236 communication records and 45,873 employment spells from 21 trucking companies, we show how equipment-related shocks tend to increase the duration of employment. Equipment shocks also generate paradoxically positive sentiments that demonstrate an increase in employees' affective commitment to the firm. Our results highlight the important moderating role aligned incentives have in how shocks ultimately translate into retention. Shared hardships strengthen bonds in employment as in other areas."}
{"main_page": "https://arxiv.org/abs/2404.00187", "pdf": "https://arxiv.org/pdf/2404.00187", "title": "Portfolio management using graph centralities: Review and comparison", "authors": "Bahar Arslan, Vanni Noferini, Spyridon Vrontos", "subjects": "Portfolio Management (q-fin.PM); Combinatorics (math.CO); Computational Finance (q-fin.CP)", "abstract": "We investigate an application of network centrality measures to portfolio optimization, by generalizing the method in [Pozzi, Di Matteo and Aste, \\emph{Spread of risks across financial markets: better to invest in the peripheries}, Scientific Reports 3:1665, 2013], that however had significant limitations with respect to the state of the art in network theory. In this paper, we systematically compare many possible variants of the originally proposed method on S\\&P 500 stocks. We use daily data from twenty-seven years as training set and their following year as test set. We thus select the best network-based methods according to different viewpoints including for instance the highest Sharpe Ratio and the highest expected return. We give emphasis in new centrality measures and we also conduct a thorough analysis, which reveals significantly stronger results compared to those with more traditional methods. According to our analysis, this graph-theoretical approach to investment can be used successfully by investors with different investment profiles leading to high risk-adjusted returns."}
{"main_page": "https://arxiv.org/abs/2404.00424", "pdf": "https://arxiv.org/pdf/2404.00424", "title": "From attention to profit: quantitative trading strategy based on  transformer", "authors": "Zhaofeng Zhang, Banghao Chen, Shengxin Zhu, Nicolas Langrené", "subjects": "Mathematical Finance (q-fin.MF); Artificial Intelligence (cs.AI); Computational Engineering, Finance, and Science (cs.CE)", "abstract": "In traditional quantitative trading practice, navigating the complicated and dynamic financial market presents a persistent challenge. Former machine learning approaches have struggled to fully capture various market variables, often ignore long-term information and fail to catch up with essential signals that may lead the profit. This paper introduces an enhanced transformer architecture and designs a novel factor based on the model. By transfer learning from sentiment analysis, the proposed model not only exploits its original inherent advantages in capturing long-range dependencies and modelling complex data relationships but is also able to solve tasks with numerical inputs and accurately forecast future returns over a period. This work collects more than 5,000,000 rolling data of 4,601 stocks in the Chinese capital market from 2010 to 2019. The results of this study demonstrated the model's superior performance in predicting stock trends compared with other 100 factor-based quantitative strategies with lower turnover rates and a more robust half-life period. Notably, the model's innovative use transformer to establish factors, in conjunction with market sentiment information, has been shown to enhance the accuracy of trading signals significantly, thereby offering promising implications for the future of quantitative trading strategies."}
{"main_page": "https://arxiv.org/abs/2404.00806", "pdf": "https://arxiv.org/pdf/2404.00806", "title": "Algorithmic Collusion by Large Language Models", "authors": "Sara Fish, Yannai A. Gonczarowski, Ran I. Shorrer", "subjects": "General Economics (econ.GN); Artificial Intelligence (cs.AI); Computer Science and Game Theory (cs.GT)", "abstract": "The rise of algorithmic pricing raises concerns of algorithmic collusion. We conduct experiments with algorithmic pricing agents based on Large Language Models (LLMs), and specifically GPT-4. We find that (1) LLM-based agents are adept at pricing tasks, (2) LLM-based pricing agents autonomously collude in oligopoly settings to the detriment of consumers, and (3) variation in seemingly innocuous phrases in LLM instructions (\"prompts\") may increase collusion. These results extend to auction settings. Our findings underscore the need for antitrust regulation regarding algorithmic pricing, and uncover regulatory challenges unique to LLM-based pricing agents."}
{"main_page": "https://arxiv.org/abs/2404.00825", "pdf": "https://arxiv.org/pdf/2404.00825", "title": "Using Machine Learning to Forecast Market Direction with Efficient  Frontier Coefficients", "authors": "Nolan Alexander, William Scherer", "subjects": "Portfolio Management (q-fin.PM)", "abstract": "We propose a novel method to improve estimation of asset returns for portfolio optimization. This approach first performs a monthly directional market forecast using an online decision tree. The decision tree is trained on a novel set of features engineered from portfolio theory: the efficient frontier functional coefficients. Efficient frontiers can be decomposed to their functional form, a square-root second-order polynomial, and the coefficients of this function captures the information of all the constituents that compose the market in the current time period. To make these forecasts actionable, these directional forecasts are integrated to a portfolio optimization framework using expected returns conditional on the market forecast as an estimate for the return vector. This conditional expectation is calculated using the inverse Mills ratio, and the Capital Asset Pricing Model is used to translate the market forecast to individual asset forecasts. This novel method outperforms baseline portfolios, as well as other feature sets including technical indicators and the Fama-French factors. To empirically validate the proposed model, we employ a set of market sector ETFs."}
