{"main_page": "https://arxiv.org/abs/2404.00091", "pdf": "https://arxiv.org/pdf/2404.00091", "title": "Non-Abelian braiding of Fibonacci anyons with a superconducting  processor", "authors": "Shibo Xu, Zheng-Zhi Sun, Ke Wang, Hekang Li, Zitian Zhu, Hang Dong, Jinfeng Deng, Xu Zhang, Jiachen Chen, Yaozu Wu, Chuanyu Zhang, Feitong Jin, Xuhao Zhu, Yu Gao, Aosai Zhang, Ning Wang, Yiren Zou, Ziqi Tan, Fanhao Shen, Jiarun Zhong, Zehang Bao, Weikang Li, Wenjie Jiang, Li-Wei Yu, Zixuan Song, Pengfei Zhang, Liang Xiang, Qiujiang Guo, Zhen Wang, Chao Song, H. Wang, Dong-Ling Deng", "subjects": "Quantum Physics (quant-ph)", "abstract": "Non-Abelian topological orders offer an intriguing path towards fault-tolerant quantum computation, where information can be encoded and manipulated in a topologically protected manner immune to arbitrary local noises and perturbations. However, realizing non-Abelian topologically ordered states is notoriously challenging in both condensed matter and programmable quantum systems, and it was not until recently that signatures of non-Abelian statistics were observed through digital quantum simulation approaches. Despite these exciting progresses, none of them has demonstrated the appropriate type of topological orders and associated non-Abelian anyons whose braidings alone support universal quantum computation. Here, we report the realization of non-Abelian topologically ordered states of the Fibonacci string-net model and demonstrate braidings of Fibonacci anyons featuring universal computational power, with a superconducting quantum processor. We exploit efficient quantum circuits to prepare the desired states and verify their nontrivial topological nature by measuring the topological entanglement entropy. In addition, we create two pairs of Fibonacci anyons and demonstrate their fusion rule and non-Abelian braiding statistics by applying unitary gates on the underlying physical qubits. Our results establish a versatile digital approach to exploring exotic non-Abelian topological states and their associated braiding statistics with current noisy intermediate-scale quantum processors."}
{"main_page": "https://arxiv.org/abs/2404.00126", "pdf": "https://arxiv.org/pdf/2404.00126", "title": "Pseudoentanglement Ain't Cheap", "authors": "Sabee Grewal, Vishnu Iyer, William Kretschmer, Daniel Liang", "subjects": "Quantum Physics (quant-ph); Computational Complexity (cs.CC)", "abstract": "We show that any pseudoentangled state ensemble with a gap of $t$ bits of entropy requires $\\Omega(t)$ non-Clifford gates to prepare. This bound is tight up to polylogarithmic factors if linear-time quantum-secure pseudorandom functions exist. Our result follows from a polynomial-time algorithm to estimate the entanglement entropy of a quantum state across any cut of qubits. When run on an $n$-qubit state that is stabilized by at least $2^{n-t}$ Pauli operators, our algorithm produces an estimate that is within an additive factor of $\\frac{t}{2}$ bits of the true entanglement entropy."}
{"main_page": "https://arxiv.org/abs/2404.00142", "pdf": "https://arxiv.org/pdf/2404.00142", "title": "Loss resilience of driven-dissipative remote entanglement in chiral  waveguide quantum electrodynamics", "authors": "Abdullah Irfan, Mingxing Yao, Andrew Lingenfelter, Xi Cao, Aashish A. Clerk, Wolfgang Pfaff", "subjects": "Quantum Physics (quant-ph)", "abstract": "Establishing limits of entanglement in open quantum systems is a problem of fundamental interest, with strong implications for applications in quantum information science. Here, we study limits of entanglement stabilization between remote qubits. We theoretically investigate the loss resilience of driven-dissipative entanglement between remote qubits coupled to a chiral waveguide. We find that by coupling a pair of storage qubits to the two driven qubits, the steady state can be tailored such that the storage qubits show a degree of entanglement that is higher than what can be achieved with only two driven qubits coupled to the waveguide. By reducing the degree of entanglement of the driven qubits, we show that the entanglement between the storage qubits becomes more resilient to waveguide loss. Our analytical and numerical results offer insights into how waveguide loss limits the degree of entanglement in this driven-dissipative system, and offers important guidance for remote entanglement stabilization in the laboratory, for example using superconducting circuits."}
{"main_page": "https://arxiv.org/abs/2404.00177", "pdf": "https://arxiv.org/pdf/2404.00177", "title": "Quantum Transition Probabilities", "authors": "Stan Gudder", "subjects": "Quantum Physics (quant-ph)", "abstract": "Transition probabilities are an important and useful tool in quantum mechanics. However, in their present form, they are limited in scope and only apply to pure quantum states. In this article we extend their applicability to mixed states and to transitions between quantum effects. We also present their dependence on a measured operation or instrument. We begin by defining our concepts on a general quantum effect algebra. These concepts are illustrated using Holevo operations and instruments. We then present transition probabilities in the special case of the Hilbert space formulation of quantum mechanics. We show that for pure states and particular types of operations the transition probabilities reduce to their usual form. We give examples in terms of L\\\"uders operations and instruments."}
{"main_page": "https://arxiv.org/abs/2404.00198", "pdf": "https://arxiv.org/pdf/2404.00198", "title": "Extending the self-discharge time of Dicke quantum batteries using  molecular triplets", "authors": "Daniel J. Tibben, Enrico Della Gaspera, Joel van Embden, Philipp Reineck, James Q. Quach, Francesco Campaioli, Daniel E. Gómez", "subjects": "Quantum Physics (quant-ph)", "abstract": "Quantum batteries, quantum systems for energy storage, have gained interest due to their potential scalable charging power density. A quantum battery proposal based on the Dicke model has been explored using organic microcavities, which enable a cavity-enhanced energy transfer process called superabsorption. However, energy storage lifetime in these devices is limited by fast radiative emission losses, worsened by superradiance. Here, we demonstrate a promising approach to extend the energy storage lifetime of Dicke quantum batteries using molecular triplet states. We examine a type of multi-layer microcavities where an active absorption layer transfers energy to the molecular triplets of a storage layer, identifying two regimes based on exciton-polariton resonances. We tested one of these mechanisms by fabricating and characterising five devices across a triplet-polariton resonance. We conclude by discussing potential optimisation outlooks for this class of devices."}
{"main_page": "https://arxiv.org/abs/2404.00202", "pdf": "https://arxiv.org/pdf/2404.00202", "title": "Reaction dynamics with qubit-efficient momentum-space mapping", "authors": "Ronen Weiss, Alessandro Baroni, Joseph Carlson, Ionel Stetcu", "subjects": "Quantum Physics (quant-ph); Nuclear Theory (nucl-th)", "abstract": "Description of quantum many-body dynamics is extremely challenging on classical computers, as it can involve many degrees of freedom. On the other hand, the time evolution of quantum states is a natural application for quantum computers, which are designed to efficiently perform unitary transformations. In this paper we study quantum algorithms for response functions, relevant for describing different reactions governed by linear response. We consider a qubit-efficient mapping on a lattice, which can be efficiently performed using momentum-space basis states. We analyze the advantages and disadvantages of this approach, focusing on the nuclear two-body system and a typical response function relevant for electron scattering as an example. We investigate ground-state preparation, controlled time evolution and the required measurements. We examine circuit depth and the hardware noise level required to interpret the signal."}
{"main_page": "https://arxiv.org/abs/2404.00274", "pdf": "https://arxiv.org/pdf/2404.00274", "title": "Imaging a Chain of Rydberg Superatoms Enabled by  Förster-Resonance-Enhanced Interaction", "authors": "Jinjin Du, Thibault Vogt, Ningxuan Zheng, Wenhui Li", "subjects": "Quantum Physics (quant-ph); Atomic Physics (physics.atom-ph)", "abstract": "We demonstrate single-shot and \\textit{in situ} absorption imaging of individual Rydberg superatoms. This level of resolution is achieved using an electromagnetically induced transparency scheme involving a Rydberg energy level that is highly sensitive to the presence of Rydberg superatoms due to F\\\"{o}rster-resonance-enhanced dipole couplings. Spectroscopic measurements illustrate the existence of the F\\\"{o}rster resonance and underscore the state-selectivity of the technique. With an imaging exposure time as short as 3 $\\mu$s, we successfully resolve linear chains of Rydberg superatoms excited in a one-dimensional configuration. The extracted second-order correlation shows strong anti-bunching due to excitation blockade, and a Fourier analysis reveals the long-range order in the chains of Rydberg superatoms. This imaging technique, with minimal destruction, will be of great interest for leveraging ensemble-encoded qubits in quantum computation and quantum simulation applications."}
{"main_page": "https://arxiv.org/abs/2404.00283", "pdf": "https://arxiv.org/pdf/2404.00283", "title": "Twisted charged particles in the uniform magnetic field with broken  symmetry", "authors": "N. V. Filina, S. S. Baturin", "subjects": "Quantum Physics (quant-ph); Optics (physics.optics)", "abstract": "We present a theoretical description of charged particles with nonzero projection of the orbital angular momentum (OAM) in a uniform magnetic field with broken symmetry of the vector potential. The wave functions we find naturally account for the asymmetry through the continuous gauge parameter and are a generalization of the commonly used Laguerre-Gauss states. We analyze the asymmetric Hamiltonian from an algebraic point of view and show how the OAM projection of the twisted state is modified by symmetry breaking. We provide analytical frameworks for properties of the asymmetric states, such as energy, RMS size, and Cazimir invariant, and discuss advantages of the proposed description."}
{"main_page": "https://arxiv.org/abs/2404.00302", "pdf": "https://arxiv.org/pdf/2404.00302", "title": "Saturation effect in confined quantum systems with energy-dependent  potentials", "authors": "Ohood Ali AL-Sbaheen, Ahmed Al-Jamel, Mohamed Ghaleb Al-Masaeed", "subjects": "Quantum Physics (quant-ph)", "abstract": "In this paper, we study the saturation effect in the energy or mass spectra of three quantum models with energy-dependent potentials: the harmonic oscillator, the hydrogen atom, and the heavy quarkonia. We used the method proposed in \\cite{garcia2009exactly}, which is based on studying various canonical point and gauge transformations applied to a function, $g(x)$, multiplied by a given differential equation of known solutions as special orthogonal functions, that convert it into a Schr{{\\\"o}}dinger-like equation. The first two models stem from implementing the method on the confluent hypergeometric differential of the well-known solutions ${}_1 F_1$, while the third model (heavy quarkonia) stems possibly from the hypergeometric differential of the well-known solutions ${}_2 F_1$. In particular, the heavy quarkonia mass spectra for both $c\\bar c$ and $b\\bar b$ are produced at different values of the saturation parameter $\\lambda$ and compared with the available experimental data. It is found that these systems may exhibit saturation effect when the energy-dependent effect is included."}
{"main_page": "https://arxiv.org/abs/2404.00342", "pdf": "https://arxiv.org/pdf/2404.00342", "title": "Entanglement Swapping Using Hyperentangled Pairs of Two-Level Neutral  Atoms", "authors": "Sajal Hasan, Syed M. Arslan, Muhammad Imran, Rameez-ul Islam, Saif Al-Kuwari, Tasawar Abbas", "subjects": "Quantum Physics (quant-ph)", "abstract": "Hyperentangled swapping is a quantum communication technique that involves the exchange of hyperentangled states, which are quantum states entangled in multiple degrees of freedom, to enable secure and efficient quantum information transfer. In this paper, we demonstrate schematics for the hyperentanglement swapping between separate pairs of neutral atoms through the mathematical framework of atomic Bragg diffraction, which is efficient and resistant to decoherence, yielding deterministic results with superior overall fidelity. The utilized cavities are in superposition state and interact with the incoming atoms off-resonantly. Quantum information carried by the cavities is swapped through resonant interactions with two-level auxiliary atoms. We also discuss entanglement swapping under a delayed-choice scenario and provide a schematic generalization covering multiple-qubit scenarios. Finally, we introduce specific experimental parameters to demonstrate the experimental feasibility of the scheme."}
{"main_page": "https://arxiv.org/abs/2404.00377", "pdf": "https://arxiv.org/pdf/2404.00377", "title": "Maximal quantum interaction between free electrons and photons", "authors": "Zetao Xie, Zeling Chen, Hao Li, Qinghui Yan, Hongsheng Chen, Xiao Lin, Ido Kaminer, Owen D. Miller, Yi Yang", "subjects": "Quantum Physics (quant-ph); Mesoscale and Nanoscale Physics (cond-mat.mes-hall); Accelerator Physics (physics.acc-ph); Optics (physics.optics)", "abstract": "The emerging field of free-electron quantum optics enables electron-photon entanglement and holds the potential for generating nontrivial photon states for quantum information processing. Although recent experimental studies have entered the quantum regime, rapid theoretical developments predict that qualitatively unique phenomena only emerge beyond a certain interaction strength. It is thus pertinent to identify the maximal electron-photon interaction strength and the materials, geometries, and particle energies that enable one to approach it. We derive an upper limit to the quantum vacuum interaction strength between free electrons and single-mode photons, which illuminates the conditions for the strongest interaction. Crucially, we obtain an explicit energy selection recipe for electrons and photons to achieve maximal interaction at arbitrary separations and identify two optimal regimes favoring either fast or slow electrons over those with intermediate velocities. We validate the limit by analytical and numerical calculations on canonical geometries and provide near-optimal designs indicating the feasibility of strong quantum interactions. Our findings offer fundamental intuition for maximizing the quantum interaction between free electrons and photons and provide practical design rules for future experiments on electron-photon and electron-mediated photon-photon entanglement. They should also enable the evaluation of key metrics for applications such as the maximum power of free-electron radiation sources and the maximum acceleration gradient of dielectric laser accelerators."}
{"main_page": "https://arxiv.org/abs/2404.00402", "pdf": "https://arxiv.org/pdf/2404.00402", "title": "Stochastic correction to the Maxwell-Bloch equations via the positive  P-representation", "authors": "Johannes Stowasser (1), Felix Hitzelhammer (2), Michael A. Schreiber (1), Ulrich Hohenester (2), Gabriela Slavcheva (2 and 3), Michael Haider (1), Christian Jirauschek (1 and 4) ((1) TUM School of Computation, Information and Technology, Technical University of Munich, Garching, Germany (2) Institute of Physics, NAWI Graz, University of Graz, Graz, Austria (3) Quantopticon, Chicago, IL, USA (4) TUM Center for Quantum Engineering (ZQE), Garching, Germany)", "subjects": "Quantum Physics (quant-ph)", "abstract": "Focusing on two-level atoms, we apply the positive P-representation to a full-wave mixed bosonic and fermionic system of Jaynes-Cummings type and identify an advantageous degree of freedom in the choice of the involved nonorthogonal fermionic basis states. On this basis, we propose a stochastic correction to the Maxwell-Bloch equations by relating them to a stochastic differential equation on a nonclassical phase space, which captures the full second quantization dynamics of the system. This approach explores the connection between semiclassical and field-quantized treatments of light-matter interaction and can potentially be used for the simulation of nonclassical light sources while retaining the main advantages of a semiclassical model."}
{"main_page": "https://arxiv.org/abs/2404.00440", "pdf": "https://arxiv.org/pdf/2404.00440", "title": "Number of steady states of quantum evolutions", "authors": "Daniele Amato, Paolo Facchi", "subjects": "Quantum Physics (quant-ph); Mathematical Physics (math-ph)", "abstract": "We prove sharp universal upper bounds on the number of steady and asymptotic states of discrete- and continuous-time Markovian evolutions of open quantum systems. We show that the bounds depend only on the dimension of the system and not on the details of the dynamics. A comparison with similar bounds deriving from a recent spectral conjecture for Markovian evolutions is also provided."}
{"main_page": "https://arxiv.org/abs/2404.00496", "pdf": "https://arxiv.org/pdf/2404.00496", "title": "Reducing of the Uncertainty Product of Coherent Light through  Multi-Photon Interference", "authors": "Sangbae Kim, Joachim Stohr, Fabian Rotermund, Byoung S. Ham", "subjects": "Quantum Physics (quant-ph)", "abstract": "We demonstrate theoretically and experimentally how the diffraction and interferometric resolution limit for single-mode coherent cw laser light can be overcome by multi-photon interference. By use of a Mach-Zehnder interferometer, operated in the single input and single or double output port geometries, we observe a fringe width reduction of the conventional interference pattern, predicted by the wave or single photon quantum theory, by a factor of up to $1/\\sqrt{2N}$ through coincident detection of $N=2,3,4$ photons. Our scheme does not require squeezed or entangled light to overcome the standard quantum limit and greatly facilitates precision interferometry experiments."}
{"main_page": "https://arxiv.org/abs/2404.00512", "pdf": "https://arxiv.org/pdf/2404.00512", "title": "Teleportation two-qubit state by using two different protocols", "authors": "K. El Anouz, A. El Allati, N. Metwally", "subjects": "Quantum Physics (quant-ph)", "abstract": "In this contribution, two versions of teleportation protocol are considered, based on either using a single or two copies of entangled atom-field state, respectively. It is shown that, by using the first version, the fidelity of the teleported state as well as the amount of quantum Fisher information, that contains in the teleported state, are much better than using the second version. In general, one may increases the fidelity of teleported information by increasing the mean photon number and decreasing the detuning parameter. The fidelity of teleporting classical information is much better than teleporting quantum information. Moreover, teleportating classical information that initially encoded in an exited states is much better than that encodes in the ground states. However, the teleported Fisher information that initially encoded in a ground state is much larger than those initially encoded in entangled states."}
{"main_page": "https://arxiv.org/abs/2404.00517", "pdf": "https://arxiv.org/pdf/2404.00517", "title": "Achieving quantum advantage in a search for a minimal Goldbach partition  with driven atoms in tailored potentials", "authors": "Oleksandr V. Marchukov, Andrea Trombettoni, Giuseppe Mussardo, Maxim Olshanii", "subjects": "Quantum Physics (quant-ph)", "abstract": "The famous Goldbach conjecture states that any even natural number $N$ greater than $2$ can be written as the sum of two prime numbers $p$ and $p'$, with $p \\, , p'$ referred to as a Goldbach pair. In this article we present a quantum analogue protocol for detecting -- given a even number $N$ -- the existence of a so-called minimal Goldbach partition $N=p+p'$ with $p\\equiv p_{\\rm min}(N)$ being the so-called minimal Goldbach prime, i.e. the least possible value for $p$ among all the Goldbach pairs of $N$. The proposed protocol is effectively a quantum Grover algorithm with a modified final stage. Assuming that an approximate smooth upper bound $\\mathcal{N}(N)$ for the number of primes less than or equal to $ p_{\\rm min}(N)$ is known, our protocol will identify if the set of $\\mathcal{N}(N)$ lowest primes contains the minimal Goldbach prime in approximately $\\sqrt{\\mathcal{N}(N)}$ steps, against the corresponding classical value $\\mathcal{N}(N)$. In the larger context of a search for violations of Goldbach's conjecture, the quantum advantage provided by our scheme appears to be potentially convenient. E.g., referring to the current state-of-art numerical search for violations of the Goldbach conjecture among all even numbers up to $N_{\\text{max}} = 4\\times 10^{18}$ [T. O. e Silva, S. Herzog, and S. Pardi, Mathematics of Computation 83, 2033 (2013)], a quantum realization of the search would deliver a quantum advantage factor of $\\sqrt{\\mathcal{N}(N_{\\text{max}})} \\approx 37$ and it will require a Hilbert space spanning $\\mathcal{N}(N_{\\text{max}}) \\approx 1376$ basis states."}
{"main_page": "https://arxiv.org/abs/2404.00531", "pdf": "https://arxiv.org/pdf/2404.00531", "title": "Enhancing interferometry using weak value amplification with real weak  values", "authors": "Jing-Hui Huang, Kyle M. Jordan, Adetunmise C. Dada, Xiang-Yun Hu, Jeff. S. Lundeen", "subjects": "Quantum Physics (quant-ph)", "abstract": "We introduce an ultra-sensitive interferometric protocol that combines weak value amplification (WVA) with traditional interferometry. This WVA+interferometry protocol uses weak value amplification of the relative delay between two paths to enhance the interferometric sensitivity, approaching the quantum limit for classical light. As an example, we demonstrate a proof-of-principle experiment that achieves few-attosecond timing resolution (few-nanometer path length resolution) with a double-slit interferometer using only common optical components. Since our example uses only the spatial shift of double-slit interference fringes, its precision is not limited by the timing resolution of the detectors, but is instead limited solely by the fundamental shot noise associated with classical light. We experimentally demonstrate that the signal-to-noise ratio can be improved by one to three orders of magnitude and approaches the shot-noise limit in the large amplification regime. Previously, quantum-limited WVA delay measurements were thought to require imaginary weak values, which necessitate light with a broad spectral bandwidth and high-resolution spectrometers. In contrast, our protocol highlights the feasibility of using real weak values and narrowband light. Thus, our protocol is a compelling and cost-effective approach to enhance interferometry."}
{"main_page": "https://arxiv.org/abs/2404.00584", "pdf": "https://arxiv.org/pdf/2404.00584", "title": "Quantum Heat Transformers", "authors": "Arghya Maity, Paranjoy Chaki, Ahana Ghoshal, Ujjwal Sen", "subjects": "Quantum Physics (quant-ph)", "abstract": "We propose a quantum heat transformer (QHT) designed to function analogous to classical voltage transformers. Unlike the classical counterparts, which regulate voltage, a QHT regulates temperature differences between its terminals. We initially design the device for a three-qubit system, representing the smallest possible self-contained heat transformer model. Subsequently we extend to four-qubit systems, with a specific emphasis on exploring the step-down mode for identifying the primary figure of merit. We showcase the versatility and adaptability of the models by demonstrating the availability of various self-contained setups. A key performance indicator, the capacity of thermal control, is defined to measure the capability of QHTs. An important effect in this study is the proof of existence of a necessarily transient step-down quantum heat transformer, that has a dual-mode characteristic, wherein the desired step-down mode can be realized within the transient regime of an originally designed step-up mode of the QHT. We also investigate how to control this transient domain up to which the necessarily transient mode can be achieved, by regulating the initial temperature of the qubits in the four-qubit settings. Therefore, this quantum heat transformer model not only acts as an analog to the classical voltage transformer, but also enjoys advanced characteristics, enabling it to function in both step-up and step-down modes within the same setup, unattainable for voltage transformers."}
{"main_page": "https://arxiv.org/abs/2404.00617", "pdf": "https://arxiv.org/pdf/2404.00617", "title": "Geometric and information-theoretic aspects of quantum thermodynamics", "authors": "A de Oliveira Junior", "subjects": "Quantum Physics (quant-ph)", "abstract": "In this thesis, I investigate various aspects of one of the most fundamental questions in thermodynamics: what state transformations can quantum systems undergo while interacting with a thermal bath under specific constraints? These constraints may involve total energy conservation, memory effects, or finite-size considerations. Addressing this question leads to (i) a characterisation of the structure of the thermodynamic arrow of time, (ii) a framework bridging the gap between memoryless and arbitrarily non-Markovian thermodynamic processes, and (iii) a derivation of the famous fluctuation-dissipation relation within a quantum information framework. Finally, the last part of this thesis focuses on studying a ubiquitous phenomenon in science, so-called catalysis. It involves using an auxiliary system (a catalyst) to enable processes that would otherwise be impossible. Over the last two decades, this notion has spread to the field of quantum physics. However, this effect is typically described within a highly abstract framework. Despite its successes, this approach struggles to fully capture the behaviour of physically realisable systems, thereby limiting the applicability of quantum catalysis in practical scenarios. Strikingly, I will demonstrate this effect in a paradigmatic quantum optics setup, namely the Jaynes-Cummings model, where an atom interacts with an optical cavity. The atom plays the role of the catalyst and allows for the deterministic generation of non-classical light in the cavity, as evidenced by sub-Poissonian statistics or Wigner negativity."}
{"main_page": "https://arxiv.org/abs/2404.00637", "pdf": "https://arxiv.org/pdf/2404.00637", "title": "Imaginarity measure induced by relative entropy", "authors": "Xiangyu Chen, Qiang Lei", "subjects": "Quantum Physics (quant-ph)", "abstract": "Quantum resource theories provide a new perspective and method for the development and application of science. Imaginary numbers are used to describe and solve many complex problems. Therefore imaginarity resource theory proposed recently has become increasingly important and it is worthy of research. In this paper, we find two imaginarity measures, one of which is induced by $\\alpha$--$z$--R\\'enyi relative entropy and the other defined for positive definite density matrices is induced by Tsallis relative operator entropy. The relationships between different imaginarity measures and their properties are also discussed."}
{"main_page": "https://arxiv.org/abs/2404.00723", "pdf": "https://arxiv.org/pdf/2404.00723", "title": "Quantum Weak Force Sensing with Squeezed Magnomechanics", "authors": "Qian Zhang, Jie Wang, Tian-Xiang Lu, Franco Nori, Hui Jing", "subjects": "Quantum Physics (quant-ph); Optics (physics.optics)", "abstract": "Cavity magnomechanics, exhibiting remarkable experimental tunability, rich magnonic nonlinearities, and compatibility with various quantum systems, has witnessed considerable advances in recent years. However, the potential benefits of using cavity magnomechanical (CMM) systems in further improving the performance of quantum-enhanced sensing for weak forces remain largely unexplored. Here we show that the performance of a quantum CMM sensor can be significantly enhanced beyond the standard quantum limit (SQL), by squeezing the magnons. We find that, for comparable parameters, two orders of enhancement in force sensitivity can be achieved in comparison with the case without the magnon squeezing. Moreover, we show optimal parameter regimes of homodyne angle for minimizing added quantum noise. Our findings provide a promising approach for highly tunable and compatible quantum force sensing using hybrid CMM devices, with potential applications ranging from quantum precision measurements to quantum information processing."}
{"main_page": "https://arxiv.org/abs/2404.00740", "pdf": "https://arxiv.org/pdf/2404.00740", "title": "Quantum walks and correlated dynamics in an interacting synthetic  Rydberg lattice", "authors": "Tao Chen, Chenxi Huang, Bryce Gadway, Jacob P. Covey", "subjects": "Quantum Physics (quant-ph); Quantum Gases (cond-mat.quant-gas); Atomic Physics (physics.atom-ph)", "abstract": "Coherent dynamics of interacting quantum particles plays a central role in the study of strongly correlated quantum matter and the pursuit of quantum information processors. Here, we present the state-space of interacting Rydberg atoms as a synthetic landscape on which to control and observe coherent and correlated dynamics. With full control of the coupling strengths and energy offsets between the pairs of sites in a nine-site synthetic lattice, we realize quantum walks, Bloch oscillations, and dynamics in an Escher-type ``continuous staircase\". In the interacting regime, we observe correlated quantum walks, Bloch oscillations, and confinement of particle pairs. Additionally, we simultaneously tilt our lattice both up and down to achieve coherent pair oscillations. This work establishes synthetic Rydberg lattices of interacting atom arrays as a promising platform for programmable quantum many-body dynamics with access to features that are difficult to realize in real-space lattices."}
{"main_page": "https://arxiv.org/abs/2404.00743", "pdf": "https://arxiv.org/pdf/2404.00743", "title": "Complex phases in quantum mechanics", "authors": "Carl M. Bender, Daniel W. Hook", "subjects": "Quantum Physics (quant-ph)", "abstract": "Hamilton's equations of motion are local differential equations and boundary conditions are required to determine the solution uniquely. Depending on the choice of boundary conditions, a Hamiltonian may thereby describe several different physically observable phases, each exhibiting its own characteristic global symmetry."}
{"main_page": "https://arxiv.org/abs/2404.00792", "pdf": "https://arxiv.org/pdf/2404.00792", "title": "Entropy bounds for device-independent quantum key distribution with  local Bell test", "authors": "Ernest Y.-Z. Tan, Ramona Wolf", "subjects": "Quantum Physics (quant-ph)", "abstract": "One of the main challenges in device-independent quantum key distribution (DIQKD) is achieving the required Bell violation over long distances, as the channel losses result in low overall detection efficiencies. Recent works have explored the concept of certifying nonlocal correlations over extended distances through the use of a local Bell test. Here, an additional quantum device is placed in close proximity to one party, using short-distance correlations to verify nonlocal behavior at long distances. However, existing works have either not resolved the question of DIQKD security against active attackers in this setup, or used methods that do not yield tight bounds on the keyrates. In this work, we introduce a general formulation of the key rate computation task in this setup that can be combined with recently developed methods for analyzing standard DIQKD. Using this method, we show that if the short-distance devices exhibit sufficiently high detection efficiencies, positive key rates can be achieved in the long-distance branch with lower detection efficiencies as compared to standard DIQKD setups. This highlights the potential for improved performance of DIQKD over extended distances in scenarios where short-distance correlations are leveraged to validate quantum correlations."}
{"main_page": "https://arxiv.org/abs/2404.00819", "pdf": "https://arxiv.org/pdf/2404.00819", "title": "Ultra-relativistic quark-nucleus scattering on quantum computers", "authors": "Sihao Wu, Weijie Du, Xingbo Zhao, James P. Vary", "subjects": "Quantum Physics (quant-ph); High Energy Physics - Theory (hep-th); Nuclear Theory (nucl-th)", "abstract": "Quantum computing provides a promising approach for solving the real-time dynamics of systems consist of quarks and gluons from first-principle calculations that are intractable with classical computers. In this work, we start with an initial problem of the ultra-relativistic quark-nucleus scattering and present an efficient and precise approach to quantum simulate the dynamics on the light front. This approach employs the eigenbasis of the asymptotic scattering system and implements the compact scheme for basis encoding. It exploits the operator structure of the light-front Hamiltonian of the scattering system, which enables the Hamiltonian input scheme that utilizes the quantum Fourier transform for efficiency. It utilizes the truncated Taylor series for the dynamics simulations. The qubit cost of our approach scales logarithmically with the Hilbert space dimension of the scattering system. The gate cost has optimal scaling with the simulation error and near optimal scaling with the simulation time. These scalings make our approach advantageous for large-scale dynamics simulations on future fault-tolerant quantum computers. We demonstrate our approach with a simple scattering problem and benchmark the results with those from the Trotter algorithm and the classical calculations, where good agreement between the results is found."}
{"main_page": "https://arxiv.org/abs/2404.00871", "pdf": "https://arxiv.org/pdf/2404.00871", "title": "Quantum Metrology of Absorption and Gain Parameters using Two-Mode  Bright Squeezed Light", "authors": "Mrunal Kamble, Jiaxuan Wang, Girish S. Agarwal", "subjects": "Quantum Physics (quant-ph)", "abstract": "Absorption and gain processes are fundamental to any light-matter interaction and a precise measurement of these parameters is important for various scientific and technological applications. Quantum probes, specifically the squeezed states have proved very successful, particularly in the applications that deal with phase shift and force measurements. In this paper, we focus on improving the sensitivity of the estimation of the photon loss coefficient of a weakly absorbing medium as well as the estimation of the gain parameter using a two-mode bright squeezed state. The generation of this state combines the advantage of a coherent beam for its large photon number with the quantum properties of the two-mode squeezing operation in an optical parametric amplifier. We present two measurement schemes: balanced photodetection and time-reversed metrology, both utilizing two-mode bright squeezed light. The maximum quantum advantage we can achieve using two-mode bright squeezed light is 3.7 times for the absorption parameter $\\alpha = 0.05$ and 8.4 times for $\\alpha = 0.01$ as compared to using only the coherent state. Similarly, the maximum quantum advantage for the estimation of optical gain is found around 2.81 times for the gain coefficient $G=1.05$ and around 6.28 times for $G=1.01$. We discuss the significance of using one measurement scheme over the other under different squeezing conditions. We compare our results with the Cram\\'er-Rao bound for a two-mode bright squeezed state to assess the quality of the proposed methodologies."}
{"main_page": "https://arxiv.org/abs/2404.00926", "pdf": "https://arxiv.org/pdf/2404.00926", "title": "Two prover perfect zero knowledge for MIP*", "authors": "Kieran Mastel, William Slofstra", "subjects": "Quantum Physics (quant-ph); Computational Complexity (cs.CC)", "abstract": "The recent MIP*=RE theorem of Ji, Natarajan, Vidick, Wright, and Yuen shows that the complexity class MIP* of multiprover proof systems with entangled provers contains all recursively enumerable languages. Prior work of Grilo, Slofstra, and Yuen [FOCS '19] further shows (via a technique called simulatable codes) that every language in MIP* has a perfect zero knowledge (PZK) MIP* protocol. The MIP*=RE theorem uses two-prover one-round proof systems, and hence such systems are complete for MIP*. However, the construction in Grilo, Slofstra, and Yuen uses six provers, and there is no obvious way to get perfect zero knowledge with two provers via simulatable codes. This leads to a natural question: are there two-prover PZK-MIP* protocols for all of MIP*? In this paper, we show that every language in MIP* has a two-prover one-round PZK-MIP* protocol, answering the question in the affirmative. For the proof, we use a new method based on a key consequence of the MIP*=RE theorem, which is that every MIP* protocol can be turned into a family of boolean constraint system (BCS) nonlocal games. This makes it possible to work with MIP* protocols as boolean constraint systems, and in particular allows us to use a variant of a construction due to Dwork, Feige, Kilian, Naor, and Safra [Crypto '92] which gives a classical MIP protocol for 3SAT with perfect zero knowledge. To show quantum soundness of this classical construction, we develop a toolkit for analyzing quantum soundness of reductions between BCS games, which we expect to be useful more broadly. This toolkit also applies to commuting operator strategies, and our argument shows that every language with a commuting operator BCS protocol has a two prover PZK commuting operator protocol."}
{"main_page": "https://arxiv.org/abs/2404.00935", "pdf": "https://arxiv.org/pdf/2404.00935", "title": "Random Circuit Sampling: Fourier Expansion and Statistics", "authors": "Gil Kalai, Yosef Rinott, Tomer Shoham", "subjects": "Quantum Physics (quant-ph); Computational Complexity (cs.CC); Statistics Theory (math.ST)", "abstract": "Considerable effort in experimental quantum computing is devoted to noisy intermediate scale quantum computers (NISQ computers). Understanding the effect of noise is important for various aspects of this endeavor including notable claims for achieving quantum supremacy and attempts to demonstrate quantum error correcting codes. In this paper we use Fourier methods combined with statistical analysis to study the effect of noise. In particular, we use Fourier analysis to refine the linear cross-entropy fidelity estimator. We use both analytical methods and simulations to study the effect of readout and gate errors, and we use our analysis to study the samples of Google's 2019 quantum supremacy experiment."}
{"main_page": "https://arxiv.org/abs/2404.00970", "pdf": "https://arxiv.org/pdf/2404.00970", "title": "Effect of magnetic field on the Bose-Einstein condensation of quantum  well exciton-polaritons", "authors": "Le Tri Dat, Vinh N.T. Pham, Tran Duong Anh-Tai, Vo Quoc Phong, Nguyen Duy Vy", "subjects": "Quantum Physics (quant-ph)", "abstract": "We theoretically examine the effect of the magnetic field on the relaxation process of the exciton-polariton toward the Bose-Einstein condensation in GaAs quantum wells. As a result of the modification of the exciton's effective mass, Rabi splitting, and dispersion, the relaxation rate of polaritons toward condensation has been significantly modified. Using a continuous pumping, the dynamics of total and condensated polariton versus magnetic field has been clarified. It has been shown that for low-energy pumping, the condensation is significantly reduced with a magnetic field, and this arises from the reduction of the scattering rate between energy levels when the steepness of the dispersion at higher energy is reduced. Increasing of pump energy together with the magnetic field could lead to a more effective relaxation and a much higher number of condensated polariton is obtained."}
{"main_page": "https://arxiv.org/abs/2404.01004", "pdf": "https://arxiv.org/pdf/2404.01004", "title": "Classical modelling of a lossy Gaussian bosonic sampler", "authors": "M.V. Umanskii, A.N. Rubtsov", "subjects": "Quantum Physics (quant-ph)", "abstract": "Gaussian boson sampling (GBS) is considered a candidate problem for demonstrating quantum advantage. We propose an algorithm for approximate classical simulation of a lossy GBS instance. The algorithm relies on the Taylor series expansion, and increasing the number of terms of the expansion that are used in the calculation yields greater accuracy. The complexity of the algorithm is polynomial in the number of modes given the number of terms is fixed. We describe conditions for the input state squeezing parameter and loss level that provide the best efficiency for this algorithm (by efficient we mean that the Taylor series converges quickly). In recent experiments that claim to have demonstrated quantum advantage, these conditions are satisfied; thus, this algorithm can be used to classically simulate these experiments."}
{"main_page": "https://arxiv.org/abs/2404.01068", "pdf": "https://arxiv.org/pdf/2404.01068", "title": "Dual-Unitary Classical Shadow Tomography", "authors": "Ahmed A. Akhtar, Namit Anand, Jeffrey Marshall, Yi-Zhuang You", "subjects": "Quantum Physics (quant-ph); Disordered Systems and Neural Networks (cond-mat.dis-nn); Statistical Mechanics (cond-mat.stat-mech); Mathematical Physics (math-ph)", "abstract": "We study operator spreading in random dual-unitary circuits within the context of classical shadow tomography. Primarily, we analyze the dynamics of the Pauli weight in one-dimensional qubit systems evolved by random two-local dual-unitary gates arranged in a brick-wall structure, ending with a final measurement layer. We do this by deriving general constraints on the Pauli weight transfer matrix and specializing to the case of dual-unitarity. We first show that dual-unitaries must have a minimal amount of entropy production. Remarkably, we find that operator spreading in these circuits has a rich structure resembling that of relativistic quantum field theories, with massless chiral excitations that can decay or fuse into each other, which we call left- or right-movers. We develop a mean-field description of the Pauli weight in terms of $\\rho(x,t)$, which represents the probability of having nontrivial support at site $x$ and depth $t$ starting from a fixed weight distribution. We develop an equation of state for $\\rho(x,t)$, and simulate it numerically using Monte Carlo simulations. Lastly, we demonstrate that the fast-thermalizing properties of dual-unitary circuits make them better at predicting large operators than shallow brick-wall Clifford circuits."}
{"main_page": "https://arxiv.org/abs/2404.01138", "pdf": "https://arxiv.org/pdf/2404.01138", "title": "Protocols and Trade-Offs of Quantum State Purification", "authors": "Hongshun Yao, Yu-Ao Chen, Erdong Huang, Kaichu Chen, Xin Wang", "subjects": "Quantum Physics (quant-ph)", "abstract": "Quantum state purification plays a pivotal role in quantum communication and quantum computation, aiming to recover the purified state from multiple copies of an unknown noisy state. This work introduces a general state purification framework designed to achieve the highest fidelity with a specified probability and characterize the associated trade-offs. In particular, for i.i.d. quantum states under depolarizing noise, we propose an explicit purification protocol capable of achieving maximal fidelity with a target probability. Furthermore, we present quantum circuits for implementing the optimal purification protocols via the block encoding technique and propose recursive protocols for stream purification. Finally, we demonstrate the advantages of our protocols in terms of efficiency and flexibility in purifying noisy quantum states under various quantum noise models of interest, showcasing the effectiveness and versatility of our approach."}
{"main_page": "https://arxiv.org/abs/2404.01173", "pdf": "https://arxiv.org/pdf/2404.01173", "title": "Strong quantum state transfer on graphs via loop edges", "authors": "Gabor Lippner, Yujia Shi", "subjects": "Quantum Physics (quant-ph); Combinatorics (math.CO)", "abstract": "We quantify the effect of weighted loops at the source and target nodes of a graph on the strength of quantum state transfer between these vertices. We give lower bounds on loop weights that guarantee strong transfer fidelity that works for any graph where this protocol is feasible. By considering local spectral symmetry, we show that the required weight size depends only on the maximum degree of the graph and, in some less favorable cases, the distance between vertices. Additionally, we explore the duration for which transfer strength remains above a specified threshold."}
{"main_page": "https://arxiv.org/abs/2404.01202", "pdf": "https://arxiv.org/pdf/2404.01202", "title": "Device-independent quantum key distribution based on routed Bell tests", "authors": "Tristan Le Roy-Deloison, Edwin Peter Lobo, Jef Pauwels, Stefano Pironio", "subjects": "Quantum Physics (quant-ph)", "abstract": "Photon losses are the main obstacle to fully photonic implementations of device-independent quantum key distribution (DIQKD). Motivated by recent work showing that routed Bell scenarios offer increased robustness to detection inefficiencies for the certification of long-range quantum correlations, we investigate DIQKD protocols based on a routed setup. In these protocols, in some of the test rounds, photons from the source are routed by an actively controlled switch to a nearby test device instead of the distant one. We show how to analyze the security of these protocols and compute lower bounds on the key rates using non-commutative polynomial optimization and the Brown-Fawzi-Fazwi method. We determine lower bounds on the asymptotic key rates of several simple two-qubit routed DIQKD protocols based on CHSH or BB84 correlations and compare their performance to standard protocols. We find that in an ideal case routed DIQKD protocols can significantly improve detection efficiency requirements, by up to $\\sim 30\\%$, compared to their non-routed counterparts. Notably, the routed BB84 protocol achieves a positive key rate with a detection efficiency as low as $50\\%$ for the distant device, the minimal threshold for any QKD protocol featuring two untrusted measurements. However, the advantages we find are highly sensitive to noise and losses affecting the short-range correlations involving the additional test device."}
{"main_page": "https://arxiv.org/abs/2404.01211", "pdf": "https://arxiv.org/pdf/2404.01211", "title": "Non-Hermitian unidirectional routing of photonic qubits", "authors": "En-Ze Li, Yi-Yang Liu, Ming-Xin Dong, Dong-Sheng Ding, Bao-Sen Shi", "subjects": "Quantum Physics (quant-ph); Applied Physics (physics.app-ph)", "abstract": "Efficient and tunable qubit unidirectional routers and spin-wave diodes play an important role in both classical and quantum information processing domains. Here, we reveal that multi-level neutral cold atoms can mediate both dissipative and coherent couplings. Interestingly, we investigate and practically implement this paradigm in experiments, successfully synthesizing a system with dual functionality as both a photonic qubit unidirectional router and a spin-wave diode. By manipulating the helicity of the field, we can effectively balance the coherence coupling and dissipative channel, thereby ensuring the unidirectional transfer of photonic qubits. The qubit fidelity exceeds 97.49%, and the isolation ratio achieves $16.8\\pm0.11$ dB while the insertion loss is lower than 0.36 dB. Furthermore, we show that the spin-wave diode can effectively achieve unidirectional information transfer by appropriately setting the coherent coupling parameters. Our work not only provides new ideas for the design of extensive components in quantum networks, but also opens up new possibilities for non-Hermitian quantum physics, complex quantum networks, and unidirectional quantum information transfer."}
{"main_page": "https://arxiv.org/abs/2404.01212", "pdf": "https://arxiv.org/pdf/2404.01212", "title": "Secret Sharing, Teleportation and Bell's Inequality", "authors": "Pratishtha Abrol, Pahulpreet Singh, Indranil Chakrabarty", "subjects": "Quantum Physics (quant-ph)", "abstract": "For faithful secret sharing and reconstruction, it is vital that independent reconstruction is not possible. A tripartite state that satisfies this criterion is said to be a potential resource for secret sharing. Such a state imposes restrictions on the maximum values of teleportation fidelity and Bell's Inequality Violation achieved, both being crucial metrics in quantum communication protocols. This paper explores the link between reconstruction fidelity of a three-party state and two bipartite teleportation fidelities involving the dealer and receivers. Additionally, it investigates the correlation between the reconstruction fidelity and the bipartite values of Bell's Inequality Violation observable among the same parties. By analyzing these connections, this paper aims to ascertain the maximum achievable reconstruction fidelity under the constraints posed by the maximum teleportation fidelity or Bell's Inequality Violation value. In doing so, it provides valuable insights into the fundamental limits of quantum communication protocols, particularly in the realm of secure information transmission."}
{"main_page": "https://arxiv.org/abs/2404.01221", "pdf": "https://arxiv.org/pdf/2404.01221", "title": "Upper bound for the quantum coupling between free electrons and photons", "authors": "Zhexin Zhao", "subjects": "Quantum Physics (quant-ph); Optics (physics.optics)", "abstract": "The quantum interaction between free electrons and photons is fundamental to free-electron based light sources and free-electron quantum optics applications. A large coupling between free electrons and photons is generally desired. In this manuscript, I study the upper bound for the quantum coupling between free electrons and photons. Our study provides guidance to reach the strong coupling between free electrons and photons."}
{"main_page": "https://arxiv.org/abs/2404.01265", "pdf": "https://arxiv.org/pdf/2404.01265", "title": "Review of Distributed Quantum Computing. From single QPU to High  Performance Quantum Computing", "authors": "David Barral, F. Javier Cardama, Guillermo Díaz, Daniel Faílde, Iago F. Llovo, Mariamo Mussa Juane, Jorge Vázquez-Pérez, Juan Villasuso, César Piñeiro, Natalia Costas, Juan C. Pichel, Tomás F. Pena, Andrés Gómez", "subjects": "Quantum Physics (quant-ph); Emerging Technologies (cs.ET)", "abstract": "The emerging field of quantum computing has shown it might change how we process information by using the unique principles of quantum mechanics. As researchers continue to push the boundaries of quantum technologies to unprecedented levels, distributed quantum computing raises as an obvious path to explore with the aim of boosting the computational power of current quantum systems. This paper presents a comprehensive survey of the current state of the art in the distributed quantum computing field, exploring its foundational principles, landscape of achievements, challenges, and promising directions for further research. From quantum communication protocols to entanglement-based distributed algorithms, each aspect contributes to the mosaic of distributed quantum computing, making it an attractive approach to address the limitations of classical computing. Our objective is to provide an exhaustive overview for experienced researchers and field newcomers."}
{"main_page": "https://arxiv.org/abs/2404.01277", "pdf": "https://arxiv.org/pdf/2404.01277", "title": "Direct detection of quasiparticle tunneling with a charge-sensitive  superconducting sensor coupled to a waveguide", "authors": "Kazi Rafsanjani Amin, Axel M. Eriksson, Mikael Kervinen, Linus Andersson, Robert Rehammar, Simone Gasparinetti", "subjects": "Quantum Physics (quant-ph); Mesoscale and Nanoscale Physics (cond-mat.mes-hall)", "abstract": "Detecting quasiparticle tunneling events in superconducting circuits provides information about the population and dynamics of non-equilibrium quasiparticles. Such events can be detected by monitoring changes in the frequency of an offset-charge-sensitive superconducting qubit. This monitoring has so far been performed by Ramsey interferometry assisted by a readout resonator. Here, we demonstrate a quasiparticle detector based on a superconducting qubit directly coupled to a waveguide. We directly measure quasiparticle number parity on the qubit island by probing the coherent scattering of a microwave tone, offering simplicity of operation, fast detection speed, and a large signal-to-noise ratio. We observe tunneling rates between 0.8 and $7~\\rm{s}^{-1}$, depending on the average occupation of the detector qubit, and achieve a temporal resolution below $10~\\mu\\rm{s}$ without a quantum-limited amplifier. Our simple and efficient detector lowers the barrier to perform studies of quasiparticle population and dynamics, facilitating progress in fundamental science, quantum information processing, and sensing."}
{"main_page": "https://arxiv.org/abs/2404.01285", "pdf": "https://arxiv.org/pdf/2404.01285", "title": "Weak-coupling limits of the quantum Langevin equation for an oscillator", "authors": "Aritra Ghosh, Sushanta Dattagupta", "subjects": "Quantum Physics (quant-ph); Statistical Mechanics (cond-mat.stat-mech)", "abstract": "The quantum Langevin equation as obtained from the independent-oscillator model describes a strong-coupling situation, devoid of the Born-Markov approximation that is employed in the context of the Gorini-Kossakowski-Sudarshan-Lindblad equation. The question we address is what happens when we implement such `Born-Markov'-like approximations at the level of the quantum Langevin equation for a harmonic oscillator which carries a noise term satisfying a fluctuation-dissipation theorem. In this backdrop, we also comment on the rotating-wave approximation."}
{"main_page": "https://arxiv.org/abs/2404.01287", "pdf": "https://arxiv.org/pdf/2404.01287", "title": "Understanding and utilizing the inner bonds of process tensors", "authors": "Moritz Cygorek, Erik M. Gauger", "subjects": "Quantum Physics (quant-ph); Mesoscale and Nanoscale Physics (cond-mat.mes-hall)", "abstract": "Process tensor matrix product operators (PT-MPOs) enable numerically exact simulations for an unprecedentedly broad range of open quantum systems. By representing environment influences in MPO form, they can be efficiently compressed using established algorithms. The dimensions of inner bonds of the compressed PT-MPO may be viewed as an indicator of the complexity of the environment. Here, we show that the inner bonds themselves, not only their dimensions, have a concrete physical meaning: They represent the subspace of the full environment Liouville space which hosts environment excitations that may influence the subsequent open quantum systems dynamics the most. This connection can be expressed in terms of lossy linear transformations, whose pseudoinverses facilitate the extraction of environment observables. We demonstrate this by extracting the environment spin of a central spin problem, the current through a quantum system coupled to two leads, the number of photons emitted from quantum emitters into a structured environment, and the distribution of the total absorbed energy in a driven non-Markovian quantum system into system, environment, and interaction energy terms. Numerical tests further indicate that different PT-MPO algorithms compress environments to similar subspaces. Thus, the physical interpretation of inner bonds of PT-MPOs both provides a conceptional understanding and it enables new practical applications."}
